#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_M_OldCloth001_Implimentation

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_M_OldCloth001_Implimentation.ABP_M_OldCloth001_Implimentation_C.AnimBlueprintGeneratedConstantData
// 0x00D7 (0x00D8 - 0x0001)
struct ABP_M_OldCloth001_Implimentation::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_4CBF[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_23;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CC0[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_24;                               // 0x0010(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_25;                                 // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_26;                                 // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0040(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00C0(0x0018)()
};
static_assert(alignof(ABP_M_OldCloth001_Implimentation::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_M_OldCloth001_Implimentation::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_M_OldCloth001_Implimentation::FAnimBlueprintGeneratedConstantData) == 0x0000D8, "Wrong size on ABP_M_OldCloth001_Implimentation::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_M_OldCloth001_Implimentation::FAnimBlueprintGeneratedConstantData, __NameProperty_23) == 0x000004, "Member 'ABP_M_OldCloth001_Implimentation::FAnimBlueprintGeneratedConstantData::__NameProperty_23' has a wrong offset!");
static_assert(offsetof(ABP_M_OldCloth001_Implimentation::FAnimBlueprintGeneratedConstantData, __StructProperty_24) == 0x000010, "Member 'ABP_M_OldCloth001_Implimentation::FAnimBlueprintGeneratedConstantData::__StructProperty_24' has a wrong offset!");
static_assert(offsetof(ABP_M_OldCloth001_Implimentation::FAnimBlueprintGeneratedConstantData, __NameProperty_25) == 0x000030, "Member 'ABP_M_OldCloth001_Implimentation::FAnimBlueprintGeneratedConstantData::__NameProperty_25' has a wrong offset!");
static_assert(offsetof(ABP_M_OldCloth001_Implimentation::FAnimBlueprintGeneratedConstantData, __NameProperty_26) == 0x000038, "Member 'ABP_M_OldCloth001_Implimentation::FAnimBlueprintGeneratedConstantData::__NameProperty_26' has a wrong offset!");
static_assert(offsetof(ABP_M_OldCloth001_Implimentation::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000040, "Member 'ABP_M_OldCloth001_Implimentation::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_M_OldCloth001_Implimentation::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000C0, "Member 'ABP_M_OldCloth001_Implimentation::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

