#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Player_Hair008_Implementation

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Player_Hair008_Implementation.ABP_Player_Hair008_Implementation_C.AnimBlueprintGeneratedConstantData
// 0x00D7 (0x00D8 - 0x0001)
struct ABP_Player_Hair008_Implementation::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_541C[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_35;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541D[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_36;                               // 0x0010(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_37;                                 // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_38;                                 // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0040(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00C0(0x0018)()
};
static_assert(alignof(ABP_Player_Hair008_Implementation::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Player_Hair008_Implementation::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Player_Hair008_Implementation::FAnimBlueprintGeneratedConstantData) == 0x0000D8, "Wrong size on ABP_Player_Hair008_Implementation::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Player_Hair008_Implementation::FAnimBlueprintGeneratedConstantData, __NameProperty_35) == 0x000004, "Member 'ABP_Player_Hair008_Implementation::FAnimBlueprintGeneratedConstantData::__NameProperty_35' has a wrong offset!");
static_assert(offsetof(ABP_Player_Hair008_Implementation::FAnimBlueprintGeneratedConstantData, __StructProperty_36) == 0x000010, "Member 'ABP_Player_Hair008_Implementation::FAnimBlueprintGeneratedConstantData::__StructProperty_36' has a wrong offset!");
static_assert(offsetof(ABP_Player_Hair008_Implementation::FAnimBlueprintGeneratedConstantData, __NameProperty_37) == 0x000030, "Member 'ABP_Player_Hair008_Implementation::FAnimBlueprintGeneratedConstantData::__NameProperty_37' has a wrong offset!");
static_assert(offsetof(ABP_Player_Hair008_Implementation::FAnimBlueprintGeneratedConstantData, __NameProperty_38) == 0x000038, "Member 'ABP_Player_Hair008_Implementation::FAnimBlueprintGeneratedConstantData::__NameProperty_38' has a wrong offset!");
static_assert(offsetof(ABP_Player_Hair008_Implementation::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000040, "Member 'ABP_Player_Hair008_Implementation::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Player_Hair008_Implementation::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000C0, "Member 'ABP_Player_Hair008_Implementation::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

