#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_M_OldCloth001_Implimentation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "KawaiiPhysics_structs.hpp"


namespace SDK::Params
{

// Function ABP_M_OldCloth001_Implimentation.ABP_M_OldCloth001_Implimentation_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_M_OldCloth001_Implimentation_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_M_OldCloth001_Implimentation_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_M_OldCloth001_Implimentation_C_AnimGraph");
static_assert(sizeof(ABP_M_OldCloth001_Implimentation_C_AnimGraph) == 0x000010, "Wrong size on ABP_M_OldCloth001_Implimentation_C_AnimGraph");
static_assert(offsetof(ABP_M_OldCloth001_Implimentation_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'ABP_M_OldCloth001_Implimentation_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function ABP_M_OldCloth001_Implimentation.ABP_M_OldCloth001_Implimentation_C.ClothLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_M_OldCloth001_Implimentation_C_ClothLayer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_ClothLayer;                                  // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_M_OldCloth001_Implimentation_C_ClothLayer) == 0x000008, "Wrong alignment on ABP_M_OldCloth001_Implimentation_C_ClothLayer");
static_assert(sizeof(ABP_M_OldCloth001_Implimentation_C_ClothLayer) == 0x000020, "Wrong size on ABP_M_OldCloth001_Implimentation_C_ClothLayer");
static_assert(offsetof(ABP_M_OldCloth001_Implimentation_C_ClothLayer, InPose) == 0x000000, "Member 'ABP_M_OldCloth001_Implimentation_C_ClothLayer::InPose' has a wrong offset!");
static_assert(offsetof(ABP_M_OldCloth001_Implimentation_C_ClothLayer, Param_ClothLayer) == 0x000010, "Member 'ABP_M_OldCloth001_Implimentation_C_ClothLayer::Param_ClothLayer' has a wrong offset!");

// Function ABP_M_OldCloth001_Implimentation.ABP_M_OldCloth001_Implimentation_C.ExecuteUbergraph_ABP_M_OldCloth001_Implimentation
// 0x001C (0x001C - 0x0000)
struct ABP_M_OldCloth001_Implimentation_C_ExecuteUbergraph_ABP_M_OldCloth001_Implimentation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKawaiiPhysicsSettings                 K2Node_MakeStruct_KawaiiPhysicsSettings;           // 0x0004(0x0018)(NoDestructor)
};
static_assert(alignof(ABP_M_OldCloth001_Implimentation_C_ExecuteUbergraph_ABP_M_OldCloth001_Implimentation) == 0x000004, "Wrong alignment on ABP_M_OldCloth001_Implimentation_C_ExecuteUbergraph_ABP_M_OldCloth001_Implimentation");
static_assert(sizeof(ABP_M_OldCloth001_Implimentation_C_ExecuteUbergraph_ABP_M_OldCloth001_Implimentation) == 0x00001C, "Wrong size on ABP_M_OldCloth001_Implimentation_C_ExecuteUbergraph_ABP_M_OldCloth001_Implimentation");
static_assert(offsetof(ABP_M_OldCloth001_Implimentation_C_ExecuteUbergraph_ABP_M_OldCloth001_Implimentation, EntryPoint) == 0x000000, "Member 'ABP_M_OldCloth001_Implimentation_C_ExecuteUbergraph_ABP_M_OldCloth001_Implimentation::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_M_OldCloth001_Implimentation_C_ExecuteUbergraph_ABP_M_OldCloth001_Implimentation, K2Node_MakeStruct_KawaiiPhysicsSettings) == 0x000004, "Member 'ABP_M_OldCloth001_Implimentation_C_ExecuteUbergraph_ABP_M_OldCloth001_Implimentation::K2Node_MakeStruct_KawaiiPhysicsSettings' has a wrong offset!");

}

