#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Player_Hair008_Implementation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KawaiiPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Player_Hair008_Implementation.ABP_Player_Hair008_Implementation_C
// 0x3680 (0x39D0 - 0x0350)
class UABP_Player_Hair008_Implementation_C final : public UAnimInstance
{
public:
	uint8                                         Pad_541E[0x8];                                     // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0358(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0360(0x0008)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0368(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0388(0x0020)()
	uint8                                         Pad_541F[0x8];                                     // 0x03A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x03B0(0x0790)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x0B40(0x0790)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x12D0(0x0790)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x1A60(0x0790)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x21F0(0x0790)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x2980(0x0790)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x3110(0x0790)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x38A0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x38C0(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x3988(0x0020)()
	struct FKawaiiPhysicsSettings                 PhysicsSettings;                                   // 0x39A8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	double                                        Alpha;                                             // 0x39C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void ExecuteUbergraph_ABP_Player_Hair008_Implementation(int32 EntryPoint);
	void HairLayer(const struct FPoseLink& InPose, struct FPoseLink* Param_HairLayer);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Player_Hair008_Implementation_C">();
	}
	static class UABP_Player_Hair008_Implementation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Player_Hair008_Implementation_C>();
	}
};
static_assert(alignof(UABP_Player_Hair008_Implementation_C) == 0x000010, "Wrong alignment on UABP_Player_Hair008_Implementation_C");
static_assert(sizeof(UABP_Player_Hair008_Implementation_C) == 0x0039D0, "Wrong size on UABP_Player_Hair008_Implementation_C");
static_assert(offsetof(UABP_Player_Hair008_Implementation_C, UberGraphFrame) == 0x000350, "Member 'UABP_Player_Hair008_Implementation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Player_Hair008_Implementation_C, AnimBlueprintExtension_PropertyAccess) == 0x000358, "Member 'UABP_Player_Hair008_Implementation_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_Player_Hair008_Implementation_C, AnimBlueprintExtension_Base) == 0x000360, "Member 'UABP_Player_Hair008_Implementation_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_Player_Hair008_Implementation_C, AnimGraphNode_LocalToComponentSpace) == 0x000368, "Member 'UABP_Player_Hair008_Implementation_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Player_Hair008_Implementation_C, AnimGraphNode_ComponentToLocalSpace) == 0x000388, "Member 'UABP_Player_Hair008_Implementation_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Player_Hair008_Implementation_C, AnimGraphNode_KawaiiPhysics_6) == 0x0003B0, "Member 'UABP_Player_Hair008_Implementation_C::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(UABP_Player_Hair008_Implementation_C, AnimGraphNode_KawaiiPhysics_5) == 0x000B40, "Member 'UABP_Player_Hair008_Implementation_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UABP_Player_Hair008_Implementation_C, AnimGraphNode_KawaiiPhysics_4) == 0x0012D0, "Member 'UABP_Player_Hair008_Implementation_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UABP_Player_Hair008_Implementation_C, AnimGraphNode_KawaiiPhysics_3) == 0x001A60, "Member 'UABP_Player_Hair008_Implementation_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UABP_Player_Hair008_Implementation_C, AnimGraphNode_KawaiiPhysics_2) == 0x0021F0, "Member 'UABP_Player_Hair008_Implementation_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UABP_Player_Hair008_Implementation_C, AnimGraphNode_KawaiiPhysics_1) == 0x002980, "Member 'UABP_Player_Hair008_Implementation_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UABP_Player_Hair008_Implementation_C, AnimGraphNode_KawaiiPhysics) == 0x003110, "Member 'UABP_Player_Hair008_Implementation_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UABP_Player_Hair008_Implementation_C, AnimGraphNode_Root_1) == 0x0038A0, "Member 'UABP_Player_Hair008_Implementation_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_Player_Hair008_Implementation_C, AnimGraphNode_LinkedInputPose) == 0x0038C0, "Member 'UABP_Player_Hair008_Implementation_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_Player_Hair008_Implementation_C, AnimGraphNode_Root) == 0x003988, "Member 'UABP_Player_Hair008_Implementation_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Player_Hair008_Implementation_C, PhysicsSettings) == 0x0039A8, "Member 'UABP_Player_Hair008_Implementation_C::PhysicsSettings' has a wrong offset!");
static_assert(offsetof(UABP_Player_Hair008_Implementation_C, Alpha) == 0x0039C0, "Member 'UABP_Player_Hair008_Implementation_C::Alpha' has a wrong offset!");

}

