#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_MonsterBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_MonsterBase.ABP_MonsterBase_C.AnimBlueprintGeneratedConstantData
// 0x018F (0x0190 - 0x0001)
struct ABP_MonsterBase::FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_25A2[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_323;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_324;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_325;                                // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_326;                                // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_327;                                // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_328;                                // 0x002C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_329;                                 // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_330;                                // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_331;                                 // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_332;                                // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_333;                                 // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_334;                              // 0x0050(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_335;                               // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_336;                                // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_337;                                 // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_338;                                // 0x008C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25A3[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_339;                               // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_340;                                // 0x0094(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_341;                                // 0x0095(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25A4[0x2];                                     // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_342;                                // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_343;                                // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_344;                                 // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25A5[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_345;                                // 0x00B0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_346;                                  // 0x00B8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_347;                                // 0x00C0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_348;                                // 0x00C1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_349;                                // 0x00C2(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25A6[0x5];                                     // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_350;                               // 0x00C8(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_351;                              // 0x00D8(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00F8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0178(0x0018)()
};
static_assert(alignof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_MonsterBase::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData) == 0x000190, "Wrong size on ABP_MonsterBase::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, __NameProperty_323) == 0x000004, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::__NameProperty_323' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, __NameProperty_324) == 0x00000C, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::__NameProperty_324' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, __NameProperty_325) == 0x000014, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::__NameProperty_325' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, __NameProperty_326) == 0x00001C, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::__NameProperty_326' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, __NameProperty_327) == 0x000024, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::__NameProperty_327' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, __NameProperty_328) == 0x00002C, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::__NameProperty_328' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, __IntProperty_329) == 0x000034, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::__IntProperty_329' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, __NameProperty_330) == 0x000038, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::__NameProperty_330' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, __IntProperty_331) == 0x000040, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::__IntProperty_331' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, __NameProperty_332) == 0x000044, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::__NameProperty_332' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, __IntProperty_333) == 0x00004C, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::__IntProperty_333' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, __StructProperty_334) == 0x000050, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::__StructProperty_334' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, __FloatProperty_335) == 0x00007C, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::__FloatProperty_335' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, __NameProperty_336) == 0x000080, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::__NameProperty_336' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, __IntProperty_337) == 0x000088, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::__IntProperty_337' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, __BoolProperty_338) == 0x00008C, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::__BoolProperty_338' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, __FloatProperty_339) == 0x000090, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::__FloatProperty_339' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, __EnumProperty_340) == 0x000094, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::__EnumProperty_340' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, __ByteProperty_341) == 0x000095, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::__ByteProperty_341' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, __NameProperty_342) == 0x000098, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::__NameProperty_342' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, __NameProperty_343) == 0x0000A0, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::__NameProperty_343' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, __IntProperty_344) == 0x0000A8, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::__IntProperty_344' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, __BlendProfile_345) == 0x0000B0, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::__BlendProfile_345' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, __CurveFloat_346) == 0x0000B8, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::__CurveFloat_346' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, __BoolProperty_347) == 0x0000C0, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::__BoolProperty_347' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, __EnumProperty_348) == 0x0000C1, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::__EnumProperty_348' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, __EnumProperty_349) == 0x0000C2, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::__EnumProperty_349' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, __ArrayProperty_350) == 0x0000C8, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::__ArrayProperty_350' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, __StructProperty_351) == 0x0000D8, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::__StructProperty_351' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000F8, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000178, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_MonsterBase.ABP_MonsterBase_C.AnimBlueprintGeneratedMutableData
// 0x005F (0x0060 - 0x0001)
struct ABP_MonsterBase::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_25A7[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x000D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3;                                  // 0x000E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25A8[0x1];                                     // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_4;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_7;                                  // 0x001C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_8;                                  // 0x001D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25A9[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_9;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_11;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_12;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_13;                                 // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25AA[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_14;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_15;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_16;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_17;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25AB[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_18;                                // 0x0048(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_19;                                 // 0x0058(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_20;                                 // 0x0059(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_MonsterBase::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on ABP_MonsterBase::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_MonsterBase::FAnimBlueprintGeneratedMutableData) == 0x000060, "Wrong size on ABP_MonsterBase::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x00000C, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedMutableData, __BoolProperty_2) == 0x00000D, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedMutableData::__BoolProperty_2' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedMutableData, __BoolProperty_3) == 0x00000E, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedMutableData::__BoolProperty_3' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedMutableData, __FloatProperty_4) == 0x000010, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedMutableData::__FloatProperty_4' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedMutableData, __FloatProperty_5) == 0x000014, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedMutableData::__FloatProperty_5' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedMutableData, __FloatProperty_6) == 0x000018, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedMutableData::__FloatProperty_6' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedMutableData, __BoolProperty_7) == 0x00001C, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedMutableData::__BoolProperty_7' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedMutableData, __BoolProperty_8) == 0x00001D, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedMutableData::__BoolProperty_8' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedMutableData, __FloatProperty_9) == 0x000020, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedMutableData::__FloatProperty_9' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedMutableData, __FloatProperty_10) == 0x000024, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedMutableData::__FloatProperty_10' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedMutableData, __FloatProperty_11) == 0x000028, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedMutableData::__FloatProperty_11' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedMutableData, __FloatProperty_12) == 0x00002C, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedMutableData::__FloatProperty_12' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedMutableData, __BoolProperty_13) == 0x000030, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedMutableData::__BoolProperty_13' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedMutableData, __FloatProperty_14) == 0x000034, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedMutableData::__FloatProperty_14' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedMutableData, __FloatProperty_15) == 0x000038, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedMutableData::__FloatProperty_15' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedMutableData, __FloatProperty_16) == 0x00003C, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedMutableData::__FloatProperty_16' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedMutableData, __FloatProperty_17) == 0x000040, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedMutableData::__FloatProperty_17' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedMutableData, __ArrayProperty_18) == 0x000048, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedMutableData::__ArrayProperty_18' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedMutableData, __BoolProperty_19) == 0x000058, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedMutableData::__BoolProperty_19' has a wrong offset!");
static_assert(offsetof(ABP_MonsterBase::FAnimBlueprintGeneratedMutableData, __BoolProperty_20) == 0x000059, "Member 'ABP_MonsterBase::FAnimBlueprintGeneratedMutableData::__BoolProperty_20' has a wrong offset!");

}

