#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_SheepBall_Implementation

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_SheepBall_Implementation.ABP_SheepBall_Implementation_C.AnimBlueprintGeneratedConstantData
// 0x00EF (0x00F0 - 0x0001)
struct ABP_SheepBall_Implementation::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_193E[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_24;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_25;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_26;                                 // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_27;                                 // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_193F[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_28;                               // 0x0028(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_29;                                 // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_30;                                 // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0058(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00D8(0x0018)()
};
static_assert(alignof(ABP_SheepBall_Implementation::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_SheepBall_Implementation::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_SheepBall_Implementation::FAnimBlueprintGeneratedConstantData) == 0x0000F0, "Wrong size on ABP_SheepBall_Implementation::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_SheepBall_Implementation::FAnimBlueprintGeneratedConstantData, __NameProperty_24) == 0x000004, "Member 'ABP_SheepBall_Implementation::FAnimBlueprintGeneratedConstantData::__NameProperty_24' has a wrong offset!");
static_assert(offsetof(ABP_SheepBall_Implementation::FAnimBlueprintGeneratedConstantData, __NameProperty_25) == 0x00000C, "Member 'ABP_SheepBall_Implementation::FAnimBlueprintGeneratedConstantData::__NameProperty_25' has a wrong offset!");
static_assert(offsetof(ABP_SheepBall_Implementation::FAnimBlueprintGeneratedConstantData, __NameProperty_26) == 0x000014, "Member 'ABP_SheepBall_Implementation::FAnimBlueprintGeneratedConstantData::__NameProperty_26' has a wrong offset!");
static_assert(offsetof(ABP_SheepBall_Implementation::FAnimBlueprintGeneratedConstantData, __NameProperty_27) == 0x00001C, "Member 'ABP_SheepBall_Implementation::FAnimBlueprintGeneratedConstantData::__NameProperty_27' has a wrong offset!");
static_assert(offsetof(ABP_SheepBall_Implementation::FAnimBlueprintGeneratedConstantData, __StructProperty_28) == 0x000028, "Member 'ABP_SheepBall_Implementation::FAnimBlueprintGeneratedConstantData::__StructProperty_28' has a wrong offset!");
static_assert(offsetof(ABP_SheepBall_Implementation::FAnimBlueprintGeneratedConstantData, __NameProperty_29) == 0x000048, "Member 'ABP_SheepBall_Implementation::FAnimBlueprintGeneratedConstantData::__NameProperty_29' has a wrong offset!");
static_assert(offsetof(ABP_SheepBall_Implementation::FAnimBlueprintGeneratedConstantData, __NameProperty_30) == 0x000050, "Member 'ABP_SheepBall_Implementation::FAnimBlueprintGeneratedConstantData::__NameProperty_30' has a wrong offset!");
static_assert(offsetof(ABP_SheepBall_Implementation::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000058, "Member 'ABP_SheepBall_Implementation::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_SheepBall_Implementation::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000D8, "Member 'ABP_SheepBall_Implementation::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

