#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIActionShieldCall

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AIActionShieldCall.BP_AIActionShieldCall_C.ActionTick
// 0x0010 (0x0010 - 0x0000)
struct BP_AIActionShieldCall_C_ActionTick final
{
public:
	class APawn*                                  ControlledPawn;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIActionShieldCall_C_ActionTick) == 0x000008, "Wrong alignment on BP_AIActionShieldCall_C_ActionTick");
static_assert(sizeof(BP_AIActionShieldCall_C_ActionTick) == 0x000010, "Wrong size on BP_AIActionShieldCall_C_ActionTick");
static_assert(offsetof(BP_AIActionShieldCall_C_ActionTick, ControlledPawn) == 0x000000, "Member 'BP_AIActionShieldCall_C_ActionTick::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BP_AIActionShieldCall_C_ActionTick, DeltaSeconds) == 0x000008, "Member 'BP_AIActionShieldCall_C_ActionTick::DeltaSeconds' has a wrong offset!");

// Function BP_AIActionShieldCall.BP_AIActionShieldCall_C.DoRide
// 0x0030 (0x0030 - 0x0000)
struct BP_AIActionShieldCall_C_DoRide final
{
public:
	class APawn*                                  ControlledPawn;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalCharacterMovementComponent*         CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_AIActionProtecting_C*               CallFunc_SpawnObject_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PushChildAction_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIActionShieldCall_C_DoRide) == 0x000008, "Wrong alignment on BP_AIActionShieldCall_C_DoRide");
static_assert(sizeof(BP_AIActionShieldCall_C_DoRide) == 0x000030, "Wrong size on BP_AIActionShieldCall_C_DoRide");
static_assert(offsetof(BP_AIActionShieldCall_C_DoRide, ControlledPawn) == 0x000000, "Member 'BP_AIActionShieldCall_C_DoRide::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BP_AIActionShieldCall_C_DoRide, CallFunc_GetController_ReturnValue) == 0x000008, "Member 'BP_AIActionShieldCall_C_DoRide::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIActionShieldCall_C_DoRide, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'BP_AIActionShieldCall_C_DoRide::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIActionShieldCall_C_DoRide, CallFunc_GetController_ReturnValue_1) == 0x000018, "Member 'BP_AIActionShieldCall_C_DoRide::CallFunc_GetController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIActionShieldCall_C_DoRide, CallFunc_SpawnObject_ReturnValue) == 0x000020, "Member 'BP_AIActionShieldCall_C_DoRide::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIActionShieldCall_C_DoRide, CallFunc_PushChildAction_ReturnValue) == 0x000028, "Member 'BP_AIActionShieldCall_C_DoRide::CallFunc_PushChildAction_ReturnValue' has a wrong offset!");

// Function BP_AIActionShieldCall.BP_AIActionShieldCall_C.ExecuteUbergraph_BP_AIActionShieldCall
// 0x0018 (0x0018 - 0x0000)
struct BP_AIActionShieldCall_C_ExecuteUbergraph_BP_AIActionShieldCall final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4893[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNearTwoActor_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIActionShieldCall_C_ExecuteUbergraph_BP_AIActionShieldCall) == 0x000008, "Wrong alignment on BP_AIActionShieldCall_C_ExecuteUbergraph_BP_AIActionShieldCall");
static_assert(sizeof(BP_AIActionShieldCall_C_ExecuteUbergraph_BP_AIActionShieldCall) == 0x000018, "Wrong size on BP_AIActionShieldCall_C_ExecuteUbergraph_BP_AIActionShieldCall");
static_assert(offsetof(BP_AIActionShieldCall_C_ExecuteUbergraph_BP_AIActionShieldCall, EntryPoint) == 0x000000, "Member 'BP_AIActionShieldCall_C_ExecuteUbergraph_BP_AIActionShieldCall::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AIActionShieldCall_C_ExecuteUbergraph_BP_AIActionShieldCall, K2Node_Event_ControlledPawn) == 0x000008, "Member 'BP_AIActionShieldCall_C_ExecuteUbergraph_BP_AIActionShieldCall::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BP_AIActionShieldCall_C_ExecuteUbergraph_BP_AIActionShieldCall, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'BP_AIActionShieldCall_C_ExecuteUbergraph_BP_AIActionShieldCall::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AIActionShieldCall_C_ExecuteUbergraph_BP_AIActionShieldCall, CallFunc_IsNearTwoActor_ReturnValue) == 0x000014, "Member 'BP_AIActionShieldCall_C_ExecuteUbergraph_BP_AIActionShieldCall::CallFunc_IsNearTwoActor_ReturnValue' has a wrong offset!");

}

