#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_Emote_Base

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Action_Emote_Base.BP_Action_Emote_Base_C.ExecuteUbergraph_BP_Action_Emote_Base
// 0x00F8 (0x00F8 - 0x0000)
struct BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59AB[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalSkeletalMeshComponent*              CallFunc_GetMainMesh_ReturnValue;                  // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59AC[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTime;                            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_1;         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalCharacterMovementComponent*         CallFunc_GetComponentByClass_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59AD[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_2;         // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_3;         // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalStaticCharacterParameterComponent*  CallFunc_GetComponentByClass_ReturnValue_1;        // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59AE[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_Array_Get_Item;                           // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59AF[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x00DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x00E4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base) == 0x000008, "Wrong alignment on BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base");
static_assert(sizeof(BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base) == 0x0000F8, "Wrong size on BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base");
static_assert(offsetof(BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base, EntryPoint) == 0x000000, "Member 'BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base, K2Node_CustomEvent_NotifyName_3) == 0x000004, "Member 'BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base, K2Node_CustomEvent_NotifyName_2) == 0x00000C, "Member 'BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base, K2Node_CustomEvent_NotifyName_1) == 0x000024, "Member 'BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base, K2Node_CustomEvent_NotifyName) == 0x00003C, "Member 'BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base, Temp_name_Variable) == 0x000054, "Member 'BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base, CallFunc_GetActionCharacter_ReturnValue) == 0x000060, "Member 'BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base, CallFunc_GetMainMesh_ReturnValue) == 0x000068, "Member 'BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base::CallFunc_GetMainMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000070, "Member 'BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base, K2Node_Event_DeltaTime) == 0x00007C, "Member 'BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base, CallFunc_GetActionCharacter_ReturnValue_1) == 0x000080, "Member 'BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base::CallFunc_GetActionCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base, CallFunc_GetComponentByClass_ReturnValue) == 0x000088, "Member 'BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base, K2Node_CreateDelegate_OutputDelegate_3) == 0x000090, "Member 'BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base, CallFunc_VSize_ReturnValue) == 0x0000A0, "Member 'BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000A8, "Member 'BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base, CallFunc_GetActionCharacter_ReturnValue_2) == 0x0000B0, "Member 'BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base::CallFunc_GetActionCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base, CallFunc_GetActionCharacter_ReturnValue_3) == 0x0000B8, "Member 'BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base::CallFunc_GetActionCharacter_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base, CallFunc_GetComponentByClass_ReturnValue_1) == 0x0000C0, "Member 'BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base, CallFunc_IsValid_ReturnValue_1) == 0x0000C8, "Member 'BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base, CallFunc_Array_Get_Item) == 0x0000D0, "Member 'BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000D8, "Member 'BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base, K2Node_CustomEvent_NotifyName_4) == 0x0000DC, "Member 'BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000E4, "Member 'BP_Action_Emote_Base_C_ExecuteUbergraph_BP_Action_Emote_Base::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");

// Function BP_Action_Emote_Base.BP_Action_Emote_Base_C.OnBlendOut_11A0523F4A84359AD4CD3E999BE200ED
// 0x0008 (0x0008 - 0x0000)
struct BP_Action_Emote_Base_C_OnBlendOut_11A0523F4A84359AD4CD3E999BE200ED final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Emote_Base_C_OnBlendOut_11A0523F4A84359AD4CD3E999BE200ED) == 0x000004, "Wrong alignment on BP_Action_Emote_Base_C_OnBlendOut_11A0523F4A84359AD4CD3E999BE200ED");
static_assert(sizeof(BP_Action_Emote_Base_C_OnBlendOut_11A0523F4A84359AD4CD3E999BE200ED) == 0x000008, "Wrong size on BP_Action_Emote_Base_C_OnBlendOut_11A0523F4A84359AD4CD3E999BE200ED");
static_assert(offsetof(BP_Action_Emote_Base_C_OnBlendOut_11A0523F4A84359AD4CD3E999BE200ED, NotifyName) == 0x000000, "Member 'BP_Action_Emote_Base_C_OnBlendOut_11A0523F4A84359AD4CD3E999BE200ED::NotifyName' has a wrong offset!");

// Function BP_Action_Emote_Base.BP_Action_Emote_Base_C.OnCompleted_11A0523F4A84359AD4CD3E999BE200ED
// 0x0008 (0x0008 - 0x0000)
struct BP_Action_Emote_Base_C_OnCompleted_11A0523F4A84359AD4CD3E999BE200ED final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Emote_Base_C_OnCompleted_11A0523F4A84359AD4CD3E999BE200ED) == 0x000004, "Wrong alignment on BP_Action_Emote_Base_C_OnCompleted_11A0523F4A84359AD4CD3E999BE200ED");
static_assert(sizeof(BP_Action_Emote_Base_C_OnCompleted_11A0523F4A84359AD4CD3E999BE200ED) == 0x000008, "Wrong size on BP_Action_Emote_Base_C_OnCompleted_11A0523F4A84359AD4CD3E999BE200ED");
static_assert(offsetof(BP_Action_Emote_Base_C_OnCompleted_11A0523F4A84359AD4CD3E999BE200ED, NotifyName) == 0x000000, "Member 'BP_Action_Emote_Base_C_OnCompleted_11A0523F4A84359AD4CD3E999BE200ED::NotifyName' has a wrong offset!");

// Function BP_Action_Emote_Base.BP_Action_Emote_Base_C.OnInterrupted_11A0523F4A84359AD4CD3E999BE200ED
// 0x0008 (0x0008 - 0x0000)
struct BP_Action_Emote_Base_C_OnInterrupted_11A0523F4A84359AD4CD3E999BE200ED final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Emote_Base_C_OnInterrupted_11A0523F4A84359AD4CD3E999BE200ED) == 0x000004, "Wrong alignment on BP_Action_Emote_Base_C_OnInterrupted_11A0523F4A84359AD4CD3E999BE200ED");
static_assert(sizeof(BP_Action_Emote_Base_C_OnInterrupted_11A0523F4A84359AD4CD3E999BE200ED) == 0x000008, "Wrong size on BP_Action_Emote_Base_C_OnInterrupted_11A0523F4A84359AD4CD3E999BE200ED");
static_assert(offsetof(BP_Action_Emote_Base_C_OnInterrupted_11A0523F4A84359AD4CD3E999BE200ED, NotifyName) == 0x000000, "Member 'BP_Action_Emote_Base_C_OnInterrupted_11A0523F4A84359AD4CD3E999BE200ED::NotifyName' has a wrong offset!");

// Function BP_Action_Emote_Base.BP_Action_Emote_Base_C.OnNotifyBegin_11A0523F4A84359AD4CD3E999BE200ED
// 0x0008 (0x0008 - 0x0000)
struct BP_Action_Emote_Base_C_OnNotifyBegin_11A0523F4A84359AD4CD3E999BE200ED final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Emote_Base_C_OnNotifyBegin_11A0523F4A84359AD4CD3E999BE200ED) == 0x000004, "Wrong alignment on BP_Action_Emote_Base_C_OnNotifyBegin_11A0523F4A84359AD4CD3E999BE200ED");
static_assert(sizeof(BP_Action_Emote_Base_C_OnNotifyBegin_11A0523F4A84359AD4CD3E999BE200ED) == 0x000008, "Wrong size on BP_Action_Emote_Base_C_OnNotifyBegin_11A0523F4A84359AD4CD3E999BE200ED");
static_assert(offsetof(BP_Action_Emote_Base_C_OnNotifyBegin_11A0523F4A84359AD4CD3E999BE200ED, NotifyName) == 0x000000, "Member 'BP_Action_Emote_Base_C_OnNotifyBegin_11A0523F4A84359AD4CD3E999BE200ED::NotifyName' has a wrong offset!");

// Function BP_Action_Emote_Base.BP_Action_Emote_Base_C.OnNotifyEnd_11A0523F4A84359AD4CD3E999BE200ED
// 0x0008 (0x0008 - 0x0000)
struct BP_Action_Emote_Base_C_OnNotifyEnd_11A0523F4A84359AD4CD3E999BE200ED final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Emote_Base_C_OnNotifyEnd_11A0523F4A84359AD4CD3E999BE200ED) == 0x000004, "Wrong alignment on BP_Action_Emote_Base_C_OnNotifyEnd_11A0523F4A84359AD4CD3E999BE200ED");
static_assert(sizeof(BP_Action_Emote_Base_C_OnNotifyEnd_11A0523F4A84359AD4CD3E999BE200ED) == 0x000008, "Wrong size on BP_Action_Emote_Base_C_OnNotifyEnd_11A0523F4A84359AD4CD3E999BE200ED");
static_assert(offsetof(BP_Action_Emote_Base_C_OnNotifyEnd_11A0523F4A84359AD4CD3E999BE200ED, NotifyName) == 0x000000, "Member 'BP_Action_Emote_Base_C_OnNotifyEnd_11A0523F4A84359AD4CD3E999BE200ED::NotifyName' has a wrong offset!");

// Function BP_Action_Emote_Base.BP_Action_Emote_Base_C.SetMoveEnable
// 0x0028 (0x0028 - 0x0000)
struct BP_Action_Emote_Base_C_SetMoveEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59B0[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59B1[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalCharacterMovementComponent*         CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Emote_Base_C_SetMoveEnable) == 0x000008, "Wrong alignment on BP_Action_Emote_Base_C_SetMoveEnable");
static_assert(sizeof(BP_Action_Emote_Base_C_SetMoveEnable) == 0x000028, "Wrong size on BP_Action_Emote_Base_C_SetMoveEnable");
static_assert(offsetof(BP_Action_Emote_Base_C_SetMoveEnable, Enable) == 0x000000, "Member 'BP_Action_Emote_Base_C_SetMoveEnable::Enable' has a wrong offset!");
static_assert(offsetof(BP_Action_Emote_Base_C_SetMoveEnable, CallFunc_GetActionCharacter_ReturnValue) == 0x000008, "Member 'BP_Action_Emote_Base_C_SetMoveEnable::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Emote_Base_C_SetMoveEnable, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000010, "Member 'BP_Action_Emote_Base_C_SetMoveEnable::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Emote_Base_C_SetMoveEnable, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'BP_Action_Emote_Base_C_SetMoveEnable::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Emote_Base_C_SetMoveEnable, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_Action_Emote_Base_C_SetMoveEnable::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Action_Emote_Base.BP_Action_Emote_Base_C.TickAction
// 0x0004 (0x0004 - 0x0000)
struct BP_Action_Emote_Base_C_TickAction final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Emote_Base_C_TickAction) == 0x000004, "Wrong alignment on BP_Action_Emote_Base_C_TickAction");
static_assert(sizeof(BP_Action_Emote_Base_C_TickAction) == 0x000004, "Wrong size on BP_Action_Emote_Base_C_TickAction");
static_assert(offsetof(BP_Action_Emote_Base_C_TickAction, DeltaTime) == 0x000000, "Member 'BP_Action_Emote_Base_C_TickAction::DeltaTime' has a wrong offset!");

}

