#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionUniqueAttackBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Pal_structs.hpp"


namespace SDK::Params
{

// Function BP_ActionUniqueAttackBase.BP_ActionUniqueAttackBase_C.AttachToOwner
// 0x0178 (0x0178 - 0x0000)
struct BP_ActionUniqueAttackBase_C_AttachToOwner final
{
public:
	class APalSkillEffectBase*                    Effect;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Offset;                                            // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketName;                                        // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalSkeletalMeshComponent*              CallFunc_GetMainMesh_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_1;         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B2D[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0078(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B2E[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_2;         // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalSkeletalMeshComponent*              CallFunc_GetMainMesh_ReturnValue_1;                // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionUniqueAttackBase_C_AttachToOwner) == 0x000008, "Wrong alignment on BP_ActionUniqueAttackBase_C_AttachToOwner");
static_assert(sizeof(BP_ActionUniqueAttackBase_C_AttachToOwner) == 0x000178, "Wrong size on BP_ActionUniqueAttackBase_C_AttachToOwner");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_AttachToOwner, Effect) == 0x000000, "Member 'BP_ActionUniqueAttackBase_C_AttachToOwner::Effect' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_AttachToOwner, Offset) == 0x000008, "Member 'BP_ActionUniqueAttackBase_C_AttachToOwner::Offset' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_AttachToOwner, SocketName) == 0x000020, "Member 'BP_ActionUniqueAttackBase_C_AttachToOwner::SocketName' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_AttachToOwner, CallFunc_GetActionCharacter_ReturnValue) == 0x000028, "Member 'BP_ActionUniqueAttackBase_C_AttachToOwner::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_AttachToOwner, CallFunc_GetMainMesh_ReturnValue) == 0x000030, "Member 'BP_ActionUniqueAttackBase_C_AttachToOwner::CallFunc_GetMainMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_AttachToOwner, CallFunc_GetActionCharacter_ReturnValue_1) == 0x000038, "Member 'BP_ActionUniqueAttackBase_C_AttachToOwner::CallFunc_GetActionCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_AttachToOwner, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000040, "Member 'BP_ActionUniqueAttackBase_C_AttachToOwner::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_AttachToOwner, CallFunc_NotEqual_NameName_ReturnValue) == 0x000058, "Member 'BP_ActionUniqueAttackBase_C_AttachToOwner::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_AttachToOwner, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000060, "Member 'BP_ActionUniqueAttackBase_C_AttachToOwner::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_AttachToOwner, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000078, "Member 'BP_ActionUniqueAttackBase_C_AttachToOwner::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_AttachToOwner, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000160, "Member 'BP_ActionUniqueAttackBase_C_AttachToOwner::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_AttachToOwner, CallFunc_GetActionCharacter_ReturnValue_2) == 0x000168, "Member 'BP_ActionUniqueAttackBase_C_AttachToOwner::CallFunc_GetActionCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_AttachToOwner, CallFunc_GetMainMesh_ReturnValue_1) == 0x000170, "Member 'BP_ActionUniqueAttackBase_C_AttachToOwner::CallFunc_GetMainMesh_ReturnValue_1' has a wrong offset!");

// Function BP_ActionUniqueAttackBase.BP_ActionUniqueAttackBase_C.CreateSkillActionModule
// 0x0058 (0x0058 - 0x0000)
struct BP_ActionUniqueAttackBase_C_CreateSkillActionModule final
{
public:
	class UClass*                                 UniqueSkillModuleClass;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UniqueSkillModule_Tackle_C*         Module;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B2F[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalUniqueSkillModule*                  CallFunc_SpawnObject_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UniqueSkillModule_Tackle_C*         K2Node_DynamicCast_AsBP_Unique_Skill_Module_Tackle; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionUniqueAttackBase_C_CreateSkillActionModule) == 0x000008, "Wrong alignment on BP_ActionUniqueAttackBase_C_CreateSkillActionModule");
static_assert(sizeof(BP_ActionUniqueAttackBase_C_CreateSkillActionModule) == 0x000058, "Wrong size on BP_ActionUniqueAttackBase_C_CreateSkillActionModule");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CreateSkillActionModule, UniqueSkillModuleClass) == 0x000000, "Member 'BP_ActionUniqueAttackBase_C_CreateSkillActionModule::UniqueSkillModuleClass' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CreateSkillActionModule, Module) == 0x000008, "Member 'BP_ActionUniqueAttackBase_C_CreateSkillActionModule::Module' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CreateSkillActionModule, CallFunc_IsValidClass_ReturnValue) == 0x000010, "Member 'BP_ActionUniqueAttackBase_C_CreateSkillActionModule::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CreateSkillActionModule, CallFunc_Conv_NameToString_ReturnValue) == 0x000018, "Member 'BP_ActionUniqueAttackBase_C_CreateSkillActionModule::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CreateSkillActionModule, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'BP_ActionUniqueAttackBase_C_CreateSkillActionModule::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CreateSkillActionModule, CallFunc_GetActionCharacter_ReturnValue) == 0x000038, "Member 'BP_ActionUniqueAttackBase_C_CreateSkillActionModule::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CreateSkillActionModule, CallFunc_SpawnObject_ReturnValue) == 0x000040, "Member 'BP_ActionUniqueAttackBase_C_CreateSkillActionModule::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CreateSkillActionModule, K2Node_DynamicCast_AsBP_Unique_Skill_Module_Tackle) == 0x000048, "Member 'BP_ActionUniqueAttackBase_C_CreateSkillActionModule::K2Node_DynamicCast_AsBP_Unique_Skill_Module_Tackle' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CreateSkillActionModule, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_ActionUniqueAttackBase_C_CreateSkillActionModule::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_ActionUniqueAttackBase.BP_ActionUniqueAttackBase_C.ExecuteUbergraph_BP_ActionUniqueAttackBase
// 0x0150 (0x0150 - 0x0000)
struct BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B30[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_1;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EffectKey;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B31[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSkillEffectSpawnParameter             CallFunc_Map_Find_Value;                           // 0x0048(0x0038)(NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B32[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRandomStream                          CallFunc_GetRandomStream_ReturnValue;              // 0x0084(0x0008)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5B33[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0090(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetUniqueActionTarget_TargetActor;        // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalSkillEffectBase*                    CallFunc_FinishSpawningActor_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B34[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class APalSkillEffectBase>     CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0110(0x0030)(UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase) == 0x000010, "Wrong alignment on BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase");
static_assert(sizeof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase) == 0x000150, "Wrong size on BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, EntryPoint) == 0x000000, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, CallFunc_GetActionCharacter_ReturnValue) == 0x000008, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, CallFunc_GetActionCharacter_ReturnValue_1) == 0x000010, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::CallFunc_GetActionCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, K2Node_CustomEvent_EffectKey) == 0x000018, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::K2Node_CustomEvent_EffectKey' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, K2Node_Event_DeltaTime) == 0x000020, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, CallFunc_Conv_NameToString_ReturnValue) == 0x000028, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, CallFunc_Map_Find_Value) == 0x000048, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, CallFunc_Map_Find_ReturnValue) == 0x000080, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, CallFunc_GetRandomStream_ReturnValue) == 0x000084, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::CallFunc_GetRandomStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, CallFunc_MakeTransform_ReturnValue) == 0x000090, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, CallFunc_GetUniqueActionTarget_TargetActor) == 0x0000F0, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::CallFunc_GetUniqueActionTarget_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000F8, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, CallFunc_FinishSpawningActor_ReturnValue) == 0x000100, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, CallFunc_IsValid_ReturnValue) == 0x000108, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000110, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, CallFunc_Array_Add_ReturnValue) == 0x000140, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_ActionUniqueAttackBase.BP_ActionUniqueAttackBase_C.FindActionTarget
// 0x0090 (0x0090 - 0x0000)
struct BP_ActionUniqueAttackBase_C_FindActionTarget final
{
public:
	class AActor*                                 CallFunc_GetActionTarget_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalActionDummyTargetActor*             K2Node_DynamicCast_AsPal_Action_Dummy_Target_Actor; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B35[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetActionTarget_ReturnValue_1;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerCharacter*                    CallFunc_GetRiderPlayer_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerCharacter*                    CallFunc_GetRiderPlayer_ReturnValue_1;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerControlled_ReturnValue;           // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B36[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_1;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetActionTarget_ReturnValue_2;            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsApplicableDamage_ReturnValue;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B37[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_2;         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetNearestEnemyByLocation_FrontPlayerCamera_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B38[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetNearestEnemyByLocation_FrontPlayerCamera_InHeight_ImplicitCast; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNearestEnemyByLocation_FrontPlayerCamera_InDistance_ImplicitCast; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNearestEnemyByLocation_FrontPlayerCamera_InDegree_ImplicitCast; // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionUniqueAttackBase_C_FindActionTarget) == 0x000008, "Wrong alignment on BP_ActionUniqueAttackBase_C_FindActionTarget");
static_assert(sizeof(BP_ActionUniqueAttackBase_C_FindActionTarget) == 0x000090, "Wrong size on BP_ActionUniqueAttackBase_C_FindActionTarget");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_GetActionTarget_ReturnValue) == 0x000000, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_GetActionTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, K2Node_DynamicCast_AsPal_Action_Dummy_Target_Actor) == 0x000008, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::K2Node_DynamicCast_AsPal_Action_Dummy_Target_Actor' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_GetActionTarget_ReturnValue_1) == 0x000018, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_GetActionTarget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_GetRiderPlayer_ReturnValue) == 0x000020, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_GetRiderPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_GetRiderPlayer_ReturnValue_1) == 0x000028, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_GetRiderPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_GetActionCharacter_ReturnValue) == 0x000030, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_IsPlayerControlled_ReturnValue) == 0x000039, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_IsPlayerControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_GetActionCharacter_ReturnValue_1) == 0x000040, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_GetActionCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_GetActionTarget_ReturnValue_2) == 0x000048, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_GetActionTarget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_IsApplicableDamage_ReturnValue) == 0x000050, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_IsApplicableDamage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_IsValid_ReturnValue_1) == 0x000051, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_GetActionCharacter_ReturnValue_2) == 0x000058, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_GetActionCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000060, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_GetNearestEnemyByLocation_FrontPlayerCamera_ReturnValue) == 0x000078, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_GetNearestEnemyByLocation_FrontPlayerCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_IsValid_ReturnValue_2) == 0x000080, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_GetNearestEnemyByLocation_FrontPlayerCamera_InHeight_ImplicitCast) == 0x000084, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_GetNearestEnemyByLocation_FrontPlayerCamera_InHeight_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_GetNearestEnemyByLocation_FrontPlayerCamera_InDistance_ImplicitCast) == 0x000088, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_GetNearestEnemyByLocation_FrontPlayerCamera_InDistance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_GetNearestEnemyByLocation_FrontPlayerCamera_InDegree_ImplicitCast) == 0x00008C, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_GetNearestEnemyByLocation_FrontPlayerCamera_InDegree_ImplicitCast' has a wrong offset!");

// Function BP_ActionUniqueAttackBase.BP_ActionUniqueAttackBase_C.FindEffectByClass
// 0x0080 (0x0080 - 0x0000)
struct BP_ActionUniqueAttackBase_C_FindEffectByClass final
{
public:
	class UClass*                                 EffectClass;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalSkillEffectBase*                    Effect;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class APalSkillEffectBase>     CallFunc_Array_Get_Item;                           // 0x0020(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B39[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalSkillEffectBase*                    K2Node_DynamicCast_AsPal_Skill_Effect_Base;        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B3A[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionUniqueAttackBase_C_FindEffectByClass) == 0x000008, "Wrong alignment on BP_ActionUniqueAttackBase_C_FindEffectByClass");
static_assert(sizeof(BP_ActionUniqueAttackBase_C_FindEffectByClass) == 0x000080, "Wrong size on BP_ActionUniqueAttackBase_C_FindEffectByClass");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindEffectByClass, EffectClass) == 0x000000, "Member 'BP_ActionUniqueAttackBase_C_FindEffectByClass::EffectClass' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindEffectByClass, Effect) == 0x000008, "Member 'BP_ActionUniqueAttackBase_C_FindEffectByClass::Effect' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindEffectByClass, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_ActionUniqueAttackBase_C_FindEffectByClass::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindEffectByClass, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_ActionUniqueAttackBase_C_FindEffectByClass::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindEffectByClass, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_ActionUniqueAttackBase_C_FindEffectByClass::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindEffectByClass, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BP_ActionUniqueAttackBase_C_FindEffectByClass::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindEffectByClass, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_ActionUniqueAttackBase_C_FindEffectByClass::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindEffectByClass, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_ActionUniqueAttackBase_C_FindEffectByClass::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindEffectByClass, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000058, "Member 'BP_ActionUniqueAttackBase_C_FindEffectByClass::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindEffectByClass, K2Node_DynamicCast_AsPal_Skill_Effect_Base) == 0x000060, "Member 'BP_ActionUniqueAttackBase_C_FindEffectByClass::K2Node_DynamicCast_AsPal_Skill_Effect_Base' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindEffectByClass, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_ActionUniqueAttackBase_C_FindEffectByClass::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindEffectByClass, CallFunc_GetObjectClass_ReturnValue) == 0x000070, "Member 'BP_ActionUniqueAttackBase_C_FindEffectByClass::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindEffectByClass, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000078, "Member 'BP_ActionUniqueAttackBase_C_FindEffectByClass::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindEffectByClass, CallFunc_IsValid_ReturnValue) == 0x000079, "Member 'BP_ActionUniqueAttackBase_C_FindEffectByClass::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_ActionUniqueAttackBase.BP_ActionUniqueAttackBase_C.GetAttackTargetLocation
// 0x00F0 (0x00F0 - 0x0000)
struct BP_ActionUniqueAttackBase_C_GetAttackTargetLocation final
{
public:
	bool                                          IsFrontLocation;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B3B[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FrontDistance;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTargetLocation_ReturnValue;            // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_1;         // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetUniqueActionTarget_TargetActor;        // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B3C[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetAttackTargetLocation_ReturnValue;      // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionUniqueAttackBase_C_GetAttackTargetLocation) == 0x000008, "Wrong alignment on BP_ActionUniqueAttackBase_C_GetAttackTargetLocation");
static_assert(sizeof(BP_ActionUniqueAttackBase_C_GetAttackTargetLocation) == 0x0000F0, "Wrong size on BP_ActionUniqueAttackBase_C_GetAttackTargetLocation");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetAttackTargetLocation, IsFrontLocation) == 0x000000, "Member 'BP_ActionUniqueAttackBase_C_GetAttackTargetLocation::IsFrontLocation' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetAttackTargetLocation, FrontDistance) == 0x000008, "Member 'BP_ActionUniqueAttackBase_C_GetAttackTargetLocation::FrontDistance' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetAttackTargetLocation, Location) == 0x000010, "Member 'BP_ActionUniqueAttackBase_C_GetAttackTargetLocation::Location' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetAttackTargetLocation, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000028, "Member 'BP_ActionUniqueAttackBase_C_GetAttackTargetLocation::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetAttackTargetLocation, CallFunc_GetTargetLocation_ReturnValue) == 0x000040, "Member 'BP_ActionUniqueAttackBase_C_GetAttackTargetLocation::CallFunc_GetTargetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetAttackTargetLocation, CallFunc_GetActionCharacter_ReturnValue) == 0x000058, "Member 'BP_ActionUniqueAttackBase_C_GetAttackTargetLocation::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetAttackTargetLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000060, "Member 'BP_ActionUniqueAttackBase_C_GetAttackTargetLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetAttackTargetLocation, CallFunc_GetActorForwardVector_ReturnValue) == 0x000078, "Member 'BP_ActionUniqueAttackBase_C_GetAttackTargetLocation::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetAttackTargetLocation, CallFunc_GetActionCharacter_ReturnValue_1) == 0x000090, "Member 'BP_ActionUniqueAttackBase_C_GetAttackTargetLocation::CallFunc_GetActionCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetAttackTargetLocation, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000098, "Member 'BP_ActionUniqueAttackBase_C_GetAttackTargetLocation::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetAttackTargetLocation, CallFunc_GetUniqueActionTarget_TargetActor) == 0x0000B0, "Member 'BP_ActionUniqueAttackBase_C_GetAttackTargetLocation::CallFunc_GetUniqueActionTarget_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetAttackTargetLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B8, "Member 'BP_ActionUniqueAttackBase_C_GetAttackTargetLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetAttackTargetLocation, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'BP_ActionUniqueAttackBase_C_GetAttackTargetLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetAttackTargetLocation, CallFunc_GetAttackTargetLocation_ReturnValue) == 0x0000D8, "Member 'BP_ActionUniqueAttackBase_C_GetAttackTargetLocation::CallFunc_GetAttackTargetLocation_ReturnValue' has a wrong offset!");

// Function BP_ActionUniqueAttackBase.BP_ActionUniqueAttackBase_C.GetCapsuleHalfHeight
// 0x0020 (0x0020 - 0x0000)
struct BP_ActionUniqueAttackBase_C_GetCapsuleHalfHeight final
{
public:
	double                                        HalfHeight;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B3D[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_FunctionResult_HalfHeight_ImplicitCast;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionUniqueAttackBase_C_GetCapsuleHalfHeight) == 0x000008, "Wrong alignment on BP_ActionUniqueAttackBase_C_GetCapsuleHalfHeight");
static_assert(sizeof(BP_ActionUniqueAttackBase_C_GetCapsuleHalfHeight) == 0x000020, "Wrong size on BP_ActionUniqueAttackBase_C_GetCapsuleHalfHeight");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetCapsuleHalfHeight, HalfHeight) == 0x000000, "Member 'BP_ActionUniqueAttackBase_C_GetCapsuleHalfHeight::HalfHeight' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetCapsuleHalfHeight, CallFunc_GetActionCharacter_ReturnValue) == 0x000008, "Member 'BP_ActionUniqueAttackBase_C_GetCapsuleHalfHeight::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetCapsuleHalfHeight, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue) == 0x000010, "Member 'BP_ActionUniqueAttackBase_C_GetCapsuleHalfHeight::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetCapsuleHalfHeight, K2Node_FunctionResult_HalfHeight_ImplicitCast) == 0x000018, "Member 'BP_ActionUniqueAttackBase_C_GetCapsuleHalfHeight::K2Node_FunctionResult_HalfHeight_ImplicitCast' has a wrong offset!");

// Function BP_ActionUniqueAttackBase.BP_ActionUniqueAttackBase_C.GetCapsuleHalfRadius
// 0x0020 (0x0020 - 0x0000)
struct BP_ActionUniqueAttackBase_C_GetCapsuleHalfRadius final
{
public:
	double                                        HalfRadius;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleRadius_ReturnValue;       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B3E[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_FunctionResult_HalfRadius_ImplicitCast;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionUniqueAttackBase_C_GetCapsuleHalfRadius) == 0x000008, "Wrong alignment on BP_ActionUniqueAttackBase_C_GetCapsuleHalfRadius");
static_assert(sizeof(BP_ActionUniqueAttackBase_C_GetCapsuleHalfRadius) == 0x000020, "Wrong size on BP_ActionUniqueAttackBase_C_GetCapsuleHalfRadius");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetCapsuleHalfRadius, HalfRadius) == 0x000000, "Member 'BP_ActionUniqueAttackBase_C_GetCapsuleHalfRadius::HalfRadius' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetCapsuleHalfRadius, CallFunc_GetActionCharacter_ReturnValue) == 0x000008, "Member 'BP_ActionUniqueAttackBase_C_GetCapsuleHalfRadius::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetCapsuleHalfRadius, CallFunc_GetScaledCapsuleRadius_ReturnValue) == 0x000010, "Member 'BP_ActionUniqueAttackBase_C_GetCapsuleHalfRadius::CallFunc_GetScaledCapsuleRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetCapsuleHalfRadius, K2Node_FunctionResult_HalfRadius_ImplicitCast) == 0x000018, "Member 'BP_ActionUniqueAttackBase_C_GetCapsuleHalfRadius::K2Node_FunctionResult_HalfRadius_ImplicitCast' has a wrong offset!");

// Function BP_ActionUniqueAttackBase.BP_ActionUniqueAttackBase_C.GetFootLocation
// 0x0078 (0x0078 - 0x0000)
struct BP_ActionUniqueAttackBase_C_GetFootLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionUniqueAttackBase_C_GetFootLocation) == 0x000008, "Wrong alignment on BP_ActionUniqueAttackBase_C_GetFootLocation");
static_assert(sizeof(BP_ActionUniqueAttackBase_C_GetFootLocation) == 0x000078, "Wrong size on BP_ActionUniqueAttackBase_C_GetFootLocation");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetFootLocation, Location) == 0x000000, "Member 'BP_ActionUniqueAttackBase_C_GetFootLocation::Location' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetFootLocation, CallFunc_GetActionCharacter_ReturnValue) == 0x000018, "Member 'BP_ActionUniqueAttackBase_C_GetFootLocation::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetFootLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'BP_ActionUniqueAttackBase_C_GetFootLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetFootLocation, CallFunc_BreakVector_X) == 0x000038, "Member 'BP_ActionUniqueAttackBase_C_GetFootLocation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetFootLocation, CallFunc_BreakVector_Y) == 0x000040, "Member 'BP_ActionUniqueAttackBase_C_GetFootLocation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetFootLocation, CallFunc_BreakVector_Z) == 0x000048, "Member 'BP_ActionUniqueAttackBase_C_GetFootLocation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetFootLocation, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_ActionUniqueAttackBase_C_GetFootLocation::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetFootLocation, CallFunc_MakeVector_ReturnValue) == 0x000058, "Member 'BP_ActionUniqueAttackBase_C_GetFootLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetFootLocation, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000070, "Member 'BP_ActionUniqueAttackBase_C_GetFootLocation::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function BP_ActionUniqueAttackBase.BP_ActionUniqueAttackBase_C.GetHeightToFloor
// 0x0078 (0x0078 - 0x0000)
struct BP_ActionUniqueAttackBase_C_GetHeightToFloor final
{
public:
	double                                        Height;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetFootLocation_Location;                 // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetFloorHitLocationByActor_ReturnValue;   // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionUniqueAttackBase_C_GetHeightToFloor) == 0x000008, "Wrong alignment on BP_ActionUniqueAttackBase_C_GetHeightToFloor");
static_assert(sizeof(BP_ActionUniqueAttackBase_C_GetHeightToFloor) == 0x000078, "Wrong size on BP_ActionUniqueAttackBase_C_GetHeightToFloor");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetHeightToFloor, Height) == 0x000000, "Member 'BP_ActionUniqueAttackBase_C_GetHeightToFloor::Height' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetHeightToFloor, CallFunc_GetFootLocation_Location) == 0x000008, "Member 'BP_ActionUniqueAttackBase_C_GetHeightToFloor::CallFunc_GetFootLocation_Location' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetHeightToFloor, CallFunc_GetActionCharacter_ReturnValue) == 0x000020, "Member 'BP_ActionUniqueAttackBase_C_GetHeightToFloor::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetHeightToFloor, CallFunc_BreakVector_X) == 0x000028, "Member 'BP_ActionUniqueAttackBase_C_GetHeightToFloor::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetHeightToFloor, CallFunc_BreakVector_Y) == 0x000030, "Member 'BP_ActionUniqueAttackBase_C_GetHeightToFloor::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetHeightToFloor, CallFunc_BreakVector_Z) == 0x000038, "Member 'BP_ActionUniqueAttackBase_C_GetHeightToFloor::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetHeightToFloor, CallFunc_GetFloorHitLocationByActor_ReturnValue) == 0x000040, "Member 'BP_ActionUniqueAttackBase_C_GetHeightToFloor::CallFunc_GetFloorHitLocationByActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetHeightToFloor, CallFunc_BreakVector_X_1) == 0x000058, "Member 'BP_ActionUniqueAttackBase_C_GetHeightToFloor::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetHeightToFloor, CallFunc_BreakVector_Y_1) == 0x000060, "Member 'BP_ActionUniqueAttackBase_C_GetHeightToFloor::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetHeightToFloor, CallFunc_BreakVector_Z_1) == 0x000068, "Member 'BP_ActionUniqueAttackBase_C_GetHeightToFloor::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetHeightToFloor, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000070, "Member 'BP_ActionUniqueAttackBase_C_GetHeightToFloor::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_ActionUniqueAttackBase.BP_ActionUniqueAttackBase_C.GetPalAnimInstance
// 0x0030 (0x0030 - 0x0000)
struct BP_ActionUniqueAttackBase_C_GetPalAnimInstance final
{
public:
	class UPalAnimInstance*                       AnimInstance;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalSkeletalMeshComponent*              CallFunc_GetMainMesh_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalAnimInstance*                       K2Node_DynamicCast_AsPal_Anim_Instance;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionUniqueAttackBase_C_GetPalAnimInstance) == 0x000008, "Wrong alignment on BP_ActionUniqueAttackBase_C_GetPalAnimInstance");
static_assert(sizeof(BP_ActionUniqueAttackBase_C_GetPalAnimInstance) == 0x000030, "Wrong size on BP_ActionUniqueAttackBase_C_GetPalAnimInstance");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetPalAnimInstance, AnimInstance) == 0x000000, "Member 'BP_ActionUniqueAttackBase_C_GetPalAnimInstance::AnimInstance' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetPalAnimInstance, CallFunc_GetActionCharacter_ReturnValue) == 0x000008, "Member 'BP_ActionUniqueAttackBase_C_GetPalAnimInstance::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetPalAnimInstance, CallFunc_GetMainMesh_ReturnValue) == 0x000010, "Member 'BP_ActionUniqueAttackBase_C_GetPalAnimInstance::CallFunc_GetMainMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetPalAnimInstance, CallFunc_GetAnimInstance_ReturnValue) == 0x000018, "Member 'BP_ActionUniqueAttackBase_C_GetPalAnimInstance::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetPalAnimInstance, K2Node_DynamicCast_AsPal_Anim_Instance) == 0x000020, "Member 'BP_ActionUniqueAttackBase_C_GetPalAnimInstance::K2Node_DynamicCast_AsPal_Anim_Instance' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetPalAnimInstance, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_ActionUniqueAttackBase_C_GetPalAnimInstance::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_ActionUniqueAttackBase.BP_ActionUniqueAttackBase_C.GetRotation
// 0x0230 (0x0230 - 0x0000)
struct BP_ActionUniqueAttackBase_C_GetRotation final
{
public:
