#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_Unique_SheepBall_Roll

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EAction_SheepBall_Roll_structs.hpp"
#include "Pal_structs.hpp"
#include "BP_ActionUniqueAttackBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_Unique_SheepBall_Roll.BP_Action_Unique_SheepBall_Roll_C
// 0x0070 (0x0280 - 0x0210)
class UBP_Action_Unique_SheepBall_Roll_C final : public UBP_ActionUniqueAttackBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Action_Unique_SheepBall_Roll_C;  // 0x0210(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	EAction_SheepBall_Roll                        State;                                             // 0x0218(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A91[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AttackTime;                                        // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalAttackFilter*                       AttackFilter;                                      // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Timer;                                             // 0x0230(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        HomingSpeed;                                       // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSkillEffectSpawnParameter>     SkillEffectSpawnParameters_0;                      // 0x0240(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class APalSkillEffectBase*>            SkillEffects;                                      // 0x0250(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	double                                        StunValue;                                         // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MoveSpeed;                                         // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasActionBroken;                                   // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActivateEffect(class FName EffectName);
	void Break_Action();
	void CreateSkillEffects(class ABP_SkillEffect_Unique_SheepBall_Roll_C** SkillEffect);
	void EndAttack();
	void EndAttackByTimer();
	void ExecuteUbergraph_BP_Action_Unique_SheepBall_Roll(int32 EntryPoint);
	void Get_Target_Rotation(double DeltaTime, struct FRotator* TargetRotation);
	void GetAttackFilter(class UPalAttackFilter** Param_AttackFilter);
	void MoveToTarget(double DeltaTime);
	void OnBeginAction();
	void OnBlendOut_C557B64E48F004F3125D70A418B49910(class FName NotifyName);
	void OnBlendOut_D0C96F694588FEAE59630DB3009709D2(class FName NotifyName);
	void OnBlendOut_D781E39A4E3F598040D42584BD94C8DC(class FName NotifyName);
	void OnCompleted_C557B64E48F004F3125D70A418B49910(class FName NotifyName);
	void OnCompleted_D0C96F694588FEAE59630DB3009709D2(class FName NotifyName);
	void OnCompleted_D781E39A4E3F598040D42584BD94C8DC(class FName NotifyName);
	void OnEndAction();
	void OnInterrupted_C557B64E48F004F3125D70A418B49910(class FName NotifyName);
	void OnInterrupted_D0C96F694588FEAE59630DB3009709D2(class FName NotifyName);
	void OnInterrupted_D781E39A4E3F598040D42584BD94C8DC(class FName NotifyName);
	void OnNotifyBegin_C557B64E48F004F3125D70A418B49910(class FName NotifyName);
	void OnNotifyBegin_D0C96F694588FEAE59630DB3009709D2(class FName NotifyName);
	void OnNotifyBegin_D781E39A4E3F598040D42584BD94C8DC(class FName NotifyName);
	void OnNotifyEnd_C557B64E48F004F3125D70A418B49910(class FName NotifyName);
	void OnNotifyEnd_D0C96F694588FEAE59630DB3009709D2(class FName NotifyName);
	void OnNotifyEnd_D781E39A4E3F598040D42584BD94C8DC(class FName NotifyName);
	void SetMovementSetting(bool MoveEnable);
	void StunActionCharacter();
	void TickAction(float DeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Action_Unique_SheepBall_Roll_C">();
	}
	static class UBP_Action_Unique_SheepBall_Roll_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Action_Unique_SheepBall_Roll_C>();
	}
};
static_assert(alignof(UBP_Action_Unique_SheepBall_Roll_C) == 0x000010, "Wrong alignment on UBP_Action_Unique_SheepBall_Roll_C");
static_assert(sizeof(UBP_Action_Unique_SheepBall_Roll_C) == 0x000280, "Wrong size on UBP_Action_Unique_SheepBall_Roll_C");
static_assert(offsetof(UBP_Action_Unique_SheepBall_Roll_C, UberGraphFrame_BP_Action_Unique_SheepBall_Roll_C) == 0x000210, "Member 'UBP_Action_Unique_SheepBall_Roll_C::UberGraphFrame_BP_Action_Unique_SheepBall_Roll_C' has a wrong offset!");
static_assert(offsetof(UBP_Action_Unique_SheepBall_Roll_C, State) == 0x000218, "Member 'UBP_Action_Unique_SheepBall_Roll_C::State' has a wrong offset!");
static_assert(offsetof(UBP_Action_Unique_SheepBall_Roll_C, AttackTime) == 0x000220, "Member 'UBP_Action_Unique_SheepBall_Roll_C::AttackTime' has a wrong offset!");
static_assert(offsetof(UBP_Action_Unique_SheepBall_Roll_C, AttackFilter) == 0x000228, "Member 'UBP_Action_Unique_SheepBall_Roll_C::AttackFilter' has a wrong offset!");
static_assert(offsetof(UBP_Action_Unique_SheepBall_Roll_C, Timer) == 0x000230, "Member 'UBP_Action_Unique_SheepBall_Roll_C::Timer' has a wrong offset!");
static_assert(offsetof(UBP_Action_Unique_SheepBall_Roll_C, HomingSpeed) == 0x000238, "Member 'UBP_Action_Unique_SheepBall_Roll_C::HomingSpeed' has a wrong offset!");
static_assert(offsetof(UBP_Action_Unique_SheepBall_Roll_C, SkillEffectSpawnParameters_0) == 0x000240, "Member 'UBP_Action_Unique_SheepBall_Roll_C::SkillEffectSpawnParameters_0' has a wrong offset!");
static_assert(offsetof(UBP_Action_Unique_SheepBall_Roll_C, SkillEffects) == 0x000250, "Member 'UBP_Action_Unique_SheepBall_Roll_C::SkillEffects' has a wrong offset!");
static_assert(offsetof(UBP_Action_Unique_SheepBall_Roll_C, StunValue) == 0x000260, "Member 'UBP_Action_Unique_SheepBall_Roll_C::StunValue' has a wrong offset!");
static_assert(offsetof(UBP_Action_Unique_SheepBall_Roll_C, MoveSpeed) == 0x000268, "Member 'UBP_Action_Unique_SheepBall_Roll_C::MoveSpeed' has a wrong offset!");
static_assert(offsetof(UBP_Action_Unique_SheepBall_Roll_C, HasActionBroken) == 0x000270, "Member 'UBP_Action_Unique_SheepBall_Roll_C::HasActionBroken' has a wrong offset!");

}

