#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BuildingUIParameter

#include "Basic.hpp"

#include "Pal_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BuildingUIParameter.BP_BuildingUIParameter_C
// 0x0010 (0x0048 - 0x0038)
class UBP_BuildingUIParameter_C final : public UPalHUDDispatchParameterBase
{
public:
	class FName                                   BuildObjectId;                                     // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bFromRadialMenu;                                   // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_4F7C[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectedIndex;                                     // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BuildingUIParameter_C">();
	}
	static class UBP_BuildingUIParameter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BuildingUIParameter_C>();
	}
};
static_assert(alignof(UBP_BuildingUIParameter_C) == 0x000008, "Wrong alignment on UBP_BuildingUIParameter_C");
static_assert(sizeof(UBP_BuildingUIParameter_C) == 0x000048, "Wrong size on UBP_BuildingUIParameter_C");
static_assert(offsetof(UBP_BuildingUIParameter_C, BuildObjectId) == 0x000038, "Member 'UBP_BuildingUIParameter_C::BuildObjectId' has a wrong offset!");
static_assert(offsetof(UBP_BuildingUIParameter_C, bFromRadialMenu) == 0x000040, "Member 'UBP_BuildingUIParameter_C::bFromRadialMenu' has a wrong offset!");
static_assert(offsetof(UBP_BuildingUIParameter_C, SelectedIndex) == 0x000044, "Member 'UBP_BuildingUIParameter_C::SelectedIndex' has a wrong offset!");

}

