#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CascadeRiverTool

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CascadeRiverTool.BP_CascadeRiverTool_C.ExecuteUbergraph_BP_CascadeRiverTool
// 0x0008 (0x0008 - 0x0000)
struct BP_CascadeRiverTool_C_ExecuteUbergraph_BP_CascadeRiverTool final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CascadeRiverTool_C_ExecuteUbergraph_BP_CascadeRiverTool) == 0x000004, "Wrong alignment on BP_CascadeRiverTool_C_ExecuteUbergraph_BP_CascadeRiverTool");
static_assert(sizeof(BP_CascadeRiverTool_C_ExecuteUbergraph_BP_CascadeRiverTool) == 0x000008, "Wrong size on BP_CascadeRiverTool_C_ExecuteUbergraph_BP_CascadeRiverTool");
static_assert(offsetof(BP_CascadeRiverTool_C_ExecuteUbergraph_BP_CascadeRiverTool, EntryPoint) == 0x000000, "Member 'BP_CascadeRiverTool_C_ExecuteUbergraph_BP_CascadeRiverTool::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_ExecuteUbergraph_BP_CascadeRiverTool, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_CascadeRiverTool_C_ExecuteUbergraph_BP_CascadeRiverTool::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_CascadeRiverTool.BP_CascadeRiverTool_C.GenerateSplineMesh
// 0x0940 (0x0940 - 0x0000)
struct BP_CascadeRiverTool_C_GenerateSplineMesh final
{
public:
	ECollisionEnabled                             Param_Collision;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_CastShadow;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AB4[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Material;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       TargetSpline;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        SplineStartOffset;                                 // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Offset;                                            // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Scale;                                             // 0x0038(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TangetScale;                                       // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Spacing;                                           // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0060(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UStaticMesh*                            StaticMesh;                                        // 0x0078(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       Param_PathDeform;                                  // 0x0080(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        PathDeformDistance;                                // 0x0088(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTriggerVolume;                                   // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AB5[0xE];                                     // 0x0092(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AB6[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AB7[0x4];                                     // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMod_Remainder;                           // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FMod_ReturnValue;                         // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AB8[0x4];                                     // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue; // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x01F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x0250(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Temp_bool_Variable;                                // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AB9[0x7];                                     // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0340(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0360(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0378(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Variable;                                 // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5ABA[0x3];                                     // 0x0469(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetScaleAtDistanceAlongSpline_ReturnValue; // 0x0480(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_3;                          // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetScaleAtDistanceAlongSpline_ReturnValue_1; // 0x04B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_4;                          // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_4;                          // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_4;                          // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0500(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_6;      // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0518(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue_1; // 0x0528(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue_2; // 0x0540(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue_3; // 0x0568(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_3;           // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_NegateRotator_ReturnValue;                // 0x0588(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue_4; // 0x05A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x05B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x05D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x05E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x05EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x05F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5ABB[0x4];                                     // 0x05F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_1;            // 0x05F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_DegreesToRadians_ReturnValue;             // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0618(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x061C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0620(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5ABC[0x4];                                     // 0x0624(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_DegreesToRadians_ReturnValue_1;           // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetScaleAtDistanceAlongSpline_ReturnValue_2; // 0x0630(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_5;                          // 0x0648(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_5;                          // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_5;                          // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionAtDistanceAlongSpline_ReturnValue; // 0x0660(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0678(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0690(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x06A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1; // 0x06C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x06D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_4;           // 0x06F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x06F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_5;           // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0718(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue_5; // 0x0730(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_PathDeform__CoordinatesOut;               // 0x0748(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue_1; // 0x0760(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetScaleAtDistanceAlongSpline_ReturnValue_3; // 0x0778(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetDirectionAtDistanceAlongSpline_ReturnValue_1; // 0x0790(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_6;                          // 0x07A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_6;                          // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_6;                          // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x07C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x07D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_2; // 0x07F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0808(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVectorAtDistanceAlongSpline_ReturnValue; // 0x0820(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0838(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0850(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0868(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0880(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5ABD[0x7];                                     // 0x0881(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_PathDeform__CoordinatesOut_1;             // 0x0888(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRotationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x08A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast; // 0x08A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x08A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5ABE[0x4];                                     // 0x08AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMod_Dividend_ImplicitCast;               // 0x08B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x08B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x08BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x08C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_4; // 0x08C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_5; // 0x08C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_6; // 0x08CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_7; // 0x08D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_8; // 0x08D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x08D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRotationAtDistanceAlongSpline_Distance_ImplicitCast_1; // 0x08E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaleAtDistanceAlongSpline_Distance_ImplicitCast; // 0x08E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRotationAtDistanceAlongSpline_Distance_ImplicitCast_2; // 0x08E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaleAtDistanceAlongSpline_Distance_ImplicitCast_1; // 0x08EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetUpVectorAtDistanceAlongSpline_Distance_ImplicitCast; // 0x08F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRotationAtDistanceAlongSpline_Distance_ImplicitCast_3; // 0x08F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_1; // 0x08F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDirectionAtDistanceAlongSpline_Distance_ImplicitCast; // 0x08FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaleAtDistanceAlongSpline_Distance_ImplicitCast_2; // 0x0900(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRotationAtDistanceAlongSpline_Distance_ImplicitCast_4; // 0x0904(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegreesToRadians_A_ImplicitCast;          // 0x0908(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetEndRoll_EndRoll_ImplicitCast;          // 0x0910(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5ABF[0x4];                                     // 0x0914(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_DegreesToRadians_A_ImplicitCast_1;        // 0x0918(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetStartRoll_StartRoll_ImplicitCast;      // 0x0920(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast_2; // 0x0924(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDirectionAtDistanceAlongSpline_Distance_ImplicitCast_1; // 0x0928(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaleAtDistanceAlongSpline_Distance_ImplicitCast_3; // 0x092C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRotationAtDistanceAlongSpline_Distance_ImplicitCast_5; // 0x0930(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CascadeRiverTool_C_GenerateSplineMesh) == 0x000010, "Wrong alignment on BP_CascadeRiverTool_C_GenerateSplineMesh");
static_assert(sizeof(BP_CascadeRiverTool_C_GenerateSplineMesh) == 0x000940, "Wrong size on BP_CascadeRiverTool_C_GenerateSplineMesh");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, Param_Collision) == 0x000000, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::Param_Collision' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, Param_CastShadow) == 0x000001, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::Param_CastShadow' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, Material) == 0x000008, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::Material' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, TargetSpline) == 0x000010, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::TargetSpline' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, SplineStartOffset) == 0x000018, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::SplineStartOffset' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, Offset) == 0x000020, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::Offset' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, Scale) == 0x000038, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::Scale' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, TangetScale) == 0x000050, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::TangetScale' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, Spacing) == 0x000058, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::Spacing' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, Rotation) == 0x000060, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::Rotation' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, StaticMesh) == 0x000078, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::StaticMesh' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, Param_PathDeform) == 0x000080, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::Param_PathDeform' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, PathDeformDistance) == 0x000088, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::PathDeformDistance' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, IsTriggerVolume) == 0x000090, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::IsTriggerVolume' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000091, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_MakeTransform_ReturnValue) == 0x0000A0, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_AddComponent_ReturnValue) == 0x000100, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000108, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_SetStaticMesh_ReturnValue) == 0x000110, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000118, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000130, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_BreakVector_X) == 0x000148, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_BreakVector_Y) == 0x000150, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_BreakVector_Z) == 0x000158, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_BreakVector_X_1) == 0x000160, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_BreakVector_Y_1) == 0x000168, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_BreakVector_Z_1) == 0x000170, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_BreakVector_X_2) == 0x000178, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_BreakVector_Y_2) == 0x000180, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_BreakVector_Z_2) == 0x000188, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_GetSplineLength_ReturnValue) == 0x000190, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_FMod_Remainder) == 0x000198, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_FMod_Remainder' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_FMod_ReturnValue) == 0x0001A0, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_FMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0001A8, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0001B0, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0001B8, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x0001C0, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue) == 0x0001D8, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_MakeTransform_ReturnValue_1) == 0x0001F0, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x000250, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, Temp_bool_Variable) == 0x000338, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_MakeVector_ReturnValue) == 0x000340, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000358, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_MakeVector_ReturnValue_1) == 0x000360, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000378, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, Temp_int_Variable) == 0x000460, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_Add_IntInt_ReturnValue) == 0x000464, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000468, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00046C, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, K2Node_Select_Default) == 0x000470, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000478, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_GetScaleAtDistanceAlongSpline_ReturnValue) == 0x000480, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_GetScaleAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000498, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_BreakVector_X_3) == 0x0004A0, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_BreakVector_Y_3) == 0x0004A8, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_BreakVector_Z_3) == 0x0004B0, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_GetScaleAtDistanceAlongSpline_ReturnValue_1) == 0x0004B8, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_GetScaleAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x0004D0, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_BreakVector_X_4) == 0x0004D8, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_BreakVector_X_4' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_BreakVector_Y_4) == 0x0004E0, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_BreakVector_Y_4' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_BreakVector_Z_4) == 0x0004E8, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_BreakVector_Z_4' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x0004F0, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x0004F8, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_MakeVector2D_ReturnValue) == 0x000500, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_Multiply_DoubleDouble_ReturnValue_6) == 0x000510, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_Multiply_DoubleDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_MakeVector2D_ReturnValue_1) == 0x000518, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue_1) == 0x000528, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue_2) == 0x000540, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000558, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000560, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue_3) == 0x000568, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_Add_DoubleDouble_ReturnValue_3) == 0x000580, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_Add_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_NegateRotator_ReturnValue) == 0x000588, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_NegateRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue_4) == 0x0005A0, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_ComposeRotators_ReturnValue) == 0x0005B8, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x0005D0, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_BreakRotator_Roll) == 0x0005E8, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_BreakRotator_Pitch) == 0x0005EC, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_BreakRotator_Yaw) == 0x0005F0, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_ComposeRotators_ReturnValue_1) == 0x0005F8, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_ComposeRotators_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_DegreesToRadians_ReturnValue) == 0x000610, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_DegreesToRadians_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_BreakRotator_Roll_1) == 0x000618, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_BreakRotator_Pitch_1) == 0x00061C, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_BreakRotator_Yaw_1) == 0x000620, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_DegreesToRadians_ReturnValue_1) == 0x000628, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_DegreesToRadians_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_GetScaleAtDistanceAlongSpline_ReturnValue_2) == 0x000630, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_GetScaleAtDistanceAlongSpline_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_BreakVector_X_5) == 0x000648, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_BreakVector_X_5' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_BreakVector_Y_5) == 0x000650, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_BreakVector_Y_5' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_BreakVector_Z_5) == 0x000658, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_BreakVector_Z_5' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_GetDirectionAtDistanceAlongSpline_ReturnValue) == 0x000660, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_GetDirectionAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_MakeVector_ReturnValue_2) == 0x000678, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000690, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0006A8, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1) == 0x0006C0, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0006D8, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_Add_DoubleDouble_ReturnValue_4) == 0x0006F0, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_Add_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_Add_VectorVector_ReturnValue) == 0x0006F8, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_Add_DoubleDouble_ReturnValue_5) == 0x000710, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_Add_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000718, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue_5) == 0x000730, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_PathDeform__CoordinatesOut) == 0x000748, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_PathDeform__CoordinatesOut' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_GreaterGreater_VectorRotator_ReturnValue_1) == 0x000760, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_GreaterGreater_VectorRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_GetScaleAtDistanceAlongSpline_ReturnValue_3) == 0x000778, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_GetScaleAtDistanceAlongSpline_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_GetDirectionAtDistanceAlongSpline_ReturnValue_1) == 0x000790, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_GetDirectionAtDistanceAlongSpline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_BreakVector_X_6) == 0x0007A8, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_BreakVector_X_6' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_BreakVector_Y_6) == 0x0007B0, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_BreakVector_Y_6' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_BreakVector_Z_6) == 0x0007B8, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_BreakVector_Z_6' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0007C0, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_MakeVector_ReturnValue_3) == 0x0007D8, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_2) == 0x0007F0, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000808, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_GetUpVectorAtDistanceAlongSpline_ReturnValue) == 0x000820, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_GetUpVectorAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000838, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000850, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_Add_VectorVector_ReturnValue_3) == 0x000868, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000880, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_PathDeform__CoordinatesOut_1) == 0x000888, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_PathDeform__CoordinatesOut_1' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_GetRotationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x0008A0, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_GetRotationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast) == 0x0008A4, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_GetLocationAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0008A8, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_FMod_Dividend_ImplicitCast) == 0x0008B0, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_FMod_Dividend_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x0008B8, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x0008BC, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_CascadeRiverTool_C_GenerateSplineMesh, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x0008C0, "Member 'BP_CascadeRiverTool_C_GenerateSplineMesh::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");
