#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CoopParam_Shield

#include "Basic.hpp"

#include "Pal_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CoopParam_Shield.BP_CoopParam_Shield_C.BindToShooterDelegate
// 0x0020 (0x0020 - 0x0000)
struct BP_CoopParam_Shield_C_BindToShooterDelegate final
{
public:
	TDelegate<void(bool IsAim, bool IsShoot)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalShooterComponent*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CoopParam_Shield_C_BindToShooterDelegate) == 0x000008, "Wrong alignment on BP_CoopParam_Shield_C_BindToShooterDelegate");
static_assert(sizeof(BP_CoopParam_Shield_C_BindToShooterDelegate) == 0x000020, "Wrong size on BP_CoopParam_Shield_C_BindToShooterDelegate");
static_assert(offsetof(BP_CoopParam_Shield_C_BindToShooterDelegate, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_CoopParam_Shield_C_BindToShooterDelegate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_BindToShooterDelegate, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'BP_CoopParam_Shield_C_BindToShooterDelegate::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_BindToShooterDelegate, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_CoopParam_Shield_C_BindToShooterDelegate::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_CoopParam_Shield.BP_CoopParam_Shield_C.ChangeAnimationByWeaponState
// 0x000C (0x000C - 0x0000)
struct BP_CoopParam_Shield_C_ChangeAnimationByWeaponState final
{
public:
	bool                                          IsAim;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShoot;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AF2[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PlayAnimMontage_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimMontage_ReturnValue_1;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CoopParam_Shield_C_ChangeAnimationByWeaponState) == 0x000004, "Wrong alignment on BP_CoopParam_Shield_C_ChangeAnimationByWeaponState");
static_assert(sizeof(BP_CoopParam_Shield_C_ChangeAnimationByWeaponState) == 0x00000C, "Wrong size on BP_CoopParam_Shield_C_ChangeAnimationByWeaponState");
static_assert(offsetof(BP_CoopParam_Shield_C_ChangeAnimationByWeaponState, IsAim) == 0x000000, "Member 'BP_CoopParam_Shield_C_ChangeAnimationByWeaponState::IsAim' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ChangeAnimationByWeaponState, IsShoot) == 0x000001, "Member 'BP_CoopParam_Shield_C_ChangeAnimationByWeaponState::IsShoot' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ChangeAnimationByWeaponState, CallFunc_BooleanOR_ReturnValue) == 0x000002, "Member 'BP_CoopParam_Shield_C_ChangeAnimationByWeaponState::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ChangeAnimationByWeaponState, CallFunc_PlayAnimMontage_ReturnValue) == 0x000004, "Member 'BP_CoopParam_Shield_C_ChangeAnimationByWeaponState::CallFunc_PlayAnimMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ChangeAnimationByWeaponState, CallFunc_PlayAnimMontage_ReturnValue_1) == 0x000008, "Member 'BP_CoopParam_Shield_C_ChangeAnimationByWeaponState::CallFunc_PlayAnimMontage_ReturnValue_1' has a wrong offset!");

// Function BP_CoopParam_Shield.BP_CoopParam_Shield_C.ChangeFacial
// 0x0018 (0x0018 - 0x0000)
struct BP_CoopParam_Shield_C_ChangeFacial final
{
public:
	bool                                          IsCoopActionFace;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalFacialEyeType                             NextFacial;                                        // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AF3[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalFacialComponent*                    CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CoopParam_Shield_C_ChangeFacial) == 0x000008, "Wrong alignment on BP_CoopParam_Shield_C_ChangeFacial");
static_assert(sizeof(BP_CoopParam_Shield_C_ChangeFacial) == 0x000018, "Wrong size on BP_CoopParam_Shield_C_ChangeFacial");
static_assert(offsetof(BP_CoopParam_Shield_C_ChangeFacial, IsCoopActionFace) == 0x000000, "Member 'BP_CoopParam_Shield_C_ChangeFacial::IsCoopActionFace' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ChangeFacial, NextFacial) == 0x000001, "Member 'BP_CoopParam_Shield_C_ChangeFacial::NextFacial' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ChangeFacial, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'BP_CoopParam_Shield_C_ChangeFacial::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ChangeFacial, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_CoopParam_Shield_C_ChangeFacial::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ChangeFacial, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'BP_CoopParam_Shield_C_ChangeFacial::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function BP_CoopParam_Shield.BP_CoopParam_Shield_C.DoAttach
// 0x0020 (0x0020 - 0x0000)
struct BP_CoopParam_Shield_C_DoAttach final
{
public:
	class APalCharacter*                          AttachTarget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalShooterComponent*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPalCharacterParameterComponent*        CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CoopParam_Shield_C_DoAttach) == 0x000008, "Wrong alignment on BP_CoopParam_Shield_C_DoAttach");
static_assert(sizeof(BP_CoopParam_Shield_C_DoAttach) == 0x000020, "Wrong size on BP_CoopParam_Shield_C_DoAttach");
static_assert(offsetof(BP_CoopParam_Shield_C_DoAttach, AttachTarget) == 0x000000, "Member 'BP_CoopParam_Shield_C_DoAttach::AttachTarget' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_DoAttach, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_CoopParam_Shield_C_DoAttach::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_DoAttach, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'BP_CoopParam_Shield_C_DoAttach::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_DoAttach, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000018, "Member 'BP_CoopParam_Shield_C_DoAttach::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");

// Function BP_CoopParam_Shield.BP_CoopParam_Shield_C.DoAttach_ToAll
// 0x0008 (0x0008 - 0x0000)
struct BP_CoopParam_Shield_C_DoAttach_ToAll final
{
public:
	class APalCharacter*                          TargetPlayer;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CoopParam_Shield_C_DoAttach_ToAll) == 0x000008, "Wrong alignment on BP_CoopParam_Shield_C_DoAttach_ToAll");
static_assert(sizeof(BP_CoopParam_Shield_C_DoAttach_ToAll) == 0x000008, "Wrong size on BP_CoopParam_Shield_C_DoAttach_ToAll");
static_assert(offsetof(BP_CoopParam_Shield_C_DoAttach_ToAll, TargetPlayer) == 0x000000, "Member 'BP_CoopParam_Shield_C_DoAttach_ToAll::TargetPlayer' has a wrong offset!");

// Function BP_CoopParam_Shield.BP_CoopParam_Shield_C.DoDetach
// 0x0020 (0x0020 - 0x0000)
struct BP_CoopParam_Shield_C_DoDetach final
{
public:
	bool                                          IsThrowShield;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AF4[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalShooterComponent*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPalCharacterParameterComponent*        CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CoopParam_Shield_C_DoDetach) == 0x000008, "Wrong alignment on BP_CoopParam_Shield_C_DoDetach");
static_assert(sizeof(BP_CoopParam_Shield_C_DoDetach) == 0x000020, "Wrong size on BP_CoopParam_Shield_C_DoDetach");
static_assert(offsetof(BP_CoopParam_Shield_C_DoDetach, IsThrowShield) == 0x000000, "Member 'BP_CoopParam_Shield_C_DoDetach::IsThrowShield' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_DoDetach, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_CoopParam_Shield_C_DoDetach::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_DoDetach, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'BP_CoopParam_Shield_C_DoDetach::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_DoDetach, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000018, "Member 'BP_CoopParam_Shield_C_DoDetach::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");

// Function BP_CoopParam_Shield.BP_CoopParam_Shield_C.DoDetach_ToAll
// 0x0001 (0x0001 - 0x0000)
struct BP_CoopParam_Shield_C_DoDetach_ToAll final
{
public:
	bool                                          IsThrow;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CoopParam_Shield_C_DoDetach_ToAll) == 0x000001, "Wrong alignment on BP_CoopParam_Shield_C_DoDetach_ToAll");
static_assert(sizeof(BP_CoopParam_Shield_C_DoDetach_ToAll) == 0x000001, "Wrong size on BP_CoopParam_Shield_C_DoDetach_ToAll");
static_assert(offsetof(BP_CoopParam_Shield_C_DoDetach_ToAll, IsThrow) == 0x000000, "Member 'BP_CoopParam_Shield_C_DoDetach_ToAll::IsThrow' has a wrong offset!");

// Function BP_CoopParam_Shield.BP_CoopParam_Shield_C.ExecuteUbergraph_BP_CoopParam_Shield
// 0x0770 (0x0770 - 0x0000)
struct BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AF5[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x00E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AF6[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalSkeletalMeshComponent*              CallFunc_GetMainMesh_ReturnValue;                  // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalShooterComponent*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShooting_ReturnValue;                   // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAiming_ReturnValue;                     // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AF7[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalSkeletalMeshComponent*              CallFunc_GetMainMesh_ReturnValue_1;                // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x0150(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalSkeletalMeshComponent*              CallFunc_GetMainMesh_ReturnValue_2;                // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AF8[0x8];                                     // 0x0168(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0170(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AF9[0x8];                                     // 0x01D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x01E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_4;                   // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalShooterComponent*                   CallFunc_GetComponentByClass_ReturnValue_1;        // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAiming_ReturnValue_1;                   // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShooting_ReturnValue_1;                 // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AFA[0x6];                                     // 0x02B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_5;                   // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AFB[0x7];                                     // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalSkeletalMeshComponent*              CallFunc_GetMainMesh_ReturnValue_3;                // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AFC[0x8];                                     // 0x02D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_1;         // 0x02E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue_1;          // 0x0340(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue_2;          // 0x03A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0400(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AFD[0x7];                                     // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult_1;    // 0x04F0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue_1;       // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AFE[0x7];                                     // 0x05D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalSkeletalMeshComponent*              CallFunc_GetMainMesh_ReturnValue_4;                // 0x05E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPalShooterComponent*                   CallFunc_GetComponentByClass_ReturnValue_2;        // 0x05E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x05F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAiming_ReturnValue_2;                   // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x05F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShooting_ReturnValue_2;                 // 0x05FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x05FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x05FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x0600(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPalCharacterMovementComponent*         CallFunc_GetComponentByClass_ReturnValue_3;        // 0x0618(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x0620(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGliding_ReturnValue;                    // 0x0638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AFF[0x7];                                     // 0x0639(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x0640(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x0728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B00[0x7];                                     // 0x0729(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          K2Node_CustomEvent_TargetPlayer;                   // 0x0730(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsThrow;                        // 0x0738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B01[0x7];                                     // 0x0739(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_6;                   // 0x0740(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          K2Node_DynamicCast_AsPal_Character;                // 0x0748(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B02[0x3];                                     // 0x0751(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class APalCharacter* InCharacter)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x0754(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B03[0x4];                                     // 0x0764(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalCharacterOnCompleteInitializeParameterWrapper* CallFunc_GetOnCompleteInitializeParameterDelegate_ReturnValue; // 0x0768(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield) == 0x000010, "Wrong alignment on BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield");
static_assert(sizeof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield) == 0x000770, "Wrong size on BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, EntryPoint) == 0x000000, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, K2Node_CustomEvent_NotifyName_8) == 0x000004, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::K2Node_CustomEvent_NotifyName_8' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, K2Node_CustomEvent_NotifyName_7) == 0x00000C, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::K2Node_CustomEvent_NotifyName_7' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, K2Node_CustomEvent_NotifyName_6) == 0x000024, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::K2Node_CustomEvent_NotifyName_6' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, K2Node_CustomEvent_NotifyName_5) == 0x00003C, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, Temp_name_Variable) == 0x000054, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, K2Node_CreateDelegate_OutputDelegate_3) == 0x00005C, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00006C, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, K2Node_CustomEvent_NotifyName_4) == 0x000070, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, K2Node_CustomEvent_NotifyName_3) == 0x000078, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, K2Node_CreateDelegate_OutputDelegate_4) == 0x000080, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, K2Node_CustomEvent_NotifyName_2) == 0x000090, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, K2Node_CreateDelegate_OutputDelegate_5) == 0x000098, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, K2Node_CustomEvent_NotifyName_1) == 0x0000A8, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000B0, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, K2Node_CustomEvent_NotifyName) == 0x0000C0, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000C8, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, Temp_name_Variable_1) == 0x0000D8, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, K2Node_CreateDelegate_OutputDelegate_8) == 0x0000E0, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x0000F0, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_GetMainMesh_ReturnValue) == 0x0000F8, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_GetMainMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000100, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_GetComponentByClass_ReturnValue) == 0x000108, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_IsValid_ReturnValue) == 0x000110, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_IsShooting_ReturnValue) == 0x000111, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_IsShooting_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_IsAiming_ReturnValue) == 0x000112, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_IsAiming_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_IsValid_ReturnValue_1) == 0x000113, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_GetOwner_ReturnValue) == 0x000118, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_GetOwner_ReturnValue_1) == 0x000120, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_GetMainMesh_ReturnValue_1) == 0x000128, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_GetMainMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000130, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_GetOwner_ReturnValue_2) == 0x000148, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, K2Node_CreateDelegate_OutputDelegate_9) == 0x000150, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_GetMainMesh_ReturnValue_2) == 0x000160, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_GetMainMesh_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_GetSocketTransform_ReturnValue) == 0x000170, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_GetOwner_ReturnValue_3) == 0x0001D0, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_GetOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_ComposeTransforms_ReturnValue) == 0x0001E0, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_ComposeTransforms_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000240, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_BreakTransform_Location) == 0x000258, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_BreakTransform_Rotation) == 0x000270, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_BreakTransform_Scale) == 0x000288, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_GetOwner_ReturnValue_4) == 0x0002A0, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_GetOwner_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_GetComponentByClass_ReturnValue_1) == 0x0002A8, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_IsAiming_ReturnValue_1) == 0x0002B0, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_IsAiming_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_IsShooting_ReturnValue_1) == 0x0002B1, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_IsShooting_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_GetOwner_ReturnValue_5) == 0x0002B8, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_GetOwner_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_BooleanOR_ReturnValue) == 0x0002C0, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_GetMainMesh_ReturnValue_3) == 0x0002C8, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_GetMainMesh_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, K2Node_CustomEvent_NotifyName_9) == 0x0002D0, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::K2Node_CustomEvent_NotifyName_9' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_GetSocketTransform_ReturnValue_1) == 0x0002E0, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_GetSocketTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_ComposeTransforms_ReturnValue_1) == 0x000340, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_ComposeTransforms_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_ComposeTransforms_ReturnValue_2) == 0x0003A0, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_ComposeTransforms_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000400, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_K2_SetActorTransform_ReturnValue) == 0x0004E8, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_K2_SetActorTransform_SweepHitResult_1) == 0x0004F0, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_K2_SetActorTransform_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_K2_SetActorTransform_ReturnValue_1) == 0x0005D8, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_K2_SetActorTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_GetMainMesh_ReturnValue_4) == 0x0005E0, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_GetMainMesh_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_GetComponentByClass_ReturnValue_2) == 0x0005E8, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1) == 0x0005F0, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_IsAiming_ReturnValue_2) == 0x0005F8, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_IsAiming_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_IsValid_ReturnValue_2) == 0x0005F9, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_IsShooting_ReturnValue_2) == 0x0005FA, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_IsShooting_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_BooleanOR_ReturnValue_1) == 0x0005FB, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, K2Node_Event_DeltaSeconds) == 0x0005FC, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_RInterpTo_ReturnValue) == 0x000600, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_GetComponentByClass_ReturnValue_3) == 0x000618, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_GetComponentByClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_VInterpTo_ReturnValue) == 0x000620, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_IsGliding_ReturnValue) == 0x000638, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_IsGliding_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x000640, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x000728, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, K2Node_CustomEvent_TargetPlayer) == 0x000730, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::K2Node_CustomEvent_TargetPlayer' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, K2Node_CustomEvent_IsThrow) == 0x000738, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::K2Node_CustomEvent_IsThrow' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_GetOwner_ReturnValue_6) == 0x000740, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_GetOwner_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, K2Node_DynamicCast_AsPal_Character) == 0x000748, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::K2Node_DynamicCast_AsPal_Character' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, K2Node_DynamicCast_bSuccess) == 0x000750, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, K2Node_CreateDelegate_OutputDelegate_10) == 0x000754, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield, CallFunc_GetOnCompleteInitializeParameterDelegate_ReturnValue) == 0x000768, "Member 'BP_CoopParam_Shield_C_ExecuteUbergraph_BP_CoopParam_Shield::CallFunc_GetOnCompleteInitializeParameterDelegate_ReturnValue' has a wrong offset!");

// Function BP_CoopParam_Shield.BP_CoopParam_Shield_C.LaunchSheep
// 0x00F0 (0x00F0 - 0x0000)
struct BP_CoopParam_Shield_C_LaunchSheep final
{
public:
	double                                        SpeedRate;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B04[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APalCharacter*                          K2Node_DynamicCast_AsPal_Character;                // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CoopParam_Shield_C_LaunchSheep) == 0x000008, "Wrong alignment on BP_CoopParam_Shield_C_LaunchSheep");
static_assert(sizeof(BP_CoopParam_Shield_C_LaunchSheep) == 0x0000F0, "Wrong size on BP_CoopParam_Shield_C_LaunchSheep");
static_assert(offsetof(BP_CoopParam_Shield_C_LaunchSheep, SpeedRate) == 0x000000, "Member 'BP_CoopParam_Shield_C_LaunchSheep::SpeedRate' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_LaunchSheep, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000008, "Member 'BP_CoopParam_Shield_C_LaunchSheep::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_LaunchSheep, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000020, "Member 'BP_CoopParam_Shield_C_LaunchSheep::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_LaunchSheep, CallFunc_MakeVector_ReturnValue) == 0x000038, "Member 'BP_CoopParam_Shield_C_LaunchSheep::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_LaunchSheep, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x000050, "Member 'BP_CoopParam_Shield_C_LaunchSheep::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_LaunchSheep, CallFunc_GetOwner_ReturnValue) == 0x000068, "Member 'BP_CoopParam_Shield_C_LaunchSheep::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_LaunchSheep, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000070, "Member 'BP_CoopParam_Shield_C_LaunchSheep::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_LaunchSheep, CallFunc_GetOwner_ReturnValue_1) == 0x000088, "Member 'BP_CoopParam_Shield_C_LaunchSheep::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_LaunchSheep, CallFunc_GetOwner_ReturnValue_2) == 0x000090, "Member 'BP_CoopParam_Shield_C_LaunchSheep::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_LaunchSheep, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x000098, "Member 'BP_CoopParam_Shield_C_LaunchSheep::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_LaunchSheep, CallFunc_BreakRotator_Roll) == 0x0000B0, "Member 'BP_CoopParam_Shield_C_LaunchSheep::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_LaunchSheep, CallFunc_BreakRotator_Pitch) == 0x0000B4, "Member 'BP_CoopParam_Shield_C_LaunchSheep::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_LaunchSheep, CallFunc_BreakRotator_Yaw) == 0x0000B8, "Member 'BP_CoopParam_Shield_C_LaunchSheep::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_LaunchSheep, CallFunc_GetOwner_ReturnValue_3) == 0x0000C0, "Member 'BP_CoopParam_Shield_C_LaunchSheep::CallFunc_GetOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_LaunchSheep, CallFunc_MakeRotator_ReturnValue) == 0x0000C8, "Member 'BP_CoopParam_Shield_C_LaunchSheep::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_LaunchSheep, K2Node_DynamicCast_AsPal_Character) == 0x0000E0, "Member 'BP_CoopParam_Shield_C_LaunchSheep::K2Node_DynamicCast_AsPal_Character' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_LaunchSheep, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'BP_CoopParam_Shield_C_LaunchSheep::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CoopParam_Shield_C_LaunchSheep, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0000E9, "Member 'BP_CoopParam_Shield_C_LaunchSheep::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");

// Function BP_CoopParam_Shield.BP_CoopParam_Shield_C.OnBlendOut_8FC8CA8643E4463FC59843B864E9D2AD
// 0x0008 (0x0008 - 0x0000)
struct BP_CoopParam_Shield_C_OnBlendOut_8FC8CA8643E4463FC59843B864E9D2AD final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CoopParam_Shield_C_OnBlendOut_8FC8CA8643E4463FC59843B864E9D2AD) == 0x000004, "Wrong alignment on BP_CoopParam_Shield_C_OnBlendOut_8FC8CA8643E4463FC59843B864E9D2AD");
static_assert(sizeof(BP_CoopParam_Shield_C_OnBlendOut_8FC8CA8643E4463FC59843B864E9D2AD) == 0x000008, "Wrong size on BP_CoopParam_Shield_C_OnBlendOut_8FC8CA8643E4463FC59843B864E9D2AD");
static_assert(offsetof(BP_CoopParam_Shield_C_OnBlendOut_8FC8CA8643E4463FC59843B864E9D2AD, NotifyName) == 0x000000, "Member 'BP_CoopParam_Shield_C_OnBlendOut_8FC8CA8643E4463FC59843B864E9D2AD::NotifyName' has a wrong offset!");

// Function BP_CoopParam_Shield.BP_CoopParam_Shield_C.OnBlendOut_E5EB2B1E4F79E35A9836F8942DE27180
// 0x0008 (0x0008 - 0x0000)
struct BP_CoopParam_Shield_C_OnBlendOut_E5EB2B1E4F79E35A9836F8942DE27180 final
{
public:
