#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InGameMenuBuildModel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Pal_structs.hpp"
#include "Pal_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InGameMenuBuildModel.BP_InGameMenuBuildModel_C
// 0x0028 (0x0050 - 0x0028)
class UBP_InGameMenuBuildModel_C final : public UPalUIInGameMainMenuBuildModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_PalUIBuildModel_C*                  BuildModel;                                        // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EPalBuildObjectTypeA                          InitialTypeA;                                      // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5369[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnUpdateInventoryDelegate;                         // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_InGameMenuBuildModel(int32 EntryPoint);
	void OnUpdateInventory(class UPalItemContainer* Container);
	void OnUpdateInventoryDelegate__DelegateSignature();
	void SetInitialTypeA(EPalBuildObjectTypeA TypeA);
	void Setup();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InGameMenuBuildModel_C">();
	}
	static class UBP_InGameMenuBuildModel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_InGameMenuBuildModel_C>();
	}
};
static_assert(alignof(UBP_InGameMenuBuildModel_C) == 0x000008, "Wrong alignment on UBP_InGameMenuBuildModel_C");
static_assert(sizeof(UBP_InGameMenuBuildModel_C) == 0x000050, "Wrong size on UBP_InGameMenuBuildModel_C");
static_assert(offsetof(UBP_InGameMenuBuildModel_C, UberGraphFrame) == 0x000028, "Member 'UBP_InGameMenuBuildModel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_InGameMenuBuildModel_C, BuildModel) == 0x000030, "Member 'UBP_InGameMenuBuildModel_C::BuildModel' has a wrong offset!");
static_assert(offsetof(UBP_InGameMenuBuildModel_C, InitialTypeA) == 0x000038, "Member 'UBP_InGameMenuBuildModel_C::InitialTypeA' has a wrong offset!");
static_assert(offsetof(UBP_InGameMenuBuildModel_C, OnUpdateInventoryDelegate) == 0x000040, "Member 'UBP_InGameMenuBuildModel_C::OnUpdateInventoryDelegate' has a wrong offset!");

}

