#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InGamePalStatusModel

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_InGamePalStatusModel.BP_InGamePalStatusModel_C.SetupForOtomo
// 0x0078 (0x0078 - 0x0000)
struct BP_InGamePalStatusModel_C_SetupForOtomo final
{
public:
	TArray<class UPalIndividualCharacterHandle*>  Handles;                                           // 0x0000(0x0010)(Edit, BlueprintVisible)
	class UBP_OtomoPalHolderComponent_C*          OtomoHolder;                                       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F76[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPalIndividualCharacterSlot*>    CallFunc_GetSlots_Slots;                           // 0x0020(0x0010)(ReferenceParm)
	class UPalIndividualCharacterSlot*            CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F77[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterHandle*          CallFunc_GetHandle_ReturnValue;                    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F78[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalOtomoHolderComponentBase*           CallFunc_GetOtomoHolderComponent_ReturnValue;      // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_OtomoPalHolderComponent_C*          K2Node_DynamicCast_AsBP_Otomo_Pal_Holder_Component; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F79[0x2];                                     // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F7A[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InGamePalStatusModel_C_SetupForOtomo) == 0x000008, "Wrong alignment on BP_InGamePalStatusModel_C_SetupForOtomo");
static_assert(sizeof(BP_InGamePalStatusModel_C_SetupForOtomo) == 0x000078, "Wrong size on BP_InGamePalStatusModel_C_SetupForOtomo");
static_assert(offsetof(BP_InGamePalStatusModel_C_SetupForOtomo, Handles) == 0x000000, "Member 'BP_InGamePalStatusModel_C_SetupForOtomo::Handles' has a wrong offset!");
static_assert(offsetof(BP_InGamePalStatusModel_C_SetupForOtomo, OtomoHolder) == 0x000010, "Member 'BP_InGamePalStatusModel_C_SetupForOtomo::OtomoHolder' has a wrong offset!");
static_assert(offsetof(BP_InGamePalStatusModel_C_SetupForOtomo, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_InGamePalStatusModel_C_SetupForOtomo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_InGamePalStatusModel_C_SetupForOtomo, CallFunc_GetSlots_Slots) == 0x000020, "Member 'BP_InGamePalStatusModel_C_SetupForOtomo::CallFunc_GetSlots_Slots' has a wrong offset!");
static_assert(offsetof(BP_InGamePalStatusModel_C_SetupForOtomo, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_InGamePalStatusModel_C_SetupForOtomo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_InGamePalStatusModel_C_SetupForOtomo, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_InGamePalStatusModel_C_SetupForOtomo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InGamePalStatusModel_C_SetupForOtomo, CallFunc_GetHandle_ReturnValue) == 0x000040, "Member 'BP_InGamePalStatusModel_C_SetupForOtomo::CallFunc_GetHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InGamePalStatusModel_C_SetupForOtomo, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_InGamePalStatusModel_C_SetupForOtomo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InGamePalStatusModel_C_SetupForOtomo, CallFunc_GetOtomoHolderComponent_ReturnValue) == 0x000050, "Member 'BP_InGamePalStatusModel_C_SetupForOtomo::CallFunc_GetOtomoHolderComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InGamePalStatusModel_C_SetupForOtomo, K2Node_DynamicCast_AsBP_Otomo_Pal_Holder_Component) == 0x000058, "Member 'BP_InGamePalStatusModel_C_SetupForOtomo::K2Node_DynamicCast_AsBP_Otomo_Pal_Holder_Component' has a wrong offset!");
static_assert(offsetof(BP_InGamePalStatusModel_C_SetupForOtomo, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BP_InGamePalStatusModel_C_SetupForOtomo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_InGamePalStatusModel_C_SetupForOtomo, CallFunc_IsValid_ReturnValue_1) == 0x000061, "Member 'BP_InGamePalStatusModel_C_SetupForOtomo::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InGamePalStatusModel_C_SetupForOtomo, Temp_int_Loop_Counter_Variable) == 0x000064, "Member 'BP_InGamePalStatusModel_C_SetupForOtomo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_InGamePalStatusModel_C_SetupForOtomo, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'BP_InGamePalStatusModel_C_SetupForOtomo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InGamePalStatusModel_C_SetupForOtomo, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'BP_InGamePalStatusModel_C_SetupForOtomo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InGamePalStatusModel_C_SetupForOtomo, CallFunc_Array_Add_ReturnValue) == 0x000070, "Member 'BP_InGamePalStatusModel_C_SetupForOtomo::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_InGamePalStatusModel.BP_InGamePalStatusModel_C.SetupSingle
// 0x0020 (0x0020 - 0x0000)
struct BP_InGamePalStatusModel_C_SetupSingle final
{
public:
	class UPalIndividualCharacterHandle*          Handle;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UPalIndividualCharacterHandle*>  Handles;                                           // 0x0008(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InGamePalStatusModel_C_SetupSingle) == 0x000008, "Wrong alignment on BP_InGamePalStatusModel_C_SetupSingle");
static_assert(sizeof(BP_InGamePalStatusModel_C_SetupSingle) == 0x000020, "Wrong size on BP_InGamePalStatusModel_C_SetupSingle");
static_assert(offsetof(BP_InGamePalStatusModel_C_SetupSingle, Handle) == 0x000000, "Member 'BP_InGamePalStatusModel_C_SetupSingle::Handle' has a wrong offset!");
static_assert(offsetof(BP_InGamePalStatusModel_C_SetupSingle, Handles) == 0x000008, "Member 'BP_InGamePalStatusModel_C_SetupSingle::Handles' has a wrong offset!");
static_assert(offsetof(BP_InGamePalStatusModel_C_SetupSingle, CallFunc_Array_Add_ReturnValue) == 0x000018, "Member 'BP_InGamePalStatusModel_C_SetupSingle::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

}

