#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MapObject_TreasureBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Pal_structs.hpp"
#include "Pal_classes.hpp"
#include "EPalTreasureBoxVisualType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MapObject_TreasureBox.BP_MapObject_TreasureBox_C
// 0x0070 (0x0450 - 0x03E0)
class ABP_MapObject_TreasureBox_C final : public APalMapObjectTreasureBox
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   VisualActor;                                       // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPalInteractableSphereComponentNative*  BP_InteractableSphere;                             // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        IndicatorOrigin;                                   // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMap<EPalMapObjectTreasureGradeType, class UClass*> VisualMap;                                         // 0x0400(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BP_OnSetConcreteModel(class UPalMapObjectConcreteModelBase* ConcreteModel);
	void ExecuteUbergraph_BP_MapObject_TreasureBox(int32 EntryPoint);
	void OnFinishOpenVisual();
	void OnNotifiedStartOpen();
	void ReceiveBeginPlay();
	void SetupVisual(class UPalMapObjectConcreteModelBase* ConcreteModel);
	void TriggerOpen();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MapObject_TreasureBox_C">();
	}
	static class ABP_MapObject_TreasureBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MapObject_TreasureBox_C>();
	}
};
static_assert(alignof(ABP_MapObject_TreasureBox_C) == 0x000008, "Wrong alignment on ABP_MapObject_TreasureBox_C");
static_assert(sizeof(ABP_MapObject_TreasureBox_C) == 0x000450, "Wrong size on ABP_MapObject_TreasureBox_C");
static_assert(offsetof(ABP_MapObject_TreasureBox_C, UberGraphFrame) == 0x0003E0, "Member 'ABP_MapObject_TreasureBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MapObject_TreasureBox_C, VisualActor) == 0x0003E8, "Member 'ABP_MapObject_TreasureBox_C::VisualActor' has a wrong offset!");
static_assert(offsetof(ABP_MapObject_TreasureBox_C, BP_InteractableSphere) == 0x0003F0, "Member 'ABP_MapObject_TreasureBox_C::BP_InteractableSphere' has a wrong offset!");
static_assert(offsetof(ABP_MapObject_TreasureBox_C, IndicatorOrigin) == 0x0003F8, "Member 'ABP_MapObject_TreasureBox_C::IndicatorOrigin' has a wrong offset!");
static_assert(offsetof(ABP_MapObject_TreasureBox_C, VisualMap) == 0x000400, "Member 'ABP_MapObject_TreasureBox_C::VisualMap' has a wrong offset!");

}

