#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MapObject_PickupItem_SmallStone

#include "Basic.hpp"

#include "BP_MapObject_PickupItem_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MapObject_PickupItem_SmallStone.BP_MapObject_PickupItem_SmallStone_C
// 0x0018 (0x03F8 - 0x03E0)
class ABP_MapObject_PickupItem_SmallStone_C final : public ABP_MapObject_PickupItem_Base_C
{
public:
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        IndicatorOrigin;                                   // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPalMapObjectPickupItemParameterComponent* PalMapObjectPickupItemParameter;                   // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MapObject_PickupItem_SmallStone_C">();
	}
	static class ABP_MapObject_PickupItem_SmallStone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MapObject_PickupItem_SmallStone_C>();
	}
};
static_assert(alignof(ABP_MapObject_PickupItem_SmallStone_C) == 0x000008, "Wrong alignment on ABP_MapObject_PickupItem_SmallStone_C");
static_assert(sizeof(ABP_MapObject_PickupItem_SmallStone_C) == 0x0003F8, "Wrong size on ABP_MapObject_PickupItem_SmallStone_C");
static_assert(offsetof(ABP_MapObject_PickupItem_SmallStone_C, StaticMesh1) == 0x0003E0, "Member 'ABP_MapObject_PickupItem_SmallStone_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ABP_MapObject_PickupItem_SmallStone_C, IndicatorOrigin) == 0x0003E8, "Member 'ABP_MapObject_PickupItem_SmallStone_C::IndicatorOrigin' has a wrong offset!");
static_assert(offsetof(ABP_MapObject_PickupItem_SmallStone_C, PalMapObjectPickupItemParameter) == 0x0003F0, "Member 'ABP_MapObject_PickupItem_SmallStone_C::PalMapObjectPickupItemParameter' has a wrong offset!");

}

