#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_pal_b00_Lordenfel_Gate_02

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_pal_b00_Lordenfel_Gate_02.BP_pal_b00_Lordenfel_Gate_02_C
// 0x0098 (0x0328 - 0x0290)
class ABP_pal_b00_Lordenfel_Gate_02_C final : public AActor
{
public:
	class UStaticMeshComponent*                   StaticMeshComponent13;                             // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent12;                             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent9;                              // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent8;                              // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent7;                              // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent6;                              // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent5;                              // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent4;                              // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent3;                              // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent2;                              // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent1;                              // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Wooden_Door_02_L1;                              // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Wooden_Door_02_R1;                              // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot2;                                 // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Wooden_Door_02_L;                               // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Wooden_Door_02_R;                               // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot1;                                 // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent0;                              // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_pal_b00_Lordenfel_Gate_02_C">();
	}
	static class ABP_pal_b00_Lordenfel_Gate_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_pal_b00_Lordenfel_Gate_02_C>();
	}
};
static_assert(alignof(ABP_pal_b00_Lordenfel_Gate_02_C) == 0x000008, "Wrong alignment on ABP_pal_b00_Lordenfel_Gate_02_C");
static_assert(sizeof(ABP_pal_b00_Lordenfel_Gate_02_C) == 0x000328, "Wrong size on ABP_pal_b00_Lordenfel_Gate_02_C");
static_assert(offsetof(ABP_pal_b00_Lordenfel_Gate_02_C, StaticMeshComponent13) == 0x000290, "Member 'ABP_pal_b00_Lordenfel_Gate_02_C::StaticMeshComponent13' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_Lordenfel_Gate_02_C, StaticMeshComponent12) == 0x000298, "Member 'ABP_pal_b00_Lordenfel_Gate_02_C::StaticMeshComponent12' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_Lordenfel_Gate_02_C, StaticMeshComponent9) == 0x0002A0, "Member 'ABP_pal_b00_Lordenfel_Gate_02_C::StaticMeshComponent9' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_Lordenfel_Gate_02_C, StaticMeshComponent8) == 0x0002A8, "Member 'ABP_pal_b00_Lordenfel_Gate_02_C::StaticMeshComponent8' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_Lordenfel_Gate_02_C, StaticMeshComponent7) == 0x0002B0, "Member 'ABP_pal_b00_Lordenfel_Gate_02_C::StaticMeshComponent7' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_Lordenfel_Gate_02_C, StaticMeshComponent6) == 0x0002B8, "Member 'ABP_pal_b00_Lordenfel_Gate_02_C::StaticMeshComponent6' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_Lordenfel_Gate_02_C, StaticMeshComponent5) == 0x0002C0, "Member 'ABP_pal_b00_Lordenfel_Gate_02_C::StaticMeshComponent5' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_Lordenfel_Gate_02_C, StaticMeshComponent4) == 0x0002C8, "Member 'ABP_pal_b00_Lordenfel_Gate_02_C::StaticMeshComponent4' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_Lordenfel_Gate_02_C, StaticMeshComponent3) == 0x0002D0, "Member 'ABP_pal_b00_Lordenfel_Gate_02_C::StaticMeshComponent3' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_Lordenfel_Gate_02_C, StaticMeshComponent2) == 0x0002D8, "Member 'ABP_pal_b00_Lordenfel_Gate_02_C::StaticMeshComponent2' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_Lordenfel_Gate_02_C, StaticMeshComponent1) == 0x0002E0, "Member 'ABP_pal_b00_Lordenfel_Gate_02_C::StaticMeshComponent1' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_Lordenfel_Gate_02_C, SM_Wooden_Door_02_L1) == 0x0002E8, "Member 'ABP_pal_b00_Lordenfel_Gate_02_C::SM_Wooden_Door_02_L1' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_Lordenfel_Gate_02_C, SM_Wooden_Door_02_R1) == 0x0002F0, "Member 'ABP_pal_b00_Lordenfel_Gate_02_C::SM_Wooden_Door_02_R1' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_Lordenfel_Gate_02_C, DefaultSceneRoot2) == 0x0002F8, "Member 'ABP_pal_b00_Lordenfel_Gate_02_C::DefaultSceneRoot2' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_Lordenfel_Gate_02_C, SM_Wooden_Door_02_L) == 0x000300, "Member 'ABP_pal_b00_Lordenfel_Gate_02_C::SM_Wooden_Door_02_L' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_Lordenfel_Gate_02_C, SM_Wooden_Door_02_R) == 0x000308, "Member 'ABP_pal_b00_Lordenfel_Gate_02_C::SM_Wooden_Door_02_R' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_Lordenfel_Gate_02_C, DefaultSceneRoot1) == 0x000310, "Member 'ABP_pal_b00_Lordenfel_Gate_02_C::DefaultSceneRoot1' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_Lordenfel_Gate_02_C, StaticMeshComponent0) == 0x000318, "Member 'ABP_pal_b00_Lordenfel_Gate_02_C::StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_Lordenfel_Gate_02_C, DefaultSceneRoot) == 0x000320, "Member 'ABP_pal_b00_Lordenfel_Gate_02_C::DefaultSceneRoot' has a wrong offset!");

}

