#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PalQuestBlock_TutorialUnlockFastTravel

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_PalQuestBlock_TutorialUnlockFastTravel.BP_PalQuestBlock_TutorialUnlockFastTravel_C.GetDescriptionText
// 0x0040 (0x0040 - 0x0000)
struct BP_PalQuestBlock_TutorialUnlockFastTravel_C_GetDescriptionText final
{
public:
	class FText                                   OutText;                                           // 0x0000(0x0018)(Parm, OutParm)
	struct FDataTableRowHandle                    NewLocalVar;                                       // 0x0018(0x0010)(Edit, BlueprintVisible, NoDestructor)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text;          // 0x0028(0x0018)()
};
static_assert(alignof(BP_PalQuestBlock_TutorialUnlockFastTravel_C_GetDescriptionText) == 0x000008, "Wrong alignment on BP_PalQuestBlock_TutorialUnlockFastTravel_C_GetDescriptionText");
static_assert(sizeof(BP_PalQuestBlock_TutorialUnlockFastTravel_C_GetDescriptionText) == 0x000040, "Wrong size on BP_PalQuestBlock_TutorialUnlockFastTravel_C_GetDescriptionText");
static_assert(offsetof(BP_PalQuestBlock_TutorialUnlockFastTravel_C_GetDescriptionText, OutText) == 0x000000, "Member 'BP_PalQuestBlock_TutorialUnlockFastTravel_C_GetDescriptionText::OutText' has a wrong offset!");
static_assert(offsetof(BP_PalQuestBlock_TutorialUnlockFastTravel_C_GetDescriptionText, NewLocalVar) == 0x000018, "Member 'BP_PalQuestBlock_TutorialUnlockFastTravel_C_GetDescriptionText::NewLocalVar' has a wrong offset!");
static_assert(offsetof(BP_PalQuestBlock_TutorialUnlockFastTravel_C_GetDescriptionText, CallFunc_GetLocalizedTextFromHandle_Text) == 0x000028, "Member 'BP_PalQuestBlock_TutorialUnlockFastTravel_C_GetDescriptionText::CallFunc_GetLocalizedTextFromHandle_Text' has a wrong offset!");

}

