#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PalUIDismantlingModel

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PalUIDismantlingModel.BP_PalUIDismantlingModel_C.OnUpdateInventory
// 0x0008 (0x0008 - 0x0000)
struct BP_PalUIDismantlingModel_C_OnUpdateInventory final
{
public:
	class UPalItemContainer*                      Container;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PalUIDismantlingModel_C_OnUpdateInventory) == 0x000008, "Wrong alignment on BP_PalUIDismantlingModel_C_OnUpdateInventory");
static_assert(sizeof(BP_PalUIDismantlingModel_C_OnUpdateInventory) == 0x000008, "Wrong size on BP_PalUIDismantlingModel_C_OnUpdateInventory");
static_assert(offsetof(BP_PalUIDismantlingModel_C_OnUpdateInventory, Container) == 0x000000, "Member 'BP_PalUIDismantlingModel_C_OnUpdateInventory::Container' has a wrong offset!");

// Function BP_PalUIDismantlingModel.BP_PalUIDismantlingModel_C.ExecuteUbergraph_BP_PalUIDismantlingModel
// 0x0010 (0x0010 - 0x0000)
struct BP_PalUIDismantlingModel_C_ExecuteUbergraph_BP_PalUIDismantlingModel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D2[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalItemContainer*                      K2Node_Event_Container;                            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PalUIDismantlingModel_C_ExecuteUbergraph_BP_PalUIDismantlingModel) == 0x000008, "Wrong alignment on BP_PalUIDismantlingModel_C_ExecuteUbergraph_BP_PalUIDismantlingModel");
static_assert(sizeof(BP_PalUIDismantlingModel_C_ExecuteUbergraph_BP_PalUIDismantlingModel) == 0x000010, "Wrong size on BP_PalUIDismantlingModel_C_ExecuteUbergraph_BP_PalUIDismantlingModel");
static_assert(offsetof(BP_PalUIDismantlingModel_C_ExecuteUbergraph_BP_PalUIDismantlingModel, EntryPoint) == 0x000000, "Member 'BP_PalUIDismantlingModel_C_ExecuteUbergraph_BP_PalUIDismantlingModel::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PalUIDismantlingModel_C_ExecuteUbergraph_BP_PalUIDismantlingModel, K2Node_Event_Container) == 0x000008, "Member 'BP_PalUIDismantlingModel_C_ExecuteUbergraph_BP_PalUIDismantlingModel::K2Node_Event_Container' has a wrong offset!");

}

