#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PalQuestBlock_TutorialPickupItem

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_PalQuestBlock_TutorialPickupItem.BP_PalQuestBlock_TutorialPickupItem_C.GetDescriptionText
// 0x00D8 (0x00D8 - 0x0000)
struct BP_PalQuestBlock_TutorialPickupItem_C_GetDescriptionText final
{
public:
	class FText                                   OutText;                                           // 0x0000(0x0018)(Parm, OutParm)
	struct FDataTableRowHandle                    NewLocalVar;                                       // 0x0018(0x0010)(Edit, BlueprintVisible, NoDestructor)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetItemName_outName;                      // 0x0030(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text;          // 0x0098(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C0(0x0018)()
};
static_assert(alignof(BP_PalQuestBlock_TutorialPickupItem_C_GetDescriptionText) == 0x000008, "Wrong alignment on BP_PalQuestBlock_TutorialPickupItem_C_GetDescriptionText");
static_assert(sizeof(BP_PalQuestBlock_TutorialPickupItem_C_GetDescriptionText) == 0x0000D8, "Wrong size on BP_PalQuestBlock_TutorialPickupItem_C_GetDescriptionText");
static_assert(offsetof(BP_PalQuestBlock_TutorialPickupItem_C_GetDescriptionText, OutText) == 0x000000, "Member 'BP_PalQuestBlock_TutorialPickupItem_C_GetDescriptionText::OutText' has a wrong offset!");
static_assert(offsetof(BP_PalQuestBlock_TutorialPickupItem_C_GetDescriptionText, NewLocalVar) == 0x000018, "Member 'BP_PalQuestBlock_TutorialPickupItem_C_GetDescriptionText::NewLocalVar' has a wrong offset!");
static_assert(offsetof(BP_PalQuestBlock_TutorialPickupItem_C_GetDescriptionText, CallFunc_Conv_StringToName_ReturnValue) == 0x000028, "Member 'BP_PalQuestBlock_TutorialPickupItem_C_GetDescriptionText::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PalQuestBlock_TutorialPickupItem_C_GetDescriptionText, CallFunc_GetItemName_outName) == 0x000030, "Member 'BP_PalQuestBlock_TutorialPickupItem_C_GetDescriptionText::CallFunc_GetItemName_outName' has a wrong offset!");
static_assert(offsetof(BP_PalQuestBlock_TutorialPickupItem_C_GetDescriptionText, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'BP_PalQuestBlock_TutorialPickupItem_C_GetDescriptionText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_PalQuestBlock_TutorialPickupItem_C_GetDescriptionText, CallFunc_GetLocalizedTextFromHandle_Text) == 0x000098, "Member 'BP_PalQuestBlock_TutorialPickupItem_C_GetDescriptionText::CallFunc_GetLocalizedTextFromHandle_Text' has a wrong offset!");
static_assert(offsetof(BP_PalQuestBlock_TutorialPickupItem_C_GetDescriptionText, K2Node_MakeArray_Array) == 0x0000B0, "Member 'BP_PalQuestBlock_TutorialPickupItem_C_GetDescriptionText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_PalQuestBlock_TutorialPickupItem_C_GetDescriptionText, CallFunc_Format_ReturnValue) == 0x0000C0, "Member 'BP_PalQuestBlock_TutorialPickupItem_C_GetDescriptionText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_PalQuestBlock_TutorialPickupItem.BP_PalQuestBlock_TutorialPickupItem_C.GetProgressText
// 0x00F0 (0x00F0 - 0x0000)
struct BP_PalQuestBlock_TutorialPickupItem_C_GetProgressText final
{
public:
	class FText                                   OutText;                                           // 0x0000(0x0018)(Parm, OutParm)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0078(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D8(0x0018)()
};
static_assert(alignof(BP_PalQuestBlock_TutorialPickupItem_C_GetProgressText) == 0x000008, "Wrong alignment on BP_PalQuestBlock_TutorialPickupItem_C_GetProgressText");
static_assert(sizeof(BP_PalQuestBlock_TutorialPickupItem_C_GetProgressText) == 0x0000F0, "Wrong size on BP_PalQuestBlock_TutorialPickupItem_C_GetProgressText");
static_assert(offsetof(BP_PalQuestBlock_TutorialPickupItem_C_GetProgressText, OutText) == 0x000000, "Member 'BP_PalQuestBlock_TutorialPickupItem_C_GetProgressText::OutText' has a wrong offset!");
static_assert(offsetof(BP_PalQuestBlock_TutorialPickupItem_C_GetProgressText, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000018, "Member 'BP_PalQuestBlock_TutorialPickupItem_C_GetProgressText::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PalQuestBlock_TutorialPickupItem_C_GetProgressText, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000020, "Member 'BP_PalQuestBlock_TutorialPickupItem_C_GetProgressText::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PalQuestBlock_TutorialPickupItem_C_GetProgressText, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'BP_PalQuestBlock_TutorialPickupItem_C_GetProgressText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_PalQuestBlock_TutorialPickupItem_C_GetProgressText, K2Node_MakeStruct_FormatArgumentData_1) == 0x000078, "Member 'BP_PalQuestBlock_TutorialPickupItem_C_GetProgressText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_PalQuestBlock_TutorialPickupItem_C_GetProgressText, K2Node_MakeArray_Array) == 0x0000C8, "Member 'BP_PalQuestBlock_TutorialPickupItem_C_GetProgressText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_PalQuestBlock_TutorialPickupItem_C_GetProgressText, CallFunc_Format_ReturnValue) == 0x0000D8, "Member 'BP_PalQuestBlock_TutorialPickupItem_C_GetProgressText::CallFunc_Format_ReturnValue' has a wrong offset!");

}

