#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RocketLauncher

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AssaultRifleBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RocketLauncher.BP_RocketLauncher_C
// 0x0028 (0x05A0 - 0x0578)
class ABP_RocketLauncher_C : public ABP_AssaultRifleBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_RocketLauncher_C;                // 0x0578(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Sphere;                                            // 0x0580(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_Ammo_Rocket;                                    // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               RocketMask;                                        // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ChangeTransformForRocketReload(const struct FVector& Location, const struct FRotator& Rotation);
	void ChangeTransformForRocketWhenReloadIsDone(const struct FVector& Location, const struct FRotator& Lotation);
	void ExecuteUbergraph_BP_RocketLauncher(int32 EntryPoint);
	void Get_Right_Hand_Location(struct FVector* RightHandLocation);
	void GetAimingBlurAngle(double* Angle);
	void GetBlurAngle(double* Angle);
	void GetBulletClass(class UClass** NewParam);
	void IsUseRightHandAttach(bool* IsUse);
	void OnEndShootAnimation(class UAnimMontage* Montage);
	void OnReload(int32 bulletsNum);
	void PlayFireSound();
	void PlayReloadSound();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void StopReloadSound();
	void GetInitializeInterval(double* Time);
	void GetMuzzleEffect(class UNiagaraSystem** NewParam);
	void GetMuzzleLocation(struct FVector* MuzzleLocation);
	void GetMuzzleRotator(struct FRotator* Rotator);
	void GetShootInterval(double* Time);
	void OnAttachWeapon(class AActor* AttachActor);
	void OnDetachWeapon(class AActor* DetachActor);
	void OnPullTrigger();
	void OnReloadStart();
	void OnShoot();
	void ShootBullet();

	struct FTransform GetLeftHandTransform() const;
	bool IsUseLeftHandAttach() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RocketLauncher_C">();
	}
	static class ABP_RocketLauncher_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RocketLauncher_C>();
	}
};
static_assert(alignof(ABP_RocketLauncher_C) == 0x000008, "Wrong alignment on ABP_RocketLauncher_C");
static_assert(sizeof(ABP_RocketLauncher_C) == 0x0005A0, "Wrong size on ABP_RocketLauncher_C");
static_assert(offsetof(ABP_RocketLauncher_C, UberGraphFrame_BP_RocketLauncher_C) == 0x000578, "Member 'ABP_RocketLauncher_C::UberGraphFrame_BP_RocketLauncher_C' has a wrong offset!");
static_assert(offsetof(ABP_RocketLauncher_C, Sphere) == 0x000580, "Member 'ABP_RocketLauncher_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_RocketLauncher_C, BP_Ammo_Rocket) == 0x000588, "Member 'ABP_RocketLauncher_C::BP_Ammo_Rocket' has a wrong offset!");
static_assert(offsetof(ABP_RocketLauncher_C, SkeletalMesh) == 0x000590, "Member 'ABP_RocketLauncher_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_RocketLauncher_C, RocketMask) == 0x000598, "Member 'ABP_RocketLauncher_C::RocketMask' has a wrong offset!");

}

