#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkyCreatorNoShadowLight

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_SkyCreatorNoShadowLight.BP_SkyCreatorNoShadowLight_C.ExecuteUbergraph_BP_SkyCreatorNoShadowLight
// 0x0350 (0x0350 - 0x0000)
struct BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52CC[0xC];                                     // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52CD[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x00C0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52CE[0x7];                                     // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x01B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult_1;    // 0x0228(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0310(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast;   // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast_1; // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight) == 0x000010, "Wrong alignment on BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight");
static_assert(sizeof(BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight) == 0x000350, "Wrong size on BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight");
static_assert(offsetof(BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight, EntryPoint) == 0x000000, "Member 'BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000010, "Member 'BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000070, "Member 'BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight, K2Node_Event_DeltaSeconds) == 0x000088, "Member 'BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight, CallFunc_GetForwardVector_ReturnValue) == 0x000090, "Member 'BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight, CallFunc_Dot_VectorVector_ReturnValue) == 0x0000A8, "Member 'BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight, CallFunc_FClamp_ReturnValue) == 0x0000B0, "Member 'BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000B8, "Member 'BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x0000C0, "Member 'BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight, CallFunc_IsValid_ReturnValue) == 0x0001A8, "Member 'BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x0001B0, "Member 'BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight, CallFunc_K2_GetComponentRotation_ReturnValue_1) == 0x000210, "Member 'BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight::CallFunc_K2_GetComponentRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight, CallFunc_K2_SetWorldTransform_SweepHitResult_1) == 0x000228, "Member 'BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight::CallFunc_K2_SetWorldTransform_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight, CallFunc_GetForwardVector_ReturnValue_1) == 0x000310, "Member 'BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight, CallFunc_Dot_VectorVector_ReturnValue_1) == 0x000328, "Member 'BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight::CallFunc_Dot_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight, CallFunc_FClamp_ReturnValue_1) == 0x000330, "Member 'BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000338, "Member 'BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight, CallFunc_SetIntensity_NewIntensity_ImplicitCast) == 0x000340, "Member 'BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight::CallFunc_SetIntensity_NewIntensity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight, CallFunc_SetIntensity_NewIntensity_ImplicitCast_1) == 0x000344, "Member 'BP_SkyCreatorNoShadowLight_C_ExecuteUbergraph_BP_SkyCreatorNoShadowLight::CallFunc_SetIntensity_NewIntensity_ImplicitCast_1' has a wrong offset!");

// Function BP_SkyCreatorNoShadowLight.BP_SkyCreatorNoShadowLight_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SkyCreatorNoShadowLight_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkyCreatorNoShadowLight_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_SkyCreatorNoShadowLight_C_ReceiveTick");
static_assert(sizeof(BP_SkyCreatorNoShadowLight_C_ReceiveTick) == 0x000004, "Wrong size on BP_SkyCreatorNoShadowLight_C_ReceiveTick");
static_assert(offsetof(BP_SkyCreatorNoShadowLight_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_SkyCreatorNoShadowLight_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

