#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ShotgunBullet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ShotgunBullet.BP_ShotgunBullet_C.ExecuteUbergraph_BP_ShotgunBullet
// 0x0258 (0x0258 - 0x0000)
struct BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B4E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_HitComp;                              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherCharacter;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0020(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RotatorFromAxisAndAngle_ReturnValue;      // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B4F[0x2];                                     // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B50[0x4];                                     // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B51[0x4];                                     // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B52[0x7];                                     // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddUniqueHitActor_IsNew;                  // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet) == 0x000008, "Wrong alignment on BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet");
static_assert(sizeof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet) == 0x000258, "Wrong size on BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, EntryPoint) == 0x000000, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, K2Node_Event_HitComp) == 0x000008, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::K2Node_Event_HitComp' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, K2Node_Event_OtherCharacter) == 0x000010, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::K2Node_Event_OtherCharacter' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, K2Node_Event_OtherComp) == 0x000018, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, K2Node_Event_Hit) == 0x000020, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, CallFunc_GetActorUpVector_ReturnValue) == 0x000108, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, CallFunc_RotatorFromAxisAndAngle_ReturnValue) == 0x000120, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::CallFunc_RotatorFromAxisAndAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, CallFunc_BreakHitResult_bBlockingHit) == 0x000138, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, CallFunc_BreakHitResult_bInitialOverlap) == 0x000139, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, CallFunc_BreakHitResult_Time) == 0x00013C, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, CallFunc_BreakHitResult_Distance) == 0x000140, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, CallFunc_BreakHitResult_Location) == 0x000148, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, CallFunc_BreakHitResult_ImpactPoint) == 0x000160, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, CallFunc_BreakHitResult_Normal) == 0x000178, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, CallFunc_BreakHitResult_ImpactNormal) == 0x000190, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, CallFunc_BreakHitResult_PhysMat) == 0x0001A8, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, CallFunc_BreakHitResult_HitActor) == 0x0001B0, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, CallFunc_BreakHitResult_HitComponent) == 0x0001B8, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, CallFunc_BreakHitResult_HitBoneName) == 0x0001C0, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, CallFunc_BreakHitResult_BoneName) == 0x0001C8, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, CallFunc_BreakHitResult_HitItem) == 0x0001D0, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, CallFunc_BreakHitResult_ElementIndex) == 0x0001D4, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, CallFunc_BreakHitResult_FaceIndex) == 0x0001D8, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, CallFunc_BreakHitResult_TraceStart) == 0x0001E0, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, CallFunc_BreakHitResult_TraceEnd) == 0x0001F8, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000210, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, CallFunc_IsValid_ReturnValue) == 0x000228, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, CallFunc_ComposeRotators_ReturnValue) == 0x000230, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000248, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, CallFunc_IsValid_ReturnValue_1) == 0x000250, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet, CallFunc_AddUniqueHitActor_IsNew) == 0x000251, "Member 'BP_ShotgunBullet_C_ExecuteUbergraph_BP_ShotgunBullet::CallFunc_AddUniqueHitActor_IsNew' has a wrong offset!");

// Function BP_ShotgunBullet.BP_ShotgunBullet_C.OnDestroy
// 0x0100 (0x0100 - 0x0000)
struct BP_ShotgunBullet_C_OnDestroy final
{
public:
	class UPrimitiveComponent*                    HitComp;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherCharacter;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0018(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ShotgunBullet_C_OnDestroy) == 0x000008, "Wrong alignment on BP_ShotgunBullet_C_OnDestroy");
static_assert(sizeof(BP_ShotgunBullet_C_OnDestroy) == 0x000100, "Wrong size on BP_ShotgunBullet_C_OnDestroy");
static_assert(offsetof(BP_ShotgunBullet_C_OnDestroy, HitComp) == 0x000000, "Member 'BP_ShotgunBullet_C_OnDestroy::HitComp' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_OnDestroy, OtherCharacter) == 0x000008, "Member 'BP_ShotgunBullet_C_OnDestroy::OtherCharacter' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_OnDestroy, OtherComp) == 0x000010, "Member 'BP_ShotgunBullet_C_OnDestroy::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ShotgunBullet_C_OnDestroy, Hit) == 0x000018, "Member 'BP_ShotgunBullet_C_OnDestroy::Hit' has a wrong offset!");

}

