#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkillEffect_Unique_SheepBall_Roll

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_SkillEffectBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SkillEffect_Unique_SheepBall_Roll.BP_SkillEffect_Unique_SheepBall_Roll_C
// 0x0090 (0x0450 - 0x03C0)
class ABP_SkillEffect_Unique_SheepBall_Roll_C final : public ABP_SkillEffectBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_SkillEffect_Unique_SheepBall_Roll_C; // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       SphereCollision;                                   // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      DustEffect;                                        // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      RollEffect;                                        // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnHitAttack_Roll;                                  // 0x03E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMap<class FName, class UNiagaraComponent*>   SkillEffectMap;                                    // 0x03F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	double                                        RollEffectOffsetYaw;                               // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OwnerHeight;                                       // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActivateEffect(class FName EffectName);
	void ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll(int32 EntryPoint);
	void FadeOutEffect(double DeltaSecond);
	void GetRollEffectLocation(struct FVector* Location);
	void HitAttack(class AActor* Defencer, const struct FPalDamageInfo& DamageInfo, int32 HitCount, class UPrimitiveComponent* AttackerComponent);
	void InitializeEffects();
	void OnHitAttack_Roll__DelegateSignature();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void SetOwnerCapsuleHeight(double Height);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SkillEffect_Unique_SheepBall_Roll_C">();
	}
	static class ABP_SkillEffect_Unique_SheepBall_Roll_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SkillEffect_Unique_SheepBall_Roll_C>();
	}
};
static_assert(alignof(ABP_SkillEffect_Unique_SheepBall_Roll_C) == 0x000008, "Wrong alignment on ABP_SkillEffect_Unique_SheepBall_Roll_C");
static_assert(sizeof(ABP_SkillEffect_Unique_SheepBall_Roll_C) == 0x000450, "Wrong size on ABP_SkillEffect_Unique_SheepBall_Roll_C");
static_assert(offsetof(ABP_SkillEffect_Unique_SheepBall_Roll_C, UberGraphFrame_BP_SkillEffect_Unique_SheepBall_Roll_C) == 0x0003C0, "Member 'ABP_SkillEffect_Unique_SheepBall_Roll_C::UberGraphFrame_BP_SkillEffect_Unique_SheepBall_Roll_C' has a wrong offset!");
static_assert(offsetof(ABP_SkillEffect_Unique_SheepBall_Roll_C, SphereCollision) == 0x0003C8, "Member 'ABP_SkillEffect_Unique_SheepBall_Roll_C::SphereCollision' has a wrong offset!");
static_assert(offsetof(ABP_SkillEffect_Unique_SheepBall_Roll_C, DustEffect) == 0x0003D0, "Member 'ABP_SkillEffect_Unique_SheepBall_Roll_C::DustEffect' has a wrong offset!");
static_assert(offsetof(ABP_SkillEffect_Unique_SheepBall_Roll_C, RollEffect) == 0x0003D8, "Member 'ABP_SkillEffect_Unique_SheepBall_Roll_C::RollEffect' has a wrong offset!");
static_assert(offsetof(ABP_SkillEffect_Unique_SheepBall_Roll_C, OnHitAttack_Roll) == 0x0003E0, "Member 'ABP_SkillEffect_Unique_SheepBall_Roll_C::OnHitAttack_Roll' has a wrong offset!");
static_assert(offsetof(ABP_SkillEffect_Unique_SheepBall_Roll_C, SkillEffectMap) == 0x0003F0, "Member 'ABP_SkillEffect_Unique_SheepBall_Roll_C::SkillEffectMap' has a wrong offset!");
static_assert(offsetof(ABP_SkillEffect_Unique_SheepBall_Roll_C, RollEffectOffsetYaw) == 0x000440, "Member 'ABP_SkillEffect_Unique_SheepBall_Roll_C::RollEffectOffsetYaw' has a wrong offset!");
static_assert(offsetof(ABP_SkillEffect_Unique_SheepBall_Roll_C, OwnerHeight) == 0x000448, "Member 'ABP_SkillEffect_Unique_SheepBall_Roll_C::OwnerHeight' has a wrong offset!");

}

