#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ShotgunBullet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AttackBulletBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ShotgunBullet.BP_ShotgunBullet_C
// 0x0018 (0x0388 - 0x0370)
class ABP_ShotgunBullet_C final : public ABP_AttackBulletBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_ShotgunBullet_C;                 // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_HitTargetHolder_C*                  HitHolder;                                         // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ShotgunBullet(int32 EntryPoint);
	void OnDestroy(class UPrimitiveComponent* HitComp, class AActor* OtherCharacter, class UPrimitiveComponent* OtherComp, const struct FHitResult& Hit);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ShotgunBullet_C">();
	}
	static class ABP_ShotgunBullet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ShotgunBullet_C>();
	}
};
static_assert(alignof(ABP_ShotgunBullet_C) == 0x000008, "Wrong alignment on ABP_ShotgunBullet_C");
static_assert(sizeof(ABP_ShotgunBullet_C) == 0x000388, "Wrong size on ABP_ShotgunBullet_C");
static_assert(offsetof(ABP_ShotgunBullet_C, UberGraphFrame_BP_ShotgunBullet_C) == 0x000370, "Member 'ABP_ShotgunBullet_C::UberGraphFrame_BP_ShotgunBullet_C' has a wrong offset!");
static_assert(offsetof(ABP_ShotgunBullet_C, StaticMesh) == 0x000378, "Member 'ABP_ShotgunBullet_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_ShotgunBullet_C, HitHolder) == 0x000380, "Member 'ABP_ShotgunBullet_C::HitHolder' has a wrong offset!");

}

