#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkillEffect_Unique_SheepBall_Roll

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Pal_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_SkillEffect_Unique_SheepBall_Roll.BP_SkillEffect_Unique_SheepBall_Roll_C.ActivateEffect
// 0x0040 (0x0040 - 0x0000)
struct BP_SkillEffect_Unique_SheepBall_Roll_C_ActivateEffect final
{
public:
	class FName                                   EffectName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_Map_Find_Value;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B15[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_Unique_SheepBall_Roll_C_ActivateEffect) == 0x000008, "Wrong alignment on BP_SkillEffect_Unique_SheepBall_Roll_C_ActivateEffect");
static_assert(sizeof(BP_SkillEffect_Unique_SheepBall_Roll_C_ActivateEffect) == 0x000040, "Wrong size on BP_SkillEffect_Unique_SheepBall_Roll_C_ActivateEffect");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ActivateEffect, EffectName) == 0x000000, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ActivateEffect::EffectName' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ActivateEffect, CallFunc_Conv_NameToString_ReturnValue) == 0x000008, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ActivateEffect::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ActivateEffect, CallFunc_Map_Find_Value) == 0x000018, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ActivateEffect::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ActivateEffect, CallFunc_Map_Find_ReturnValue) == 0x000020, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ActivateEffect::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ActivateEffect, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ActivateEffect::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ActivateEffect, CallFunc_IsActive_ReturnValue) == 0x000038, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ActivateEffect::CallFunc_IsActive_ReturnValue' has a wrong offset!");

// Function BP_SkillEffect_Unique_SheepBall_Roll.BP_SkillEffect_Unique_SheepBall_Roll_C.ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll
// 0x03A8 (0x03A8 - 0x0000)
struct BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1; // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B16[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_2; // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B17[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B18[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B19[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_ReturnValue_1;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_3; // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B1A[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_2;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_2;              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B1B[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B1C[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_3;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_3;               // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B1D[0x6];                                     // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_3;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_3;                     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_3;                // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_3;              // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B1E[0x4];                                     // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_4; // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B1F[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_4;      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_4;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_4;                     // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Defencer, const struct FPalDamageInfo& DamageInfo, int32 HitCount, class UPrimitiveComponent* AttackerComponent)> K2Node_CreateDelegate_OutputDelegate;              // 0x0110(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_4;              // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B20[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_4;                // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_4;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_4;               // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B21[0x6];                                     // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_DeltaSecond;                          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetActionTargetActor_ReturnValue;         // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B22[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Defencer;                       // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalDamageInfo                         K2Node_CustomEvent_DamageInfo;                     // 0x0160(0x00D0)()
	int32                                         K2Node_CustomEvent_HitCount;                       // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B23[0x4];                                     // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_AttackerComponent;              // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_5;               // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B24[0x6];                                     // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetRollEffectLocation_Location;           // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_5;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B25[0x7];                                     // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0268(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B26[0x4];                                     // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast_1;      // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_1;  // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast_2;      // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2;   // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_2;  // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast_3;      // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_3;   // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_3;  // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast_4;      // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_4;   // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_4;  // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll) == 0x000008, "Wrong alignment on BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll");
static_assert(sizeof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll) == 0x0003A8, "Wrong size on BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, EntryPoint) == 0x000000, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000004, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1) == 0x000005, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, Temp_bool_Has_Been_Initd_Variable) == 0x000006, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, Temp_bool_IsClosed_Variable) == 0x000007, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, Temp_bool_IsClosed_Variable_1) == 0x000008, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_FClamp_ReturnValue) == 0x000020, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_GetFloatValue_ReturnValue) == 0x000028, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_2) == 0x00002C, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_SelectFloat_ReturnValue) == 0x000030, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000038, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, Temp_bool_Has_Been_Initd_Variable_1) == 0x000040, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000048, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000050, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_SelectFloat_ReturnValue_1) == 0x000058, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_FClamp_ReturnValue_1) == 0x000060, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, Temp_bool_Has_Been_Initd_Variable_2) == 0x000068, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_GetFloatValue_ReturnValue_1) == 0x00006C, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_GetFloatValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000070, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_3) == 0x000078, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x000080, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x000088, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_FClamp_ReturnValue_2) == 0x000090, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_GetFloatValue_ReturnValue_2) == 0x000098, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_GetFloatValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_SelectFloat_ReturnValue_2) == 0x0000A0, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, Temp_bool_IsClosed_Variable_2) == 0x0000A8, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0000B0, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, Temp_bool_IsClosed_Variable_3) == 0x0000B8, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::Temp_bool_IsClosed_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, Temp_bool_Has_Been_Initd_Variable_3) == 0x0000B9, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::Temp_bool_Has_Been_Initd_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_Subtract_DoubleDouble_ReturnValue_3) == 0x0000C0, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_Subtract_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_Divide_DoubleDouble_ReturnValue_3) == 0x0000C8, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_Divide_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_FClamp_ReturnValue_3) == 0x0000D0, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_FClamp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_SelectFloat_ReturnValue_3) == 0x0000D8, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_SelectFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_GetFloatValue_ReturnValue_3) == 0x0000E0, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_GetFloatValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x0000E8, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_4) == 0x0000F0, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_Subtract_DoubleDouble_ReturnValue_4) == 0x0000F8, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_Subtract_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_Divide_DoubleDouble_ReturnValue_4) == 0x000100, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_Divide_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_FClamp_ReturnValue_4) == 0x000108, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_FClamp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, K2Node_CreateDelegate_OutputDelegate) == 0x000110, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_GetFloatValue_ReturnValue_4) == 0x000120, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_GetFloatValue_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_SelectFloat_ReturnValue_4) == 0x000128, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_SelectFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000130, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, Temp_bool_IsClosed_Variable_4) == 0x000138, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::Temp_bool_IsClosed_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, Temp_bool_Has_Been_Initd_Variable_4) == 0x000139, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::Temp_bool_Has_Been_Initd_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, K2Node_Event_DeltaSecond) == 0x000140, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::K2Node_Event_DeltaSecond' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_GetActionTargetActor_ReturnValue) == 0x000148, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_GetActionTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, K2Node_Event_DeltaSeconds) == 0x000150, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, K2Node_CustomEvent_Defencer) == 0x000158, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::K2Node_CustomEvent_Defencer' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, K2Node_CustomEvent_DamageInfo) == 0x000160, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::K2Node_CustomEvent_DamageInfo' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, K2Node_CustomEvent_HitCount) == 0x000230, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::K2Node_CustomEvent_HitCount' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, K2Node_CustomEvent_AttackerComponent) == 0x000238, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::K2Node_CustomEvent_AttackerComponent' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000240, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, Temp_bool_Has_Been_Initd_Variable_5) == 0x000241, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::Temp_bool_Has_Been_Initd_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_GetRollEffectLocation_Location) == 0x000248, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_GetRollEffectLocation_Location' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, Temp_bool_IsClosed_Variable_5) == 0x000260, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::Temp_bool_IsClosed_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000268, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_GetFloatValue_InTime_ImplicitCast) == 0x000350, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_GetFloatValue_InTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000358, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x000360, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_GetFloatValue_InTime_ImplicitCast_1) == 0x000364, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_GetFloatValue_InTime_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x000368, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_SetVariableFloat_InValue_ImplicitCast_1) == 0x000370, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_SetVariableFloat_InValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_GetFloatValue_InTime_ImplicitCast_2) == 0x000374, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_GetFloatValue_InTime_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2) == 0x000378, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_SetVariableFloat_InValue_ImplicitCast_2) == 0x000380, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_SetVariableFloat_InValue_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_GetFloatValue_InTime_ImplicitCast_3) == 0x000384, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_GetFloatValue_InTime_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_3) == 0x000388, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_SetVariableFloat_InValue_ImplicitCast_3) == 0x000390, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_SetVariableFloat_InValue_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_GetFloatValue_InTime_ImplicitCast_4) == 0x000394, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_GetFloatValue_InTime_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_4) == 0x000398, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll, CallFunc_SetVariableFloat_InValue_ImplicitCast_4) == 0x0003A0, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_ExecuteUbergraph_BP_SkillEffect_Unique_SheepBall_Roll::CallFunc_SetVariableFloat_InValue_ImplicitCast_4' has a wrong offset!");

// Function BP_SkillEffect_Unique_SheepBall_Roll.BP_SkillEffect_Unique_SheepBall_Roll_C.FadeOutEffect
// 0x0008 (0x0008 - 0x0000)
struct BP_SkillEffect_Unique_SheepBall_Roll_C_FadeOutEffect final
{
public:
	double                                        DeltaSecond;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_Unique_SheepBall_Roll_C_FadeOutEffect) == 0x000008, "Wrong alignment on BP_SkillEffect_Unique_SheepBall_Roll_C_FadeOutEffect");
static_assert(sizeof(BP_SkillEffect_Unique_SheepBall_Roll_C_FadeOutEffect) == 0x000008, "Wrong size on BP_SkillEffect_Unique_SheepBall_Roll_C_FadeOutEffect");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_FadeOutEffect, DeltaSecond) == 0x000000, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_FadeOutEffect::DeltaSecond' has a wrong offset!");

// Function BP_SkillEffect_Unique_SheepBall_Roll.BP_SkillEffect_Unique_SheepBall_Roll_C.GetRollEffectLocation
// 0x00E8 (0x00E8 - 0x0000)
struct BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalSkeletalMeshComponent*              CallFunc_GetMainMesh_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation) == 0x000008, "Wrong alignment on BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation");
static_assert(sizeof(BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation) == 0x0000E8, "Wrong size on BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation, Location) == 0x000000, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation::Location' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000018, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation, CallFunc_GetMainMesh_ReturnValue) == 0x000020, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation::CallFunc_GetMainMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000040, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation, CallFunc_BreakVector_X) == 0x000058, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation, CallFunc_BreakVector_Y) == 0x000060, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation, CallFunc_BreakVector_Z) == 0x000068, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation, CallFunc_BreakVector_X_1) == 0x000070, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation, CallFunc_BreakVector_Y_1) == 0x000078, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation, CallFunc_BreakVector_Z_1) == 0x000080, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation, CallFunc_GetSocketLocation_ReturnValue) == 0x000088, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation, CallFunc_BreakVector_X_2) == 0x0000A8, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation, CallFunc_BreakVector_Y_2) == 0x0000B0, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation, CallFunc_BreakVector_Z_2) == 0x0000B8, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000C8, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation, CallFunc_MakeVector_ReturnValue) == 0x0000D0, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_GetRollEffectLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function BP_SkillEffect_Unique_SheepBall_Roll.BP_SkillEffect_Unique_SheepBall_Roll_C.HitAttack
// 0x00E8 (0x00E8 - 0x0000)
struct BP_SkillEffect_Unique_SheepBall_Roll_C_HitAttack final
{
public:
	class AActor*                                 Defencer;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalDamageInfo                         DamageInfo;                                        // 0x0008(0x00D0)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         HitCount;                                          // 0x00D8(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B27[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    AttackerComponent;                                 // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_Unique_SheepBall_Roll_C_HitAttack) == 0x000008, "Wrong alignment on BP_SkillEffect_Unique_SheepBall_Roll_C_HitAttack");
static_assert(sizeof(BP_SkillEffect_Unique_SheepBall_Roll_C_HitAttack) == 0x0000E8, "Wrong size on BP_SkillEffect_Unique_SheepBall_Roll_C_HitAttack");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_HitAttack, Defencer) == 0x000000, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_HitAttack::Defencer' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_HitAttack, DamageInfo) == 0x000008, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_HitAttack::DamageInfo' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_HitAttack, HitCount) == 0x0000D8, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_HitAttack::HitCount' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_SheepBall_Roll_C_HitAttack, AttackerComponent) == 0x0000E0, "Member 'BP_SkillEffect_Unique_SheepBall_Roll_C_HitAttack::AttackerComponent' has a wrong offset!");

// Function BP_SkillEffect_Unique_SheepBall_Roll.BP_SkillEffect_Unique_SheepBall_Roll_C.InitializeEffects
// 0x0050 (0x0050 - 0x0000)
struct BP_SkillEffect_Unique_SheepBall_Roll_C_InitializeEffects final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B28[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNiagaraComponent*>              K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B29[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B2A[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
