#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ShotgunAmmo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ShotgunAmmo.BP_ShotgunAmmo_C
// 0x0018 (0x02A8 - 0x0290)
class ABP_ShotgunAmmo_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Ammo;                                              // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ShotgunAmmo(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ShotgunAmmo_C">();
	}
	static class ABP_ShotgunAmmo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ShotgunAmmo_C>();
	}
};
static_assert(alignof(ABP_ShotgunAmmo_C) == 0x000008, "Wrong alignment on ABP_ShotgunAmmo_C");
static_assert(sizeof(ABP_ShotgunAmmo_C) == 0x0002A8, "Wrong size on ABP_ShotgunAmmo_C");
static_assert(offsetof(ABP_ShotgunAmmo_C, UberGraphFrame) == 0x000290, "Member 'ABP_ShotgunAmmo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ShotgunAmmo_C, Ammo) == 0x000298, "Member 'ABP_ShotgunAmmo_C::Ammo' has a wrong offset!");
static_assert(offsetof(ABP_ShotgunAmmo_C, Scene) == 0x0002A0, "Member 'ABP_ShotgunAmmo_C::Scene' has a wrong offset!");

}

