#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkyCreatorNoShadowLight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SkyCreatorNoShadowLight.BP_SkyCreatorNoShadowLight_C
// 0x0038 (0x02C8 - 0x0290)
class ABP_SkyCreatorNoShadowLight_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDirectionalLightComponent*             NoShadowMoonLight;                                 // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDirectionalLightComponent*             NoShadowSunLight;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ASkyCreator*                            SkyCreator;                                        // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	double                                        NoShadowSunLightIntensity;                         // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NoShadowMoonLightIntensity;                        // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SkyCreatorNoShadowLight(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SkyCreatorNoShadowLight_C">();
	}
	static class ABP_SkyCreatorNoShadowLight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SkyCreatorNoShadowLight_C>();
	}
};
static_assert(alignof(ABP_SkyCreatorNoShadowLight_C) == 0x000008, "Wrong alignment on ABP_SkyCreatorNoShadowLight_C");
static_assert(sizeof(ABP_SkyCreatorNoShadowLight_C) == 0x0002C8, "Wrong size on ABP_SkyCreatorNoShadowLight_C");
static_assert(offsetof(ABP_SkyCreatorNoShadowLight_C, UberGraphFrame) == 0x000290, "Member 'ABP_SkyCreatorNoShadowLight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_SkyCreatorNoShadowLight_C, NoShadowMoonLight) == 0x000298, "Member 'ABP_SkyCreatorNoShadowLight_C::NoShadowMoonLight' has a wrong offset!");
static_assert(offsetof(ABP_SkyCreatorNoShadowLight_C, NoShadowSunLight) == 0x0002A0, "Member 'ABP_SkyCreatorNoShadowLight_C::NoShadowSunLight' has a wrong offset!");
static_assert(offsetof(ABP_SkyCreatorNoShadowLight_C, DefaultSceneRoot) == 0x0002A8, "Member 'ABP_SkyCreatorNoShadowLight_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_SkyCreatorNoShadowLight_C, SkyCreator) == 0x0002B0, "Member 'ABP_SkyCreatorNoShadowLight_C::SkyCreator' has a wrong offset!");
static_assert(offsetof(ABP_SkyCreatorNoShadowLight_C, NoShadowSunLightIntensity) == 0x0002B8, "Member 'ABP_SkyCreatorNoShadowLight_C::NoShadowSunLightIntensity' has a wrong offset!");
static_assert(offsetof(ABP_SkyCreatorNoShadowLight_C, NoShadowMoonLightIntensity) == 0x0002C0, "Member 'ABP_SkyCreatorNoShadowLight_C::NoShadowMoonLightIntensity' has a wrong offset!");

}

