#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WildPalDrinkWaterSpotBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WildPalDrinkWaterSpotBase.BP_WildPalDrinkWaterSpotBase_C
// 0x0028 (0x02B8 - 0x0290)
class ABP_WildPalDrinkWaterSpotBase_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   DebugMesh;                                         // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        Goal_Locations;                                    // 0x02A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void DeleteChild();
	void ExecuteUbergraph_BP_WildPalDrinkWaterSpotBase(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WildPalDrinkWaterSpotBase_C">();
	}
	static class ABP_WildPalDrinkWaterSpotBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WildPalDrinkWaterSpotBase_C>();
	}
};
static_assert(alignof(ABP_WildPalDrinkWaterSpotBase_C) == 0x000008, "Wrong alignment on ABP_WildPalDrinkWaterSpotBase_C");
static_assert(sizeof(ABP_WildPalDrinkWaterSpotBase_C) == 0x0002B8, "Wrong size on ABP_WildPalDrinkWaterSpotBase_C");
static_assert(offsetof(ABP_WildPalDrinkWaterSpotBase_C, UberGraphFrame) == 0x000290, "Member 'ABP_WildPalDrinkWaterSpotBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_WildPalDrinkWaterSpotBase_C, DebugMesh) == 0x000298, "Member 'ABP_WildPalDrinkWaterSpotBase_C::DebugMesh' has a wrong offset!");
static_assert(offsetof(ABP_WildPalDrinkWaterSpotBase_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_WildPalDrinkWaterSpotBase_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_WildPalDrinkWaterSpotBase_C, Goal_Locations) == 0x0002A8, "Member 'ABP_WildPalDrinkWaterSpotBase_C::Goal_Locations' has a wrong offset!");

}

