#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Guild_MemberList

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Pal_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Guild_MemberList.WBP_Guild_MemberList_C.BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Guild_MemberList_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Guild_MemberList_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Guild_MemberList_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Guild_MemberList_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Guild_MemberList_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Guild_MemberList_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Guild_MemberList_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Guild_MemberList.WBP_Guild_MemberList_C.BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Guild_MemberList_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Guild_MemberList_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Guild_MemberList_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Guild_MemberList_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Guild_MemberList_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Guild_MemberList_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Guild_MemberList_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Guild_MemberList.WBP_Guild_MemberList_C.BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Guild_MemberList_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Guild_MemberList_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Guild_MemberList_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Guild_MemberList_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Guild_MemberList_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Guild_MemberList_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Guild_MemberList_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Guild_MemberList.WBP_Guild_MemberList_C.ExecuteUbergraph_WBP_Guild_MemberList
// 0x0030 (0x0030 - 0x0000)
struct WBP_Guild_MemberList_C_ExecuteUbergraph_WBP_Guild_MemberList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44DC[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Guild_MemberList_C_ExecuteUbergraph_WBP_Guild_MemberList) == 0x000008, "Wrong alignment on WBP_Guild_MemberList_C_ExecuteUbergraph_WBP_Guild_MemberList");
static_assert(sizeof(WBP_Guild_MemberList_C_ExecuteUbergraph_WBP_Guild_MemberList) == 0x000030, "Wrong size on WBP_Guild_MemberList_C_ExecuteUbergraph_WBP_Guild_MemberList");
static_assert(offsetof(WBP_Guild_MemberList_C_ExecuteUbergraph_WBP_Guild_MemberList, EntryPoint) == 0x000000, "Member 'WBP_Guild_MemberList_C_ExecuteUbergraph_WBP_Guild_MemberList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Guild_MemberList_C_ExecuteUbergraph_WBP_Guild_MemberList, K2Node_ComponentBoundEvent_Button_2) == 0x000008, "Member 'WBP_Guild_MemberList_C_ExecuteUbergraph_WBP_Guild_MemberList::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_Guild_MemberList_C_ExecuteUbergraph_WBP_Guild_MemberList, K2Node_ComponentBoundEvent_Button_1) == 0x000010, "Member 'WBP_Guild_MemberList_C_ExecuteUbergraph_WBP_Guild_MemberList::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_Guild_MemberList_C_ExecuteUbergraph_WBP_Guild_MemberList, K2Node_ComponentBoundEvent_Button) == 0x000018, "Member 'WBP_Guild_MemberList_C_ExecuteUbergraph_WBP_Guild_MemberList::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_Guild_MemberList_C_ExecuteUbergraph_WBP_Guild_MemberList, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'WBP_Guild_MemberList_C_ExecuteUbergraph_WBP_Guild_MemberList::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Guild_MemberList_C_ExecuteUbergraph_WBP_Guild_MemberList, CallFunc_PlayAnimation_ReturnValue_1) == 0x000028, "Member 'WBP_Guild_MemberList_C_ExecuteUbergraph_WBP_Guild_MemberList::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function WBP_Guild_MemberList.WBP_Guild_MemberList_C.GetDisplayInfo
// 0x0018 (0x0018 - 0x0000)
struct WBP_Guild_MemberList_C_GetDisplayInfo final
{
public:
	struct FPalUIGuildMemberDisplayInfo           DisplayInfo;                                       // 0x0000(0x0018)(Parm, OutParm)
};
static_assert(alignof(WBP_Guild_MemberList_C_GetDisplayInfo) == 0x000008, "Wrong alignment on WBP_Guild_MemberList_C_GetDisplayInfo");
static_assert(sizeof(WBP_Guild_MemberList_C_GetDisplayInfo) == 0x000018, "Wrong size on WBP_Guild_MemberList_C_GetDisplayInfo");
static_assert(offsetof(WBP_Guild_MemberList_C_GetDisplayInfo, DisplayInfo) == 0x000000, "Member 'WBP_Guild_MemberList_C_GetDisplayInfo::DisplayInfo' has a wrong offset!");

// Function WBP_Guild_MemberList.WBP_Guild_MemberList_C.GetFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Guild_MemberList_C_GetFocusTarget final
{
public:
	class UWidget*                                TargetWidget;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Guild_MemberList_C_GetFocusTarget) == 0x000008, "Wrong alignment on WBP_Guild_MemberList_C_GetFocusTarget");
static_assert(sizeof(WBP_Guild_MemberList_C_GetFocusTarget) == 0x000008, "Wrong size on WBP_Guild_MemberList_C_GetFocusTarget");
static_assert(offsetof(WBP_Guild_MemberList_C_GetFocusTarget, TargetWidget) == 0x000000, "Member 'WBP_Guild_MemberList_C_GetFocusTarget::TargetWidget' has a wrong offset!");

// Function WBP_Guild_MemberList.WBP_Guild_MemberList_C.OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Guild_MemberList_C_OnClicked__DelegateSignature final
{
public:
	class UWBP_Guild_MemberList_C*                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Guild_MemberList_C_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Guild_MemberList_C_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_Guild_MemberList_C_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Guild_MemberList_C_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_Guild_MemberList_C_OnClicked__DelegateSignature, Widget) == 0x000000, "Member 'WBP_Guild_MemberList_C_OnClicked__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Guild_MemberList.WBP_Guild_MemberList_C.OnHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Guild_MemberList_C_OnHovered__DelegateSignature final
{
public:
	class UWBP_Guild_MemberList_C*                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Guild_MemberList_C_OnHovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Guild_MemberList_C_OnHovered__DelegateSignature");
static_assert(sizeof(WBP_Guild_MemberList_C_OnHovered__DelegateSignature) == 0x000008, "Wrong size on WBP_Guild_MemberList_C_OnHovered__DelegateSignature");
static_assert(offsetof(WBP_Guild_MemberList_C_OnHovered__DelegateSignature, Widget) == 0x000000, "Member 'WBP_Guild_MemberList_C_OnHovered__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Guild_MemberList.WBP_Guild_MemberList_C.SetIsAdmin
// 0x0028 (0x0028 - 0x0000)
struct WBP_Guild_MemberList_C_SetIsAdmin final
{
public:
	bool                                          IsAdmin;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44DD[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0014(0x0014)()
};
static_assert(alignof(WBP_Guild_MemberList_C_SetIsAdmin) == 0x000004, "Wrong alignment on WBP_Guild_MemberList_C_SetIsAdmin");
static_assert(sizeof(WBP_Guild_MemberList_C_SetIsAdmin) == 0x000028, "Wrong size on WBP_Guild_MemberList_C_SetIsAdmin");
static_assert(offsetof(WBP_Guild_MemberList_C_SetIsAdmin, IsAdmin) == 0x000000, "Member 'WBP_Guild_MemberList_C_SetIsAdmin::IsAdmin' has a wrong offset!");
static_assert(offsetof(WBP_Guild_MemberList_C_SetIsAdmin, CallFunc_SelectColor_ReturnValue) == 0x000004, "Member 'WBP_Guild_MemberList_C_SetIsAdmin::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Guild_MemberList_C_SetIsAdmin, K2Node_MakeStruct_SlateColor) == 0x000014, "Member 'WBP_Guild_MemberList_C_SetIsAdmin::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WBP_Guild_MemberList.WBP_Guild_MemberList_C.SetIsOnline
// 0x0058 (0x0058 - 0x0000)
struct WBP_Guild_MemberList_C_SetIsOnline final
{
public:
	bool                                          IsOnline;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44DE[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44DF[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0014)()
	uint8                                         Pad_44E0[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_Select_Default;                             // 0x0030(0x0010)(NoDestructor)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text;          // 0x0040(0x0018)()
};
static_assert(alignof(WBP_Guild_MemberList_C_SetIsOnline) == 0x000008, "Wrong alignment on WBP_Guild_MemberList_C_SetIsOnline");
static_assert(sizeof(WBP_Guild_MemberList_C_SetIsOnline) == 0x000058, "Wrong size on WBP_Guild_MemberList_C_SetIsOnline");
static_assert(offsetof(WBP_Guild_MemberList_C_SetIsOnline, IsOnline) == 0x000000, "Member 'WBP_Guild_MemberList_C_SetIsOnline::IsOnline' has a wrong offset!");
static_assert(offsetof(WBP_Guild_MemberList_C_SetIsOnline, CallFunc_SelectColor_ReturnValue) == 0x000004, "Member 'WBP_Guild_MemberList_C_SetIsOnline::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Guild_MemberList_C_SetIsOnline, Temp_bool_Variable) == 0x000014, "Member 'WBP_Guild_MemberList_C_SetIsOnline::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Guild_MemberList_C_SetIsOnline, K2Node_MakeStruct_SlateColor) == 0x000018, "Member 'WBP_Guild_MemberList_C_SetIsOnline::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_Guild_MemberList_C_SetIsOnline, K2Node_Select_Default) == 0x000030, "Member 'WBP_Guild_MemberList_C_SetIsOnline::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Guild_MemberList_C_SetIsOnline, CallFunc_GetLocalizedTextFromHandle_Text) == 0x000040, "Member 'WBP_Guild_MemberList_C_SetIsOnline::CallFunc_GetLocalizedTextFromHandle_Text' has a wrong offset!");

// Function WBP_Guild_MemberList.WBP_Guild_MemberList_C.SetPlayerName
// 0x0028 (0x0028 - 0x0000)
struct WBP_Guild_MemberList_C_SetPlayerName final
{
public:
	class FString                                 PlayerName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
};
static_assert(alignof(WBP_Guild_MemberList_C_SetPlayerName) == 0x000008, "Wrong alignment on WBP_Guild_MemberList_C_SetPlayerName");
static_assert(sizeof(WBP_Guild_MemberList_C_SetPlayerName) == 0x000028, "Wrong size on WBP_Guild_MemberList_C_SetPlayerName");
static_assert(offsetof(WBP_Guild_MemberList_C_SetPlayerName, PlayerName) == 0x000000, "Member 'WBP_Guild_MemberList_C_SetPlayerName::PlayerName' has a wrong offset!");
static_assert(offsetof(WBP_Guild_MemberList_C_SetPlayerName, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'WBP_Guild_MemberList_C_SetPlayerName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_Guild_MemberList.WBP_Guild_MemberList_C.Setup
// 0x0030 (0x0030 - 0x0000)
struct WBP_Guild_MemberList_C_Setup final
{
public:
	struct FPalUIGuildMemberDisplayInfo           DisplayInfo;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGuid                                  PlayerUId;                                         // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Guild_MemberList_C_Setup) == 0x000008, "Wrong alignment on WBP_Guild_MemberList_C_Setup");
static_assert(sizeof(WBP_Guild_MemberList_C_Setup) == 0x000030, "Wrong size on WBP_Guild_MemberList_C_Setup");
static_assert(offsetof(WBP_Guild_MemberList_C_Setup, DisplayInfo) == 0x000000, "Member 'WBP_Guild_MemberList_C_Setup::DisplayInfo' has a wrong offset!");
static_assert(offsetof(WBP_Guild_MemberList_C_Setup, PlayerUId) == 0x000018, "Member 'WBP_Guild_MemberList_C_Setup::PlayerUId' has a wrong offset!");
static_assert(offsetof(WBP_Guild_MemberList_C_Setup, Temp_byte_Variable) == 0x000028, "Member 'WBP_Guild_MemberList_C_Setup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Guild_MemberList_C_Setup, Temp_byte_Variable_1) == 0x000029, "Member 'WBP_Guild_MemberList_C_Setup::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Guild_MemberList_C_Setup, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00002A, "Member 'WBP_Guild_MemberList_C_Setup::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Guild_MemberList_C_Setup, Temp_bool_Variable) == 0x00002B, "Member 'WBP_Guild_MemberList_C_Setup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Guild_MemberList_C_Setup, K2Node_Select_Default) == 0x00002C, "Member 'WBP_Guild_MemberList_C_Setup::K2Node_Select_Default' has a wrong offset!");

}

