#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemChest_Preference

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Pal_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ItemChest_Preference.WBP_ItemChest_Preference_C
// 0x0020 (0x0450 - 0x0430)
class UWBP_ItemChest_Preference_C final : public UPalUserWidgetOverlayUI
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default_In;                                        // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_IngameMenu_Chest_Filter_C*         WBP_IngameMenu_Chest_Filter;                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPalUIItemChestFilterModel*             PreferenceModel;                                   // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_ItemChest_Preference_WBP_IngameMenu_Chest_Filter_K2Node_ComponentBoundEvent_0_OnClickedAllCheckButton__DelegateSignature();
	void BndEvt__WBP_ItemChest_Preference_WBP_IngameMenu_Chest_Filter_K2Node_ComponentBoundEvent_1_OnClickedCloseButton__DelegateSignature();
	void BndEvt__WBP_ItemChest_Preference_WBP_IngameMenu_Chest_Filter_K2Node_ComponentBoundEvent_2_OnClickedAllUncheckButton__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_ItemChest_Preference(int32 EntryPoint);
	void OnClickedCheck(class FName FilterId, bool bChecked);
	void OnSetup();
	void Setup();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ItemChest_Preference_C">();
	}
	static class UWBP_ItemChest_Preference_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ItemChest_Preference_C>();
	}
};
static_assert(alignof(UWBP_ItemChest_Preference_C) == 0x000008, "Wrong alignment on UWBP_ItemChest_Preference_C");
static_assert(sizeof(UWBP_ItemChest_Preference_C) == 0x000450, "Wrong size on UWBP_ItemChest_Preference_C");
static_assert(offsetof(UWBP_ItemChest_Preference_C, UberGraphFrame) == 0x000430, "Member 'UWBP_ItemChest_Preference_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ItemChest_Preference_C, Default_In) == 0x000438, "Member 'UWBP_ItemChest_Preference_C::Default_In' has a wrong offset!");
static_assert(offsetof(UWBP_ItemChest_Preference_C, WBP_IngameMenu_Chest_Filter) == 0x000440, "Member 'UWBP_ItemChest_Preference_C::WBP_IngameMenu_Chest_Filter' has a wrong offset!");
static_assert(offsetof(UWBP_ItemChest_Preference_C, PreferenceModel) == 0x000448, "Member 'UWBP_ItemChest_Preference_C::PreferenceModel' has a wrong offset!");

}

