#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Paldex_TaskIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Paldex_TaskIcon.WBP_Paldex_TaskIcon_C
// 0x0050 (0x02C8 - 0x0278)
class UWBP_Paldex_TaskIcon_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anm_off_to_on;                                     // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anm_on;                                            // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anm_off;                                           // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Flare_00;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flare_01;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flare_B_00;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flare_T_00;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_OFF;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_ON;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void AnmEvent_Activate();
	void AnmEvent_Off();
	void AnmEvent_On();
	void ExecuteUbergraph_WBP_Paldex_TaskIcon(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Paldex_TaskIcon_C">();
	}
	static class UWBP_Paldex_TaskIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Paldex_TaskIcon_C>();
	}
};
static_assert(alignof(UWBP_Paldex_TaskIcon_C) == 0x000008, "Wrong alignment on UWBP_Paldex_TaskIcon_C");
static_assert(sizeof(UWBP_Paldex_TaskIcon_C) == 0x0002C8, "Wrong size on UWBP_Paldex_TaskIcon_C");
static_assert(offsetof(UWBP_Paldex_TaskIcon_C, UberGraphFrame) == 0x000278, "Member 'UWBP_Paldex_TaskIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Paldex_TaskIcon_C, Anm_off_to_on) == 0x000280, "Member 'UWBP_Paldex_TaskIcon_C::Anm_off_to_on' has a wrong offset!");
static_assert(offsetof(UWBP_Paldex_TaskIcon_C, Anm_on) == 0x000288, "Member 'UWBP_Paldex_TaskIcon_C::Anm_on' has a wrong offset!");
static_assert(offsetof(UWBP_Paldex_TaskIcon_C, Anm_off) == 0x000290, "Member 'UWBP_Paldex_TaskIcon_C::Anm_off' has a wrong offset!");
static_assert(offsetof(UWBP_Paldex_TaskIcon_C, Flare_00) == 0x000298, "Member 'UWBP_Paldex_TaskIcon_C::Flare_00' has a wrong offset!");
static_assert(offsetof(UWBP_Paldex_TaskIcon_C, Flare_01) == 0x0002A0, "Member 'UWBP_Paldex_TaskIcon_C::Flare_01' has a wrong offset!");
static_assert(offsetof(UWBP_Paldex_TaskIcon_C, Flare_B_00) == 0x0002A8, "Member 'UWBP_Paldex_TaskIcon_C::Flare_B_00' has a wrong offset!");
static_assert(offsetof(UWBP_Paldex_TaskIcon_C, Flare_T_00) == 0x0002B0, "Member 'UWBP_Paldex_TaskIcon_C::Flare_T_00' has a wrong offset!");
static_assert(offsetof(UWBP_Paldex_TaskIcon_C, Icon_OFF) == 0x0002B8, "Member 'UWBP_Paldex_TaskIcon_C::Icon_OFF' has a wrong offset!");
static_assert(offsetof(UWBP_Paldex_TaskIcon_C, Icon_ON) == 0x0002C0, "Member 'UWBP_Paldex_TaskIcon_C::Icon_ON' has a wrong offset!");

}

