#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PalWorkFarm

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Pal_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_PalWorkFarm.WBP_PalWorkFarm_C.CREATEDELEGATE_PROXYFUNCTION_0
// 0x0010 (0x0010 - 0x0000)
struct WBP_PalWorkFarm_C_CREATEDELEGATE_PROXYFUNCTION_0 final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A8B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_OnUpdateProgress_progress_ImplicitCast;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalWorkFarm_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000008, "Wrong alignment on WBP_PalWorkFarm_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(sizeof(WBP_PalWorkFarm_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000010, "Wrong size on WBP_PalWorkFarm_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(offsetof(WBP_PalWorkFarm_C_CREATEDELEGATE_PROXYFUNCTION_0, NewValue) == 0x000000, "Member 'WBP_PalWorkFarm_C_CREATEDELEGATE_PROXYFUNCTION_0::NewValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_CREATEDELEGATE_PROXYFUNCTION_0, CallFunc_OnUpdateProgress_progress_ImplicitCast) == 0x000008, "Member 'WBP_PalWorkFarm_C_CREATEDELEGATE_PROXYFUNCTION_0::CallFunc_OnUpdateProgress_progress_ImplicitCast' has a wrong offset!");

// Function WBP_PalWorkFarm.WBP_PalWorkFarm_C.ExecuteUbergraph_WBP_PalWorkFarm
// 0x0168 (0x0168 - 0x0000)
struct WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A8C[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PalCraftInfo_Pal_C*                CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A8D[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A8E[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalMapObjectEnergyModule*              CallFunc_GetEnergyModule_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalMapObjectWorkeeModule*              CallFunc_GetWorkeeModule_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCurrentCropDataId_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A8F[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetItemName_outName;                      // 0x0050(0x0018)()
	class UPalWorkProgress*                       CallFunc_GetWorkProgress_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPalFarmCropState                             CallFunc_GetCurrentState_ReturnValue;              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A90[0x6];                                     // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDDispatchParameterBase*           CallFunc_GetParam_ReturnValue;                     // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalUIMapObjectStatusIndicatorParameterBase* K2Node_DynamicCast_AsPal_UIMap_Object_Status_Indicator_Parameter_Base; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A91[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalMapObjectConcreteModelBase*         CallFunc_GetConcreteModel_ReturnValue;             // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPalFarmCropState LastState, EPalFarmCropState NextState)> K2Node_CreateDelegate_OutputDelegate;              // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalMapObjectFarmBlockV2Model*          K2Node_DynamicCast_AsPal_Map_Object_Farm_Block_V2Model; // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A92[0x5];                                     // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_PalCraftInfo_Pal_C*>        K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void(class UPalWorkBase* Work)>     K2Node_CreateDelegate_OutputDelegate_1;            // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A93[0x5];                                     // 0x00FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalGameSetting*                        CallFunc_GetGameSetting_ReturnValue;               // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetMapObjectLocation_outVector;           // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A94[0x3];                                     // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A95[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm) == 0x000008, "Wrong alignment on WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm");
static_assert(sizeof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm) == 0x000168, "Wrong size on WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, EntryPoint) == 0x000000, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, CallFunc_GetEnergyModule_ReturnValue) == 0x000030, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::CallFunc_GetEnergyModule_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, CallFunc_GetWorkeeModule_ReturnValue) == 0x000038, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::CallFunc_GetWorkeeModule_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, CallFunc_GetCurrentCropDataId_ReturnValue) == 0x000040, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::CallFunc_GetCurrentCropDataId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, CallFunc_GetItemName_outName) == 0x000050, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::CallFunc_GetItemName_outName' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, CallFunc_GetWorkProgress_ReturnValue) == 0x000068, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::CallFunc_GetWorkProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, CallFunc_GetCurrentState_ReturnValue) == 0x000070, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::CallFunc_GetCurrentState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, CallFunc_IsValid_ReturnValue_1) == 0x000071, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, CallFunc_GetParam_ReturnValue) == 0x000078, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::CallFunc_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, K2Node_DynamicCast_AsPal_UIMap_Object_Status_Indicator_Parameter_Base) == 0x000080, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::K2Node_DynamicCast_AsPal_UIMap_Object_Status_Indicator_Parameter_Base' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, CallFunc_GetConcreteModel_ReturnValue) == 0x000090, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::CallFunc_GetConcreteModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, K2Node_CreateDelegate_OutputDelegate) == 0x000098, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, K2Node_DynamicCast_AsPal_Map_Object_Farm_Block_V2Model) == 0x0000A8, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::K2Node_DynamicCast_AsPal_Map_Object_Farm_Block_V2Model' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, Temp_byte_Variable) == 0x0000B1, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, Temp_byte_Variable_1) == 0x0000B2, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, K2Node_MakeArray_Array) == 0x0000B8, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000C8, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000D8, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000E8, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, CallFunc_GetPalmi_ReturnValue) == 0x0000F0, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, Temp_bool_Variable) == 0x0000F8, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, CallFunc_IsValid_ReturnValue_2) == 0x0000F9, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, K2Node_Select_Default) == 0x0000FA, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000100, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, CallFunc_GetGameSetting_ReturnValue) == 0x000118, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::CallFunc_GetGameSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, CallFunc_PlayAnimation_ReturnValue_1) == 0x000120, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, CallFunc_GetMapObjectLocation_outVector) == 0x000128, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::CallFunc_GetMapObjectLocation_outVector' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, CallFunc_Vector_Distance_ReturnValue) == 0x000140, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, CallFunc_GetEndTime_ReturnValue) == 0x000148, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, CallFunc_Less_DoubleDouble_ReturnValue) == 0x00014C, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, CallFunc_PlayAnimation_ReturnValue_2) == 0x000150, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000158, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x000160, "Member 'WBP_PalWorkFarm_C_ExecuteUbergraph_WBP_PalWorkFarm::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function WBP_PalWorkFarm.WBP_PalWorkFarm_C.On Updated Worker Pal
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_PalWorkFarm_C_On_Updated_Worker_Pal final
{
public:
	class UPalWorkBase*                           Work;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          HasAssign;                                         // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A96[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPalIndividualCharacterSlot*>    CallFunc_GetAssignedCharacters_IndividualSlots;    // 0x0010(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterSlot*            CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterHandle*          CallFunc_GetHandle_ReturnValue;                    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A97[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_TryGetIndividualActor_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A98[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalCharacterParameterComponent*        CallFunc_GetCharacterParameterComponent_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A99[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalWorkAssign*                         CallFunc_GetWorkAssign_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFixed_ReturnValue;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9A[0x2];                                     // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_GetWorkId_ReturnValue;                    // 0x0074(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAssignedToAnyWork_ReturnValue;          // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9B[0x2];                                     // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_GetWorkId_ReturnValue_1;                  // 0x0088(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GuidGuid_ReturnValue;          // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9C[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PalCraftInfo_Pal_C*                CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal) == 0x000008, "Wrong alignment on WBP_PalWorkFarm_C_On_Updated_Worker_Pal");
static_assert(sizeof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal) == 0x0000B0, "Wrong size on WBP_PalWorkFarm_C_On_Updated_Worker_Pal");
static_assert(offsetof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal, Work) == 0x000000, "Member 'WBP_PalWorkFarm_C_On_Updated_Worker_Pal::Work' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal, HasAssign) == 0x000008, "Member 'WBP_PalWorkFarm_C_On_Updated_Worker_Pal::HasAssign' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal, Temp_bool_Variable) == 0x000009, "Member 'WBP_PalWorkFarm_C_On_Updated_Worker_Pal::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal, CallFunc_GetAssignedCharacters_IndividualSlots) == 0x000010, "Member 'WBP_PalWorkFarm_C_On_Updated_Worker_Pal::CallFunc_GetAssignedCharacters_IndividualSlots' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'WBP_PalWorkFarm_C_On_Updated_Worker_Pal::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'WBP_PalWorkFarm_C_On_Updated_Worker_Pal::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_PalWorkFarm_C_On_Updated_Worker_Pal::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'WBP_PalWorkFarm_C_On_Updated_Worker_Pal::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_PalWorkFarm_C_On_Updated_Worker_Pal::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal, CallFunc_GetHandle_ReturnValue) == 0x000038, "Member 'WBP_PalWorkFarm_C_On_Updated_Worker_Pal::CallFunc_GetHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WBP_PalWorkFarm_C_On_Updated_Worker_Pal::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'WBP_PalWorkFarm_C_On_Updated_Worker_Pal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal, CallFunc_TryGetIndividualActor_ReturnValue) == 0x000048, "Member 'WBP_PalWorkFarm_C_On_Updated_Worker_Pal::CallFunc_TryGetIndividualActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'WBP_PalWorkFarm_C_On_Updated_Worker_Pal::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal, CallFunc_GetCharacterParameterComponent_ReturnValue) == 0x000058, "Member 'WBP_PalWorkFarm_C_On_Updated_Worker_Pal::CallFunc_GetCharacterParameterComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal, CallFunc_IsValid_ReturnValue_2) == 0x000060, "Member 'WBP_PalWorkFarm_C_On_Updated_Worker_Pal::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal, CallFunc_GetWorkAssign_ReturnValue) == 0x000068, "Member 'WBP_PalWorkFarm_C_On_Updated_Worker_Pal::CallFunc_GetWorkAssign_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal, CallFunc_IsValid_ReturnValue_3) == 0x000070, "Member 'WBP_PalWorkFarm_C_On_Updated_Worker_Pal::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal, CallFunc_IsFixed_ReturnValue) == 0x000071, "Member 'WBP_PalWorkFarm_C_On_Updated_Worker_Pal::CallFunc_IsFixed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal, CallFunc_GetWorkId_ReturnValue) == 0x000074, "Member 'WBP_PalWorkFarm_C_On_Updated_Worker_Pal::CallFunc_GetWorkId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal, CallFunc_IsAssignedToAnyWork_ReturnValue) == 0x000084, "Member 'WBP_PalWorkFarm_C_On_Updated_Worker_Pal::CallFunc_IsAssignedToAnyWork_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal, Temp_byte_Variable) == 0x000085, "Member 'WBP_PalWorkFarm_C_On_Updated_Worker_Pal::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal, CallFunc_GetWorkId_ReturnValue_1) == 0x000088, "Member 'WBP_PalWorkFarm_C_On_Updated_Worker_Pal::CallFunc_GetWorkId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal, Temp_byte_Variable_1) == 0x000098, "Member 'WBP_PalWorkFarm_C_On_Updated_Worker_Pal::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal, CallFunc_EqualEqual_GuidGuid_ReturnValue) == 0x000099, "Member 'WBP_PalWorkFarm_C_On_Updated_Worker_Pal::CallFunc_EqualEqual_GuidGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal, CallFunc_BooleanAND_ReturnValue) == 0x00009A, "Member 'WBP_PalWorkFarm_C_On_Updated_Worker_Pal::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal, K2Node_Select_Default) == 0x00009B, "Member 'WBP_PalWorkFarm_C_On_Updated_Worker_Pal::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal, CallFunc_Array_Get_Item_1) == 0x0000A0, "Member 'WBP_PalWorkFarm_C_On_Updated_Worker_Pal::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal, CallFunc_Array_Length_ReturnValue_1) == 0x0000A8, "Member 'WBP_PalWorkFarm_C_On_Updated_Worker_Pal::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_On_Updated_Worker_Pal, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000AC, "Member 'WBP_PalWorkFarm_C_On_Updated_Worker_Pal::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_PalWorkFarm.WBP_PalWorkFarm_C.OnUpdateProgress
// 0x0018 (0x0018 - 0x0000)
struct WBP_PalWorkFarm_C_OnUpdateProgress final
{
public:
	double                                        Progress;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalWorkFarm_C_OnUpdateProgress) == 0x000008, "Wrong alignment on WBP_PalWorkFarm_C_OnUpdateProgress");
static_assert(sizeof(WBP_PalWorkFarm_C_OnUpdateProgress) == 0x000018, "Wrong size on WBP_PalWorkFarm_C_OnUpdateProgress");
static_assert(offsetof(WBP_PalWorkFarm_C_OnUpdateProgress, Progress) == 0x000000, "Member 'WBP_PalWorkFarm_C_OnUpdateProgress::Progress' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_OnUpdateProgress, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_PalWorkFarm_C_OnUpdateProgress::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_OnUpdateProgress, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000010, "Member 'WBP_PalWorkFarm_C_OnUpdateProgress::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_PalWorkFarm.WBP_PalWorkFarm_C.OnUpdateState
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_PalWorkFarm_C_OnUpdateState final
{
public:
	EPalFarmCropState                             LastState;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalFarmCropState                             NextState;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9D[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9E[0x1];                                     // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float NewValue)>               K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9F[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDataTableRowHandle>            CallFunc_Map_Values_Values;                        // 0x0020(0x0010)(ReferenceParm)
	struct FDataTableRowHandle                    CallFunc_Array_Get_Item;                           // 0x0030(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AA0[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text;          // 0x0048(0x0018)()
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AA1[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    CallFunc_Map_Find_Value;                           // 0x0068(0x0010)(NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AA2[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_1;        // 0x0080(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalWorkSuitability                           CallFunc_GetWorkSuitability_ReturnValue;           // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AA3[0x3];                                     // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalMapObjectWorkeeModule*              CallFunc_GetWorkeeModule_ReturnValue;              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalWorkProgress*                       CallFunc_GetWorkProgress_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalWorkFarm_C_OnUpdateState) == 0x000008, "Wrong alignment on WBP_PalWorkFarm_C_OnUpdateState");
static_assert(sizeof(WBP_PalWorkFarm_C_OnUpdateState) == 0x0000B0, "Wrong size on WBP_PalWorkFarm_C_OnUpdateState");
static_assert(offsetof(WBP_PalWorkFarm_C_OnUpdateState, LastState) == 0x000000, "Member 'WBP_PalWorkFarm_C_OnUpdateState::LastState' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_OnUpdateState, NextState) == 0x000001, "Member 'WBP_PalWorkFarm_C_OnUpdateState::NextState' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_OnUpdateState, Temp_int_Variable) == 0x000004, "Member 'WBP_PalWorkFarm_C_OnUpdateState::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkFarm_C_OnUpdateState, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'WBP_PalWorkFarm_C_OnUpdateState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
