#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RecoverPalStateIndicator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Pal_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RecoverPalStateIndicator.WBP_RecoverPalStateIndicator_C
// 0x0048 (0x0450 - 0x0408)
class UWBP_RecoverPalStateIndicator_C final : public UPalUIMapObjectStatusIndicatorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0408(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default_In;                                        // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_PalCommonCharacterSlotButton_C*    WBP_PalCommonCharacterSlotButton;                  // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalCommonCharacterSlotButton_C*    WBP_PalCommonCharacterSlotButton_1;                // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalCommonCharacterSlotButton_C*    WBP_PalCommonCharacterSlotButton_2;                // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalCommonCharacterSlotButton_C*    WBP_PalCommonCharacterSlotButton_3;                // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalCommonCharacterSlotButton_C*    WBP_PalCommonCharacterSlotButton_4;                // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalCommonWindow_BlueBorder_C*      WBP_PalCommonWindow_BlueBorder;                    // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPalUIRecoverPalStatusIndicatorParameter* Parameter;                                         // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_RecoverPalStateIndicator(int32 EntryPoint);
	void GetSlotWidget(int32 Param_Index, class UWBP_PalCommonCharacterSlotButton_C** SlotWidget);
	void Initialize();
	void OnSetup();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RecoverPalStateIndicator_C">();
	}
	static class UWBP_RecoverPalStateIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RecoverPalStateIndicator_C>();
	}
};
static_assert(alignof(UWBP_RecoverPalStateIndicator_C) == 0x000008, "Wrong alignment on UWBP_RecoverPalStateIndicator_C");
static_assert(sizeof(UWBP_RecoverPalStateIndicator_C) == 0x000450, "Wrong size on UWBP_RecoverPalStateIndicator_C");
static_assert(offsetof(UWBP_RecoverPalStateIndicator_C, UberGraphFrame) == 0x000408, "Member 'UWBP_RecoverPalStateIndicator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RecoverPalStateIndicator_C, Default_In) == 0x000410, "Member 'UWBP_RecoverPalStateIndicator_C::Default_In' has a wrong offset!");
static_assert(offsetof(UWBP_RecoverPalStateIndicator_C, WBP_PalCommonCharacterSlotButton) == 0x000418, "Member 'UWBP_RecoverPalStateIndicator_C::WBP_PalCommonCharacterSlotButton' has a wrong offset!");
static_assert(offsetof(UWBP_RecoverPalStateIndicator_C, WBP_PalCommonCharacterSlotButton_1) == 0x000420, "Member 'UWBP_RecoverPalStateIndicator_C::WBP_PalCommonCharacterSlotButton_1' has a wrong offset!");
static_assert(offsetof(UWBP_RecoverPalStateIndicator_C, WBP_PalCommonCharacterSlotButton_2) == 0x000428, "Member 'UWBP_RecoverPalStateIndicator_C::WBP_PalCommonCharacterSlotButton_2' has a wrong offset!");
static_assert(offsetof(UWBP_RecoverPalStateIndicator_C, WBP_PalCommonCharacterSlotButton_3) == 0x000430, "Member 'UWBP_RecoverPalStateIndicator_C::WBP_PalCommonCharacterSlotButton_3' has a wrong offset!");
static_assert(offsetof(UWBP_RecoverPalStateIndicator_C, WBP_PalCommonCharacterSlotButton_4) == 0x000438, "Member 'UWBP_RecoverPalStateIndicator_C::WBP_PalCommonCharacterSlotButton_4' has a wrong offset!");
static_assert(offsetof(UWBP_RecoverPalStateIndicator_C, WBP_PalCommonWindow_BlueBorder) == 0x000440, "Member 'UWBP_RecoverPalStateIndicator_C::WBP_PalCommonWindow_BlueBorder' has a wrong offset!");
static_assert(offsetof(UWBP_RecoverPalStateIndicator_C, Parameter) == 0x000448, "Member 'UWBP_RecoverPalStateIndicator_C::Parameter' has a wrong offset!");

}

