#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MenuESC_Button

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_PalEscMenuType_structs.hpp"


namespace SDK::Params
{

// Function WBP_MenuESC_Button.WBP_MenuESC_Button_C.BndEvt__WBP_MenuESC_Button_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MenuESC_Button_C_BndEvt__WBP_MenuESC_Button_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuESC_Button_C_BndEvt__WBP_MenuESC_Button_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MenuESC_Button_C_BndEvt__WBP_MenuESC_Button_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_MenuESC_Button_C_BndEvt__WBP_MenuESC_Button_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_MenuESC_Button_C_BndEvt__WBP_MenuESC_Button_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_MenuESC_Button_C_BndEvt__WBP_MenuESC_Button_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_MenuESC_Button_C_BndEvt__WBP_MenuESC_Button_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MenuESC_Button.WBP_MenuESC_Button_C.BndEvt__WBP_MenuESC_Button_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MenuESC_Button_C_BndEvt__WBP_MenuESC_Button_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuESC_Button_C_BndEvt__WBP_MenuESC_Button_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MenuESC_Button_C_BndEvt__WBP_MenuESC_Button_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_MenuESC_Button_C_BndEvt__WBP_MenuESC_Button_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_MenuESC_Button_C_BndEvt__WBP_MenuESC_Button_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_MenuESC_Button_C_BndEvt__WBP_MenuESC_Button_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_MenuESC_Button_C_BndEvt__WBP_MenuESC_Button_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MenuESC_Button.WBP_MenuESC_Button_C.BndEvt__WBP_MenuESC_Button_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MenuESC_Button_C_BndEvt__WBP_MenuESC_Button_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuESC_Button_C_BndEvt__WBP_MenuESC_Button_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MenuESC_Button_C_BndEvt__WBP_MenuESC_Button_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_MenuESC_Button_C_BndEvt__WBP_MenuESC_Button_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_MenuESC_Button_C_BndEvt__WBP_MenuESC_Button_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_MenuESC_Button_C_BndEvt__WBP_MenuESC_Button_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_MenuESC_Button_C_BndEvt__WBP_MenuESC_Button_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MenuESC_Button.WBP_MenuESC_Button_C.ExecuteUbergraph_WBP_MenuESC_Button
// 0x0070 (0x0070 - 0x0000)
struct WBP_MenuESC_Button_C_ExecuteUbergraph_WBP_MenuESC_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CBC[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CBD[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    CallFunc_Map_Find_Value;                           // 0x0030(0x0010)(NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CBE[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text;          // 0x0048(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuESC_Button_C_ExecuteUbergraph_WBP_MenuESC_Button) == 0x000008, "Wrong alignment on WBP_MenuESC_Button_C_ExecuteUbergraph_WBP_MenuESC_Button");
static_assert(sizeof(WBP_MenuESC_Button_C_ExecuteUbergraph_WBP_MenuESC_Button) == 0x000070, "Wrong size on WBP_MenuESC_Button_C_ExecuteUbergraph_WBP_MenuESC_Button");
static_assert(offsetof(WBP_MenuESC_Button_C_ExecuteUbergraph_WBP_MenuESC_Button, EntryPoint) == 0x000000, "Member 'WBP_MenuESC_Button_C_ExecuteUbergraph_WBP_MenuESC_Button::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MenuESC_Button_C_ExecuteUbergraph_WBP_MenuESC_Button, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_MenuESC_Button_C_ExecuteUbergraph_WBP_MenuESC_Button::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuESC_Button_C_ExecuteUbergraph_WBP_MenuESC_Button, K2Node_ComponentBoundEvent_Button_2) == 0x000010, "Member 'WBP_MenuESC_Button_C_ExecuteUbergraph_WBP_MenuESC_Button::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_MenuESC_Button_C_ExecuteUbergraph_WBP_MenuESC_Button, K2Node_ComponentBoundEvent_Button_1) == 0x000018, "Member 'WBP_MenuESC_Button_C_ExecuteUbergraph_WBP_MenuESC_Button::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_MenuESC_Button_C_ExecuteUbergraph_WBP_MenuESC_Button, K2Node_ComponentBoundEvent_Button) == 0x000020, "Member 'WBP_MenuESC_Button_C_ExecuteUbergraph_WBP_MenuESC_Button::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_MenuESC_Button_C_ExecuteUbergraph_WBP_MenuESC_Button, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000028, "Member 'WBP_MenuESC_Button_C_ExecuteUbergraph_WBP_MenuESC_Button::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuESC_Button_C_ExecuteUbergraph_WBP_MenuESC_Button, CallFunc_Map_Find_Value) == 0x000030, "Member 'WBP_MenuESC_Button_C_ExecuteUbergraph_WBP_MenuESC_Button::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_MenuESC_Button_C_ExecuteUbergraph_WBP_MenuESC_Button, CallFunc_Map_Find_ReturnValue) == 0x000040, "Member 'WBP_MenuESC_Button_C_ExecuteUbergraph_WBP_MenuESC_Button::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuESC_Button_C_ExecuteUbergraph_WBP_MenuESC_Button, CallFunc_GetLocalizedTextFromHandle_Text) == 0x000048, "Member 'WBP_MenuESC_Button_C_ExecuteUbergraph_WBP_MenuESC_Button::CallFunc_GetLocalizedTextFromHandle_Text' has a wrong offset!");
static_assert(offsetof(WBP_MenuESC_Button_C_ExecuteUbergraph_WBP_MenuESC_Button, CallFunc_PlayAnimation_ReturnValue_1) == 0x000060, "Member 'WBP_MenuESC_Button_C_ExecuteUbergraph_WBP_MenuESC_Button::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MenuESC_Button_C_ExecuteUbergraph_WBP_MenuESC_Button, CallFunc_PlayAnimation_ReturnValue_2) == 0x000068, "Member 'WBP_MenuESC_Button_C_ExecuteUbergraph_WBP_MenuESC_Button::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");

// Function WBP_MenuESC_Button.WBP_MenuESC_Button_C.OnClicked__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_MenuESC_Button_C_OnClicked__DelegateSignature final
{
public:
	E_PalEscMenuType                              Param_MenuType;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuESC_Button_C_OnClicked__DelegateSignature) == 0x000001, "Wrong alignment on WBP_MenuESC_Button_C_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_MenuESC_Button_C_OnClicked__DelegateSignature) == 0x000001, "Wrong size on WBP_MenuESC_Button_C_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_MenuESC_Button_C_OnClicked__DelegateSignature, Param_MenuType) == 0x000000, "Member 'WBP_MenuESC_Button_C_OnClicked__DelegateSignature::Param_MenuType' has a wrong offset!");

}

