#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BuildObjectScrollListBlock

#include "Basic.hpp"

#include "Pal_structs.hpp"


namespace SDK::Params
{

// Function WBP_BuildObjectScrollListBlock.WBP_BuildObjectScrollListBlock_C.AddBuildObjectList
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_BuildObjectScrollListBlock_C_AddBuildObjectList final
{
public:
	TArray<struct FPalBuildObjectData>            buildObjectDataArray;                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	EPalBuildObjectTypeB                          Param_TypeB;                                       // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalBuildObjectTypeA                          Param_TypeA;                                       // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5765[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPalBuildObjectData                    CallFunc_Array_Get_Item;                           // 0x0020(0x0080)()
	class UWBP_PalBuildObjectThumbnailButton_C*   CallFunc_CreateBuildObjectIconWidget_createdWidget; // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5766[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuildObjectScrollListBlock_C_AddBuildObjectList) == 0x000008, "Wrong alignment on WBP_BuildObjectScrollListBlock_C_AddBuildObjectList");
static_assert(sizeof(WBP_BuildObjectScrollListBlock_C_AddBuildObjectList) == 0x0000B0, "Wrong size on WBP_BuildObjectScrollListBlock_C_AddBuildObjectList");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_AddBuildObjectList, buildObjectDataArray) == 0x000000, "Member 'WBP_BuildObjectScrollListBlock_C_AddBuildObjectList::buildObjectDataArray' has a wrong offset!");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_AddBuildObjectList, Param_TypeB) == 0x000010, "Member 'WBP_BuildObjectScrollListBlock_C_AddBuildObjectList::Param_TypeB' has a wrong offset!");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_AddBuildObjectList, Param_TypeA) == 0x000011, "Member 'WBP_BuildObjectScrollListBlock_C_AddBuildObjectList::Param_TypeA' has a wrong offset!");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_AddBuildObjectList, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'WBP_BuildObjectScrollListBlock_C_AddBuildObjectList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_AddBuildObjectList, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_BuildObjectScrollListBlock_C_AddBuildObjectList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_AddBuildObjectList, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'WBP_BuildObjectScrollListBlock_C_AddBuildObjectList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_AddBuildObjectList, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_BuildObjectScrollListBlock_C_AddBuildObjectList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_AddBuildObjectList, CallFunc_CreateBuildObjectIconWidget_createdWidget) == 0x0000A0, "Member 'WBP_BuildObjectScrollListBlock_C_AddBuildObjectList::CallFunc_CreateBuildObjectIconWidget_createdWidget' has a wrong offset!");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_AddBuildObjectList, CallFunc_Less_IntInt_ReturnValue) == 0x0000A8, "Member 'WBP_BuildObjectScrollListBlock_C_AddBuildObjectList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_AddBuildObjectList, CallFunc_Add_IntInt_ReturnValue) == 0x0000AC, "Member 'WBP_BuildObjectScrollListBlock_C_AddBuildObjectList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_BuildObjectScrollListBlock.WBP_BuildObjectScrollListBlock_C.CreateBuildObjectIconWidget
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_BuildObjectScrollListBlock_C_CreateBuildObjectIconWidget final
{
public:
	struct FPalBuildObjectData                    BuildObjectData;                                   // 0x0000(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWBP_PalBuildObjectThumbnailButton_C*   CreatedWidget;                                     // 0x0080(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_PalBuildObjectThumbnailButton_C* SelfWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_PalBuildObjectThumbnailButton_C* SelfWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_PalBuildObjectThumbnailButton_C* SelftWidget)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_PalBuildObjectThumbnailButton_C*   CallFunc_Create_ReturnValue;                       // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuildObjectScrollListBlock_C_CreateBuildObjectIconWidget) == 0x000008, "Wrong alignment on WBP_BuildObjectScrollListBlock_C_CreateBuildObjectIconWidget");
static_assert(sizeof(WBP_BuildObjectScrollListBlock_C_CreateBuildObjectIconWidget) == 0x0000C8, "Wrong size on WBP_BuildObjectScrollListBlock_C_CreateBuildObjectIconWidget");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_CreateBuildObjectIconWidget, BuildObjectData) == 0x000000, "Member 'WBP_BuildObjectScrollListBlock_C_CreateBuildObjectIconWidget::BuildObjectData' has a wrong offset!");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_CreateBuildObjectIconWidget, CreatedWidget) == 0x000080, "Member 'WBP_BuildObjectScrollListBlock_C_CreateBuildObjectIconWidget::CreatedWidget' has a wrong offset!");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_CreateBuildObjectIconWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000088, "Member 'WBP_BuildObjectScrollListBlock_C_CreateBuildObjectIconWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_CreateBuildObjectIconWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000098, "Member 'WBP_BuildObjectScrollListBlock_C_CreateBuildObjectIconWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_CreateBuildObjectIconWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000A8, "Member 'WBP_BuildObjectScrollListBlock_C_CreateBuildObjectIconWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_CreateBuildObjectIconWidget, CallFunc_GetLocalPlayerController_ReturnValue) == 0x0000B8, "Member 'WBP_BuildObjectScrollListBlock_C_CreateBuildObjectIconWidget::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_CreateBuildObjectIconWidget, CallFunc_Create_ReturnValue) == 0x0000C0, "Member 'WBP_BuildObjectScrollListBlock_C_CreateBuildObjectIconWidget::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WBP_BuildObjectScrollListBlock.WBP_BuildObjectScrollListBlock_C.FocusTopContent
// 0x0018 (0x0018 - 0x0000)
struct WBP_BuildObjectScrollListBlock_C_FocusTopContent final
{
public:
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PalBuildObjectThumbnailButton_C*   K2Node_DynamicCast_AsWBP_Pal_Build_Object_Thumbnail_Button; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuildObjectScrollListBlock_C_FocusTopContent) == 0x000008, "Wrong alignment on WBP_BuildObjectScrollListBlock_C_FocusTopContent");
static_assert(sizeof(WBP_BuildObjectScrollListBlock_C_FocusTopContent) == 0x000018, "Wrong size on WBP_BuildObjectScrollListBlock_C_FocusTopContent");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_FocusTopContent, CallFunc_GetChildAt_ReturnValue) == 0x000000, "Member 'WBP_BuildObjectScrollListBlock_C_FocusTopContent::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_FocusTopContent, K2Node_DynamicCast_AsWBP_Pal_Build_Object_Thumbnail_Button) == 0x000008, "Member 'WBP_BuildObjectScrollListBlock_C_FocusTopContent::K2Node_DynamicCast_AsWBP_Pal_Build_Object_Thumbnail_Button' has a wrong offset!");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_FocusTopContent, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_BuildObjectScrollListBlock_C_FocusTopContent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_FocusTopContent, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'WBP_BuildObjectScrollListBlock_C_FocusTopContent::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_BuildObjectScrollListBlock.WBP_BuildObjectScrollListBlock_C.GetBuildObjectTypeA
// 0x0001 (0x0001 - 0x0000)
struct WBP_BuildObjectScrollListBlock_C_GetBuildObjectTypeA final
{
public:
	EPalBuildObjectTypeA                          NewParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuildObjectScrollListBlock_C_GetBuildObjectTypeA) == 0x000001, "Wrong alignment on WBP_BuildObjectScrollListBlock_C_GetBuildObjectTypeA");
static_assert(sizeof(WBP_BuildObjectScrollListBlock_C_GetBuildObjectTypeA) == 0x000001, "Wrong size on WBP_BuildObjectScrollListBlock_C_GetBuildObjectTypeA");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_GetBuildObjectTypeA, NewParam) == 0x000000, "Member 'WBP_BuildObjectScrollListBlock_C_GetBuildObjectTypeA::NewParam' has a wrong offset!");

// Function WBP_BuildObjectScrollListBlock.WBP_BuildObjectScrollListBlock_C.GetBuildObjectTypeB
// 0x0001 (0x0001 - 0x0000)
struct WBP_BuildObjectScrollListBlock_C_GetBuildObjectTypeB final
{
public:
	EPalBuildObjectTypeB                          Param_TypeB;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuildObjectScrollListBlock_C_GetBuildObjectTypeB) == 0x000001, "Wrong alignment on WBP_BuildObjectScrollListBlock_C_GetBuildObjectTypeB");
static_assert(sizeof(WBP_BuildObjectScrollListBlock_C_GetBuildObjectTypeB) == 0x000001, "Wrong size on WBP_BuildObjectScrollListBlock_C_GetBuildObjectTypeB");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_GetBuildObjectTypeB, Param_TypeB) == 0x000000, "Member 'WBP_BuildObjectScrollListBlock_C_GetBuildObjectTypeB::Param_TypeB' has a wrong offset!");

// Function WBP_BuildObjectScrollListBlock.WBP_BuildObjectScrollListBlock_C.GetFocusTarget
// 0x0020 (0x0020 - 0x0000)
struct WBP_BuildObjectScrollListBlock_C_GetFocusTarget final
{
public:
	class UWidget*                                Target;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PalBuildObjectThumbnailButton_C*   K2Node_DynamicCast_AsWBP_Pal_Build_Object_Thumbnail_Button; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuildObjectScrollListBlock_C_GetFocusTarget) == 0x000008, "Wrong alignment on WBP_BuildObjectScrollListBlock_C_GetFocusTarget");
static_assert(sizeof(WBP_BuildObjectScrollListBlock_C_GetFocusTarget) == 0x000020, "Wrong size on WBP_BuildObjectScrollListBlock_C_GetFocusTarget");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_GetFocusTarget, Target) == 0x000000, "Member 'WBP_BuildObjectScrollListBlock_C_GetFocusTarget::Target' has a wrong offset!");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_GetFocusTarget, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'WBP_BuildObjectScrollListBlock_C_GetFocusTarget::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_GetFocusTarget, K2Node_DynamicCast_AsWBP_Pal_Build_Object_Thumbnail_Button) == 0x000010, "Member 'WBP_BuildObjectScrollListBlock_C_GetFocusTarget::K2Node_DynamicCast_AsWBP_Pal_Build_Object_Thumbnail_Button' has a wrong offset!");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_GetFocusTarget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_BuildObjectScrollListBlock_C_GetFocusTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_GetFocusTarget, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'WBP_BuildObjectScrollListBlock_C_GetFocusTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_BuildObjectScrollListBlock.WBP_BuildObjectScrollListBlock_C.OnClicked_Internal
// 0x0008 (0x0008 - 0x0000)
struct WBP_BuildObjectScrollListBlock_C_OnClicked_Internal final
{
public:
	class UWBP_PalBuildObjectThumbnailButton_C*   SelfWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuildObjectScrollListBlock_C_OnClicked_Internal) == 0x000008, "Wrong alignment on WBP_BuildObjectScrollListBlock_C_OnClicked_Internal");
static_assert(sizeof(WBP_BuildObjectScrollListBlock_C_OnClicked_Internal) == 0x000008, "Wrong size on WBP_BuildObjectScrollListBlock_C_OnClicked_Internal");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_OnClicked_Internal, SelfWidget) == 0x000000, "Member 'WBP_BuildObjectScrollListBlock_C_OnClicked_Internal::SelfWidget' has a wrong offset!");

// Function WBP_BuildObjectScrollListBlock.WBP_BuildObjectScrollListBlock_C.OnClickedAnyContent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_BuildObjectScrollListBlock_C_OnClickedAnyContent__DelegateSignature final
{
public:
	class UWBP_PalBuildObjectThumbnailButton_C*   Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuildObjectScrollListBlock_C_OnClickedAnyContent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_BuildObjectScrollListBlock_C_OnClickedAnyContent__DelegateSignature");
static_assert(sizeof(WBP_BuildObjectScrollListBlock_C_OnClickedAnyContent__DelegateSignature) == 0x000008, "Wrong size on WBP_BuildObjectScrollListBlock_C_OnClickedAnyContent__DelegateSignature");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_OnClickedAnyContent__DelegateSignature, Widget) == 0x000000, "Member 'WBP_BuildObjectScrollListBlock_C_OnClickedAnyContent__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_BuildObjectScrollListBlock.WBP_BuildObjectScrollListBlock_C.OnHovered_Internal
// 0x0008 (0x0008 - 0x0000)
struct WBP_BuildObjectScrollListBlock_C_OnHovered_Internal final
{
public:
	class UWBP_PalBuildObjectThumbnailButton_C*   SelfWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuildObjectScrollListBlock_C_OnHovered_Internal) == 0x000008, "Wrong alignment on WBP_BuildObjectScrollListBlock_C_OnHovered_Internal");
static_assert(sizeof(WBP_BuildObjectScrollListBlock_C_OnHovered_Internal) == 0x000008, "Wrong size on WBP_BuildObjectScrollListBlock_C_OnHovered_Internal");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_OnHovered_Internal, SelfWidget) == 0x000000, "Member 'WBP_BuildObjectScrollListBlock_C_OnHovered_Internal::SelfWidget' has a wrong offset!");

// Function WBP_BuildObjectScrollListBlock.WBP_BuildObjectScrollListBlock_C.OnHoveredAnyContent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_BuildObjectScrollListBlock_C_OnHoveredAnyContent__DelegateSignature final
{
public:
	class UWBP_PalBuildObjectThumbnailButton_C*   Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuildObjectScrollListBlock_C_OnHoveredAnyContent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_BuildObjectScrollListBlock_C_OnHoveredAnyContent__DelegateSignature");
static_assert(sizeof(WBP_BuildObjectScrollListBlock_C_OnHoveredAnyContent__DelegateSignature) == 0x000008, "Wrong size on WBP_BuildObjectScrollListBlock_C_OnHoveredAnyContent__DelegateSignature");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_OnHoveredAnyContent__DelegateSignature, Widget) == 0x000000, "Member 'WBP_BuildObjectScrollListBlock_C_OnHoveredAnyContent__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_BuildObjectScrollListBlock.WBP_BuildObjectScrollListBlock_C.OnUnhovered_Internal
// 0x0008 (0x0008 - 0x0000)
struct WBP_BuildObjectScrollListBlock_C_OnUnhovered_Internal final
{
public:
	class UWBP_PalBuildObjectThumbnailButton_C*   SelftWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuildObjectScrollListBlock_C_OnUnhovered_Internal) == 0x000008, "Wrong alignment on WBP_BuildObjectScrollListBlock_C_OnUnhovered_Internal");
static_assert(sizeof(WBP_BuildObjectScrollListBlock_C_OnUnhovered_Internal) == 0x000008, "Wrong size on WBP_BuildObjectScrollListBlock_C_OnUnhovered_Internal");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_OnUnhovered_Internal, SelftWidget) == 0x000000, "Member 'WBP_BuildObjectScrollListBlock_C_OnUnhovered_Internal::SelftWidget' has a wrong offset!");

// Function WBP_BuildObjectScrollListBlock.WBP_BuildObjectScrollListBlock_C.OnUnhoveredAnyContent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_BuildObjectScrollListBlock_C_OnUnhoveredAnyContent__DelegateSignature final
{
public:
	class UWBP_PalBuildObjectThumbnailButton_C*   Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuildObjectScrollListBlock_C_OnUnhoveredAnyContent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_BuildObjectScrollListBlock_C_OnUnhoveredAnyContent__DelegateSignature");
static_assert(sizeof(WBP_BuildObjectScrollListBlock_C_OnUnhoveredAnyContent__DelegateSignature) == 0x000008, "Wrong size on WBP_BuildObjectScrollListBlock_C_OnUnhoveredAnyContent__DelegateSignature");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_OnUnhoveredAnyContent__DelegateSignature, Widget) == 0x000000, "Member 'WBP_BuildObjectScrollListBlock_C_OnUnhoveredAnyContent__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_BuildObjectScrollListBlock.WBP_BuildObjectScrollListBlock_C.SetCategoryName
// 0x0018 (0x0018 - 0x0000)
struct WBP_BuildObjectScrollListBlock_C_SetCategoryName final
{
public:
	class FText                                   CategoryNameText;                                  // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_BuildObjectScrollListBlock_C_SetCategoryName) == 0x000008, "Wrong alignment on WBP_BuildObjectScrollListBlock_C_SetCategoryName");
static_assert(sizeof(WBP_BuildObjectScrollListBlock_C_SetCategoryName) == 0x000018, "Wrong size on WBP_BuildObjectScrollListBlock_C_SetCategoryName");
static_assert(offsetof(WBP_BuildObjectScrollListBlock_C_SetCategoryName, CategoryNameText) == 0x000000, "Member 'WBP_BuildObjectScrollListBlock_C_SetCategoryName::CategoryNameText' has a wrong offset!");

}

