#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PalDismantling

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Pal_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_PalDismantling.WBP_PalDismantling_C.UpdateUI
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_PalDismantling_C_UpdateUI final
{
public:
	class UPalMasterDataTableAccess_BuildObjectData* CallFunc_GetBuildObjectDataTableAccess_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalBuildObject*                        CallFunc_GetDismantleTargetObject_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_FindRow_bResult;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_470E[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPalBuildObjectData                    CallFunc_BP_FindRow_ReturnValue;                   // 0x0018(0x0080)()
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalDismantling_C_UpdateUI) == 0x000008, "Wrong alignment on WBP_PalDismantling_C_UpdateUI");
static_assert(sizeof(WBP_PalDismantling_C_UpdateUI) == 0x0000A0, "Wrong size on WBP_PalDismantling_C_UpdateUI");
static_assert(offsetof(WBP_PalDismantling_C_UpdateUI, CallFunc_GetBuildObjectDataTableAccess_ReturnValue) == 0x000000, "Member 'WBP_PalDismantling_C_UpdateUI::CallFunc_GetBuildObjectDataTableAccess_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_UpdateUI, CallFunc_GetDismantleTargetObject_ReturnValue) == 0x000008, "Member 'WBP_PalDismantling_C_UpdateUI::CallFunc_GetDismantleTargetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_UpdateUI, CallFunc_BP_FindRow_bResult) == 0x000010, "Member 'WBP_PalDismantling_C_UpdateUI::CallFunc_BP_FindRow_bResult' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_UpdateUI, CallFunc_BP_FindRow_ReturnValue) == 0x000018, "Member 'WBP_PalDismantling_C_UpdateUI::CallFunc_BP_FindRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_UpdateUI, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000098, "Member 'WBP_PalDismantling_C_UpdateUI::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_UpdateUI, CallFunc_IsValid_ReturnValue) == 0x000099, "Member 'WBP_PalDismantling_C_UpdateUI::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_PalDismantling.WBP_PalDismantling_C.Tick
// 0x0048 (0x0048 - 0x0000)
struct WBP_PalDismantling_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalDismantling_C_Tick) == 0x000008, "Wrong alignment on WBP_PalDismantling_C_Tick");
static_assert(sizeof(WBP_PalDismantling_C_Tick) == 0x000048, "Wrong size on WBP_PalDismantling_C_Tick");
static_assert(offsetof(WBP_PalDismantling_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_PalDismantling_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_Tick, InDeltaTime) == 0x000040, "Member 'WBP_PalDismantling_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_PalDismantling.WBP_PalDismantling_C.SetupInputAction
// 0x0070 (0x0070 - 0x0000)
struct WBP_PalDismantling_C_SetupInputAction final
{
public:
	class UPalHUDDispatchParameterBase*           CallFunc_GetParam_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_BuildingUIParameter_C*              K2Node_DynamicCast_AsBP_Building_UIParameter;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_470F[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4710[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue;        // 0x0048(0x0004)(NoDestructor)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue_1;      // 0x004C(0x0004)(NoDestructor)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue_2;      // 0x0050(0x0004)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue_3;      // 0x0064(0x0004)(NoDestructor)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue_4;      // 0x0068(0x0004)(NoDestructor)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue_5;      // 0x006C(0x0004)(NoDestructor)
};
static_assert(alignof(WBP_PalDismantling_C_SetupInputAction) == 0x000008, "Wrong alignment on WBP_PalDismantling_C_SetupInputAction");
static_assert(sizeof(WBP_PalDismantling_C_SetupInputAction) == 0x000070, "Wrong size on WBP_PalDismantling_C_SetupInputAction");
static_assert(offsetof(WBP_PalDismantling_C_SetupInputAction, CallFunc_GetParam_ReturnValue) == 0x000000, "Member 'WBP_PalDismantling_C_SetupInputAction::CallFunc_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_SetupInputAction, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_PalDismantling_C_SetupInputAction::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_SetupInputAction, K2Node_DynamicCast_AsBP_Building_UIParameter) == 0x000018, "Member 'WBP_PalDismantling_C_SetupInputAction::K2Node_DynamicCast_AsBP_Building_UIParameter' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_SetupInputAction, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_PalDismantling_C_SetupInputAction::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_SetupInputAction, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'WBP_PalDismantling_C_SetupInputAction::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_SetupInputAction, K2Node_CreateDelegate_OutputDelegate_2) == 0x000034, "Member 'WBP_PalDismantling_C_SetupInputAction::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_SetupInputAction, CallFunc_Not_PreBool_ReturnValue) == 0x000044, "Member 'WBP_PalDismantling_C_SetupInputAction::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_SetupInputAction, CallFunc_RegisterActionBinding_ReturnValue) == 0x000048, "Member 'WBP_PalDismantling_C_SetupInputAction::CallFunc_RegisterActionBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_SetupInputAction, CallFunc_RegisterActionBinding_ReturnValue_1) == 0x00004C, "Member 'WBP_PalDismantling_C_SetupInputAction::CallFunc_RegisterActionBinding_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_SetupInputAction, CallFunc_RegisterActionBinding_ReturnValue_2) == 0x000050, "Member 'WBP_PalDismantling_C_SetupInputAction::CallFunc_RegisterActionBinding_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_SetupInputAction, K2Node_CreateDelegate_OutputDelegate_3) == 0x000054, "Member 'WBP_PalDismantling_C_SetupInputAction::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_SetupInputAction, CallFunc_RegisterActionBinding_ReturnValue_3) == 0x000064, "Member 'WBP_PalDismantling_C_SetupInputAction::CallFunc_RegisterActionBinding_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_SetupInputAction, CallFunc_RegisterActionBinding_ReturnValue_4) == 0x000068, "Member 'WBP_PalDismantling_C_SetupInputAction::CallFunc_RegisterActionBinding_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_SetupInputAction, CallFunc_RegisterActionBinding_ReturnValue_5) == 0x00006C, "Member 'WBP_PalDismantling_C_SetupInputAction::CallFunc_RegisterActionBinding_ReturnValue_5' has a wrong offset!");

// Function WBP_PalDismantling.WBP_PalDismantling_C.Setup Model
// 0x0010 (0x0010 - 0x0000)
struct WBP_PalDismantling_C_Setup_Model final
{
public:
	class UBP_BuildingUIParameter_C*              Parameter;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBP_PalUIDismantlingModel_C*            CallFunc_SpawnObject_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalDismantling_C_Setup_Model) == 0x000008, "Wrong alignment on WBP_PalDismantling_C_Setup_Model");
static_assert(sizeof(WBP_PalDismantling_C_Setup_Model) == 0x000010, "Wrong size on WBP_PalDismantling_C_Setup_Model");
static_assert(offsetof(WBP_PalDismantling_C_Setup_Model, Parameter) == 0x000000, "Member 'WBP_PalDismantling_C_Setup_Model::Parameter' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_Setup_Model, CallFunc_SpawnObject_ReturnValue) == 0x000008, "Member 'WBP_PalDismantling_C_Setup_Model::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function WBP_PalDismantling.WBP_PalDismantling_C.ReturnToMainMenu
// 0x0030 (0x0030 - 0x0000)
struct WBP_PalDismantling_C_ReturnToMainMenu final
{
public:
	class UPalHUDService*                         CallFunc_GetHUDService_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalHUDDispatchParameterBase*           CallFunc_GetParam_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_BuildingUIParameter_C*              K2Node_DynamicCast_AsBP_Building_UIParameter;      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4711[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDService*                         CallFunc_GetHUDService_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ToInt_ReturnValue;                        // 0x0028(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalDismantling_C_ReturnToMainMenu) == 0x000008, "Wrong alignment on WBP_PalDismantling_C_ReturnToMainMenu");
static_assert(sizeof(WBP_PalDismantling_C_ReturnToMainMenu) == 0x000030, "Wrong size on WBP_PalDismantling_C_ReturnToMainMenu");
static_assert(offsetof(WBP_PalDismantling_C_ReturnToMainMenu, CallFunc_GetHUDService_ReturnValue) == 0x000000, "Member 'WBP_PalDismantling_C_ReturnToMainMenu::CallFunc_GetHUDService_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_ReturnToMainMenu, CallFunc_GetParam_ReturnValue) == 0x000008, "Member 'WBP_PalDismantling_C_ReturnToMainMenu::CallFunc_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_ReturnToMainMenu, K2Node_DynamicCast_AsBP_Building_UIParameter) == 0x000010, "Member 'WBP_PalDismantling_C_ReturnToMainMenu::K2Node_DynamicCast_AsBP_Building_UIParameter' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_ReturnToMainMenu, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_PalDismantling_C_ReturnToMainMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_ReturnToMainMenu, CallFunc_GetHUDService_ReturnValue_1) == 0x000020, "Member 'WBP_PalDismantling_C_ReturnToMainMenu::CallFunc_GetHUDService_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_ReturnToMainMenu, CallFunc_ToInt_ReturnValue) == 0x000028, "Member 'WBP_PalDismantling_C_ReturnToMainMenu::CallFunc_ToInt_ReturnValue' has a wrong offset!");

// Function WBP_PalDismantling.WBP_PalDismantling_C.GetWarningText
// 0x0068 (0x0068 - 0x0000)
struct WBP_PalDismantling_C_GetWarningText final
{
public:
	class FText                                   WarningText;                                       // 0x0000(0x0018)(Parm, OutParm)
	struct FDataTableRowHandle                    MsgId;                                             // 0x0018(0x0010)(Edit, BlueprintVisible, NoDestructor)
	EPalMapObjectOperationResult                  CallFunc_CanRequestDismantle_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4712[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text;          // 0x0030(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4713[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetMapObjectOperationResultText_outName;  // 0x0050(0x0018)()
};
static_assert(alignof(WBP_PalDismantling_C_GetWarningText) == 0x000008, "Wrong alignment on WBP_PalDismantling_C_GetWarningText");
static_assert(sizeof(WBP_PalDismantling_C_GetWarningText) == 0x000068, "Wrong size on WBP_PalDismantling_C_GetWarningText");
static_assert(offsetof(WBP_PalDismantling_C_GetWarningText, WarningText) == 0x000000, "Member 'WBP_PalDismantling_C_GetWarningText::WarningText' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_GetWarningText, MsgId) == 0x000018, "Member 'WBP_PalDismantling_C_GetWarningText::MsgId' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_GetWarningText, CallFunc_CanRequestDismantle_ReturnValue) == 0x000028, "Member 'WBP_PalDismantling_C_GetWarningText::CallFunc_CanRequestDismantle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_GetWarningText, CallFunc_GetLocalizedTextFromHandle_Text) == 0x000030, "Member 'WBP_PalDismantling_C_GetWarningText::CallFunc_GetLocalizedTextFromHandle_Text' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_GetWarningText, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000048, "Member 'WBP_PalDismantling_C_GetWarningText::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_GetWarningText, CallFunc_GetMapObjectOperationResultText_outName) == 0x000050, "Member 'WBP_PalDismantling_C_GetWarningText::CallFunc_GetMapObjectOperationResultText_outName' has a wrong offset!");

// Function WBP_PalDismantling.WBP_PalDismantling_C.FinishDismantling
// 0x0018 (0x0018 - 0x0000)
struct WBP_PalDismantling_C_FinishDismantling final
{
public:
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerController*                   K2Node_DynamicCast_AsPal_Player_Controller;        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalDismantling_C_FinishDismantling) == 0x000008, "Wrong alignment on WBP_PalDismantling_C_FinishDismantling");
static_assert(sizeof(WBP_PalDismantling_C_FinishDismantling) == 0x000018, "Wrong size on WBP_PalDismantling_C_FinishDismantling");
static_assert(offsetof(WBP_PalDismantling_C_FinishDismantling, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000000, "Member 'WBP_PalDismantling_C_FinishDismantling::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_FinishDismantling, K2Node_DynamicCast_AsPal_Player_Controller) == 0x000008, "Member 'WBP_PalDismantling_C_FinishDismantling::K2Node_DynamicCast_AsPal_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_FinishDismantling, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_PalDismantling_C_FinishDismantling::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_PalDismantling.WBP_PalDismantling_C.ExecuteUbergraph_WBP_PalDismantling
// 0x0090 (0x0090 - 0x0000)
struct WBP_PalDismantling_C_ExecuteUbergraph_WBP_PalDismantling final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4714[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetWarningText_WarningText;               // 0x0008(0x0018)()
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0020(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4715[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4716[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalBuilderComponent*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnableDismantle_ReturnValue;            // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4717[0x5];                                     // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalDismantling_C_ExecuteUbergraph_WBP_PalDismantling) == 0x000008, "Wrong alignment on WBP_PalDismantling_C_ExecuteUbergraph_WBP_PalDismantling");
static_assert(sizeof(WBP_PalDismantling_C_ExecuteUbergraph_WBP_PalDismantling) == 0x000090, "Wrong size on WBP_PalDismantling_C_ExecuteUbergraph_WBP_PalDismantling");
static_assert(offsetof(WBP_PalDismantling_C_ExecuteUbergraph_WBP_PalDismantling, EntryPoint) == 0x000000, "Member 'WBP_PalDismantling_C_ExecuteUbergraph_WBP_PalDismantling::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_ExecuteUbergraph_WBP_PalDismantling, CallFunc_GetWarningText_WarningText) == 0x000008, "Member 'WBP_PalDismantling_C_ExecuteUbergraph_WBP_PalDismantling::CallFunc_GetWarningText_WarningText' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_ExecuteUbergraph_WBP_PalDismantling, K2Node_Event_MyGeometry) == 0x000020, "Member 'WBP_PalDismantling_C_ExecuteUbergraph_WBP_PalDismantling::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_ExecuteUbergraph_WBP_PalDismantling, K2Node_Event_InDeltaTime) == 0x000060, "Member 'WBP_PalDismantling_C_ExecuteUbergraph_WBP_PalDismantling::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_ExecuteUbergraph_WBP_PalDismantling, CallFunc_GetPalmi_ReturnValue) == 0x000068, "Member 'WBP_PalDismantling_C_ExecuteUbergraph_WBP_PalDismantling::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_ExecuteUbergraph_WBP_PalDismantling, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'WBP_PalDismantling_C_ExecuteUbergraph_WBP_PalDismantling::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_ExecuteUbergraph_WBP_PalDismantling, CallFunc_GetComponentByClass_ReturnValue) == 0x000078, "Member 'WBP_PalDismantling_C_ExecuteUbergraph_WBP_PalDismantling::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_ExecuteUbergraph_WBP_PalDismantling, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'WBP_PalDismantling_C_ExecuteUbergraph_WBP_PalDismantling::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_ExecuteUbergraph_WBP_PalDismantling, CallFunc_IsValid_ReturnValue_2) == 0x000081, "Member 'WBP_PalDismantling_C_ExecuteUbergraph_WBP_PalDismantling::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_ExecuteUbergraph_WBP_PalDismantling, CallFunc_IsEnableDismantle_ReturnValue) == 0x000082, "Member 'WBP_PalDismantling_C_ExecuteUbergraph_WBP_PalDismantling::CallFunc_IsEnableDismantle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalDismantling_C_ExecuteUbergraph_WBP_PalDismantling, CallFunc_PlayAnimation_ReturnValue) == 0x000088, "Member 'WBP_PalDismantling_C_ExecuteUbergraph_WBP_PalDismantling::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_PalDismantling.WBP_PalDismantling_C.DisposeModel
// 0x0001 (0x0001 - 0x0000)
struct WBP_PalDismantling_C_DisposeModel final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalDismantling_C_DisposeModel) == 0x000001, "Wrong alignment on WBP_PalDismantling_C_DisposeModel");
static_assert(sizeof(WBP_PalDismantling_C_DisposeModel) == 0x000001, "Wrong size on WBP_PalDismantling_C_DisposeModel");
static_assert(offsetof(WBP_PalDismantling_C_DisposeModel, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_PalDismantling_C_DisposeModel::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

