#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InGameMainMenu

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "EPalUIInGameMainMenuTabType_structs.hpp"
#include "Engine_structs.hpp"
#include "Pal_structs.hpp"


namespace SDK::Params
{

// Function WBP_InGameMainMenu.WBP_InGameMainMenu_C.AddChildToContentBody
// 0x0040 (0x0040 - 0x0000)
struct WBP_InGameMainMenu_C_AddChildToContentBody final
{
public:
	class UPalUserWidget*                         Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0008(0x0020)(NoDestructor)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InGameMainMenu_C_AddChildToContentBody) == 0x000008, "Wrong alignment on WBP_InGameMainMenu_C_AddChildToContentBody");
static_assert(sizeof(WBP_InGameMainMenu_C_AddChildToContentBody) == 0x000040, "Wrong size on WBP_InGameMainMenu_C_AddChildToContentBody");
static_assert(offsetof(WBP_InGameMainMenu_C_AddChildToContentBody, Widget) == 0x000000, "Member 'WBP_InGameMainMenu_C_AddChildToContentBody::Widget' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_AddChildToContentBody, K2Node_MakeStruct_Anchors) == 0x000008, "Member 'WBP_InGameMainMenu_C_AddChildToContentBody::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_AddChildToContentBody, CallFunc_AddChild_ReturnValue) == 0x000028, "Member 'WBP_InGameMainMenu_C_AddChildToContentBody::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_AddChildToContentBody, K2Node_DynamicCast_AsCanvas_Panel_Slot) == 0x000030, "Member 'WBP_InGameMainMenu_C_AddChildToContentBody::K2Node_DynamicCast_AsCanvas_Panel_Slot' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_AddChildToContentBody, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_InGameMainMenu_C_AddChildToContentBody::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_InGameMainMenu.WBP_InGameMainMenu_C.ExecuteUbergraph_WBP_InGameMainMenu
// 0x0030 (0x0030 - 0x0000)
struct WBP_InGameMainMenu_C_ExecuteUbergraph_WBP_InGameMainMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 OldIndex, int32 NewIndex, class UWidget* FocusTargetWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59CE[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDDispatchParameterBase*           CallFunc_GetParam_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_InGameMainMenuParameter_C*          K2Node_DynamicCast_AsBP_in_Game_Main_Menu_Parameter; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InGameMainMenu_C_ExecuteUbergraph_WBP_InGameMainMenu) == 0x000008, "Wrong alignment on WBP_InGameMainMenu_C_ExecuteUbergraph_WBP_InGameMainMenu");
static_assert(sizeof(WBP_InGameMainMenu_C_ExecuteUbergraph_WBP_InGameMainMenu) == 0x000030, "Wrong size on WBP_InGameMainMenu_C_ExecuteUbergraph_WBP_InGameMainMenu");
static_assert(offsetof(WBP_InGameMainMenu_C_ExecuteUbergraph_WBP_InGameMainMenu, EntryPoint) == 0x000000, "Member 'WBP_InGameMainMenu_C_ExecuteUbergraph_WBP_InGameMainMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_ExecuteUbergraph_WBP_InGameMainMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_InGameMainMenu_C_ExecuteUbergraph_WBP_InGameMainMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_ExecuteUbergraph_WBP_InGameMainMenu, CallFunc_GetParam_ReturnValue) == 0x000018, "Member 'WBP_InGameMainMenu_C_ExecuteUbergraph_WBP_InGameMainMenu::CallFunc_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_ExecuteUbergraph_WBP_InGameMainMenu, K2Node_DynamicCast_AsBP_in_Game_Main_Menu_Parameter) == 0x000020, "Member 'WBP_InGameMainMenu_C_ExecuteUbergraph_WBP_InGameMainMenu::K2Node_DynamicCast_AsBP_in_Game_Main_Menu_Parameter' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_ExecuteUbergraph_WBP_InGameMainMenu, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_InGameMainMenu_C_ExecuteUbergraph_WBP_InGameMainMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_InGameMainMenu.WBP_InGameMainMenu_C.On Unused Status Points Changed
// 0x0004 (0x0004 - 0x0000)
struct WBP_InGameMainMenu_C_On_Unused_Status_Points_Changed final
{
public:
	int32                                         UnusedPoint;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InGameMainMenu_C_On_Unused_Status_Points_Changed) == 0x000004, "Wrong alignment on WBP_InGameMainMenu_C_On_Unused_Status_Points_Changed");
static_assert(sizeof(WBP_InGameMainMenu_C_On_Unused_Status_Points_Changed) == 0x000004, "Wrong size on WBP_InGameMainMenu_C_On_Unused_Status_Points_Changed");
static_assert(offsetof(WBP_InGameMainMenu_C_On_Unused_Status_Points_Changed, UnusedPoint) == 0x000000, "Member 'WBP_InGameMainMenu_C_On_Unused_Status_Points_Changed::UnusedPoint' has a wrong offset!");

// Function WBP_InGameMainMenu.WBP_InGameMainMenu_C.On Update Player Status Point
// 0x0048 (0x0048 - 0x0000)
struct WBP_InGameMainMenu_C_On_Update_Player_Status_Point final
{
public:
	bool                                          StatusPointUnused;                                 // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AllPointMax;                                       // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59CF[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MainMenu_Tab_C*                    CallFunc_GetTabWidgetByMenuType_TabWidget;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59D0[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59D1[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalCharacterParameterComponent*        CallFunc_GetCharacterParameterComponent_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59D2[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterParameter*       CallFunc_TryGetIndividualParameter_ReturnValue;    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetUnusedStatusPoint_ReturnValue;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStatusPointAllMax_ReturnValue;          // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InGameMainMenu_C_On_Update_Player_Status_Point) == 0x000008, "Wrong alignment on WBP_InGameMainMenu_C_On_Update_Player_Status_Point");
static_assert(sizeof(WBP_InGameMainMenu_C_On_Update_Player_Status_Point) == 0x000048, "Wrong size on WBP_InGameMainMenu_C_On_Update_Player_Status_Point");
static_assert(offsetof(WBP_InGameMainMenu_C_On_Update_Player_Status_Point, StatusPointUnused) == 0x000000, "Member 'WBP_InGameMainMenu_C_On_Update_Player_Status_Point::StatusPointUnused' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_On_Update_Player_Status_Point, AllPointMax) == 0x000001, "Member 'WBP_InGameMainMenu_C_On_Update_Player_Status_Point::AllPointMax' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_On_Update_Player_Status_Point, CallFunc_GetTabWidgetByMenuType_TabWidget) == 0x000008, "Member 'WBP_InGameMainMenu_C_On_Update_Player_Status_Point::CallFunc_GetTabWidgetByMenuType_TabWidget' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_On_Update_Player_Status_Point, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'WBP_InGameMainMenu_C_On_Update_Player_Status_Point::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_On_Update_Player_Status_Point, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'WBP_InGameMainMenu_C_On_Update_Player_Status_Point::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_On_Update_Player_Status_Point, CallFunc_GetPalmi_ReturnValue) == 0x000018, "Member 'WBP_InGameMainMenu_C_On_Update_Player_Status_Point::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_On_Update_Player_Status_Point, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'WBP_InGameMainMenu_C_On_Update_Player_Status_Point::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_On_Update_Player_Status_Point, CallFunc_BooleanAND_ReturnValue) == 0x000021, "Member 'WBP_InGameMainMenu_C_On_Update_Player_Status_Point::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_On_Update_Player_Status_Point, CallFunc_GetCharacterParameterComponent_ReturnValue) == 0x000028, "Member 'WBP_InGameMainMenu_C_On_Update_Player_Status_Point::CallFunc_GetCharacterParameterComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_On_Update_Player_Status_Point, CallFunc_IsValid_ReturnValue_2) == 0x000030, "Member 'WBP_InGameMainMenu_C_On_Update_Player_Status_Point::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_On_Update_Player_Status_Point, CallFunc_IsValid_ReturnValue_3) == 0x000031, "Member 'WBP_InGameMainMenu_C_On_Update_Player_Status_Point::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_On_Update_Player_Status_Point, CallFunc_TryGetIndividualParameter_ReturnValue) == 0x000038, "Member 'WBP_InGameMainMenu_C_On_Update_Player_Status_Point::CallFunc_TryGetIndividualParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_On_Update_Player_Status_Point, CallFunc_GetUnusedStatusPoint_ReturnValue) == 0x000040, "Member 'WBP_InGameMainMenu_C_On_Update_Player_Status_Point::CallFunc_GetUnusedStatusPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_On_Update_Player_Status_Point, CallFunc_IsValid_ReturnValue_4) == 0x000044, "Member 'WBP_InGameMainMenu_C_On_Update_Player_Status_Point::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_On_Update_Player_Status_Point, CallFunc_Greater_IntInt_ReturnValue) == 0x000045, "Member 'WBP_InGameMainMenu_C_On_Update_Player_Status_Point::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_On_Update_Player_Status_Point, CallFunc_IsStatusPointAllMax_ReturnValue) == 0x000046, "Member 'WBP_InGameMainMenu_C_On_Update_Player_Status_Point::CallFunc_IsStatusPointAllMax_ReturnValue' has a wrong offset!");

// Function WBP_InGameMainMenu.WBP_InGameMainMenu_C.OnCancelAction
// 0x0030 (0x0030 - 0x0000)
struct WBP_InGameMainMenu_C_OnCancelAction final
{
public:
	class UWBP_PalStatus_C*                       K2Node_DynamicCast_AsWBP_Pal_Status;               // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Editing_Nick_Name_isEditing;           // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldBackList_shouldBack;                // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59D3[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Guild_ForDisplay_C*                K2Node_DynamicCast_AsWBP_Guild_for_Display;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanClose_CanCloseFlag;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59D4[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_InventoryEquipment_ForDisplay_C*   K2Node_DynamicCast_AsWBP_Inventory_Equipment_for_Display; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSimulatingStatusPoint_IsSimulating;     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InGameMainMenu_C_OnCancelAction) == 0x000008, "Wrong alignment on WBP_InGameMainMenu_C_OnCancelAction");
static_assert(sizeof(WBP_InGameMainMenu_C_OnCancelAction) == 0x000030, "Wrong size on WBP_InGameMainMenu_C_OnCancelAction");
static_assert(offsetof(WBP_InGameMainMenu_C_OnCancelAction, K2Node_DynamicCast_AsWBP_Pal_Status) == 0x000000, "Member 'WBP_InGameMainMenu_C_OnCancelAction::K2Node_DynamicCast_AsWBP_Pal_Status' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_OnCancelAction, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'WBP_InGameMainMenu_C_OnCancelAction::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_OnCancelAction, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'WBP_InGameMainMenu_C_OnCancelAction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_OnCancelAction, CallFunc_Is_Editing_Nick_Name_isEditing) == 0x00000A, "Member 'WBP_InGameMainMenu_C_OnCancelAction::CallFunc_Is_Editing_Nick_Name_isEditing' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_OnCancelAction, CallFunc_ShouldBackList_shouldBack) == 0x00000B, "Member 'WBP_InGameMainMenu_C_OnCancelAction::CallFunc_ShouldBackList_shouldBack' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_OnCancelAction, K2Node_DynamicCast_AsWBP_Guild_for_Display) == 0x000010, "Member 'WBP_InGameMainMenu_C_OnCancelAction::K2Node_DynamicCast_AsWBP_Guild_for_Display' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_OnCancelAction, K2Node_DynamicCast_bSuccess_1) == 0x000018, "Member 'WBP_InGameMainMenu_C_OnCancelAction::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_OnCancelAction, CallFunc_CanClose_CanCloseFlag) == 0x000019, "Member 'WBP_InGameMainMenu_C_OnCancelAction::CallFunc_CanClose_CanCloseFlag' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_OnCancelAction, K2Node_DynamicCast_AsWBP_Inventory_Equipment_for_Display) == 0x000020, "Member 'WBP_InGameMainMenu_C_OnCancelAction::K2Node_DynamicCast_AsWBP_Inventory_Equipment_for_Display' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_OnCancelAction, K2Node_DynamicCast_bSuccess_2) == 0x000028, "Member 'WBP_InGameMainMenu_C_OnCancelAction::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_OnCancelAction, CallFunc_IsSimulatingStatusPoint_IsSimulating) == 0x000029, "Member 'WBP_InGameMainMenu_C_OnCancelAction::CallFunc_IsSimulatingStatusPoint_IsSimulating' has a wrong offset!");

// Function WBP_InGameMainMenu.WBP_InGameMainMenu_C.OnChangedTabIndexEvent
// 0x0028 (0x0028 - 0x0000)
struct WBP_InGameMainMenu_C_OnChangedTabIndexEvent final
{
public:
	int32                                         OldIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewIndex;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                FocusTargetWidget;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59D5[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MainMenu_Tab_C*                    K2Node_DynamicCast_AsWBP_Main_Menu_Tab;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InGameMainMenu_C_OnChangedTabIndexEvent) == 0x000008, "Wrong alignment on WBP_InGameMainMenu_C_OnChangedTabIndexEvent");
static_assert(sizeof(WBP_InGameMainMenu_C_OnChangedTabIndexEvent) == 0x000028, "Wrong size on WBP_InGameMainMenu_C_OnChangedTabIndexEvent");
static_assert(offsetof(WBP_InGameMainMenu_C_OnChangedTabIndexEvent, OldIndex) == 0x000000, "Member 'WBP_InGameMainMenu_C_OnChangedTabIndexEvent::OldIndex' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_OnChangedTabIndexEvent, NewIndex) == 0x000004, "Member 'WBP_InGameMainMenu_C_OnChangedTabIndexEvent::NewIndex' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_OnChangedTabIndexEvent, FocusTargetWidget) == 0x000008, "Member 'WBP_InGameMainMenu_C_OnChangedTabIndexEvent::FocusTargetWidget' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_OnChangedTabIndexEvent, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000010, "Member 'WBP_InGameMainMenu_C_OnChangedTabIndexEvent::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_OnChangedTabIndexEvent, K2Node_DynamicCast_AsWBP_Main_Menu_Tab) == 0x000018, "Member 'WBP_InGameMainMenu_C_OnChangedTabIndexEvent::K2Node_DynamicCast_AsWBP_Main_Menu_Tab' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_OnChangedTabIndexEvent, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_InGameMainMenu_C_OnChangedTabIndexEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_InGameMainMenu.WBP_InGameMainMenu_C.SelectGuildTab
// 0x0010 (0x0010 - 0x0000)
struct WBP_InGameMainMenu_C_SelectGuildTab final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Guild_ForDisplay_C*                CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InGameMainMenu_C_SelectGuildTab) == 0x000008, "Wrong alignment on WBP_InGameMainMenu_C_SelectGuildTab");
static_assert(sizeof(WBP_InGameMainMenu_C_SelectGuildTab) == 0x000010, "Wrong size on WBP_InGameMainMenu_C_SelectGuildTab");
static_assert(offsetof(WBP_InGameMainMenu_C_SelectGuildTab, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'WBP_InGameMainMenu_C_SelectGuildTab::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SelectGuildTab, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_InGameMainMenu_C_SelectGuildTab::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WBP_InGameMainMenu.WBP_InGameMainMenu_C.SelectInventoryEquipmentTab
// 0x0068 (0x0068 - 0x0000)
struct WBP_InGameMainMenu_C_SelectInventoryEquipmentTab final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 UnusedPoint)>            K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59D6[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalCharacterParameterComponent*        CallFunc_GetCharacterParameterComponent_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59D7[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterParameter*       CallFunc_TryGetIndividualParameter_ReturnValue;    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59D8[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventoryEquipment_ForDisplay_C*   CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_InGameMenuInventoryModel_C*         CallFunc_SpawnObject_ReturnValue;                  // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InGameMainMenu_C_SelectInventoryEquipmentTab) == 0x000008, "Wrong alignment on WBP_InGameMainMenu_C_SelectInventoryEquipmentTab");
static_assert(sizeof(WBP_InGameMainMenu_C_SelectInventoryEquipmentTab) == 0x000068, "Wrong size on WBP_InGameMainMenu_C_SelectInventoryEquipmentTab");
static_assert(offsetof(WBP_InGameMainMenu_C_SelectInventoryEquipmentTab, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_InGameMainMenu_C_SelectInventoryEquipmentTab::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SelectInventoryEquipmentTab, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'WBP_InGameMainMenu_C_SelectInventoryEquipmentTab::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SelectInventoryEquipmentTab, CallFunc_GetPalmi_ReturnValue) == 0x000020, "Member 'WBP_InGameMainMenu_C_SelectInventoryEquipmentTab::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SelectInventoryEquipmentTab, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WBP_InGameMainMenu_C_SelectInventoryEquipmentTab::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SelectInventoryEquipmentTab, CallFunc_GetCharacterParameterComponent_ReturnValue) == 0x000030, "Member 'WBP_InGameMainMenu_C_SelectInventoryEquipmentTab::CallFunc_GetCharacterParameterComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SelectInventoryEquipmentTab, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'WBP_InGameMainMenu_C_SelectInventoryEquipmentTab::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SelectInventoryEquipmentTab, CallFunc_IsValid_ReturnValue_2) == 0x000039, "Member 'WBP_InGameMainMenu_C_SelectInventoryEquipmentTab::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SelectInventoryEquipmentTab, CallFunc_TryGetIndividualParameter_ReturnValue) == 0x000040, "Member 'WBP_InGameMainMenu_C_SelectInventoryEquipmentTab::CallFunc_TryGetIndividualParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SelectInventoryEquipmentTab, CallFunc_IsValid_ReturnValue_3) == 0x000048, "Member 'WBP_InGameMainMenu_C_SelectInventoryEquipmentTab::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SelectInventoryEquipmentTab, CallFunc_GetOwningPlayer_ReturnValue) == 0x000050, "Member 'WBP_InGameMainMenu_C_SelectInventoryEquipmentTab::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SelectInventoryEquipmentTab, CallFunc_Create_ReturnValue) == 0x000058, "Member 'WBP_InGameMainMenu_C_SelectInventoryEquipmentTab::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SelectInventoryEquipmentTab, CallFunc_SpawnObject_ReturnValue) == 0x000060, "Member 'WBP_InGameMainMenu_C_SelectInventoryEquipmentTab::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function WBP_InGameMainMenu.WBP_InGameMainMenu_C.SelectOptionTab
// 0x0010 (0x0010 - 0x0000)
struct WBP_InGameMainMenu_C_SelectOptionTab final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_MenuESC_C*                         CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InGameMainMenu_C_SelectOptionTab) == 0x000008, "Wrong alignment on WBP_InGameMainMenu_C_SelectOptionTab");
static_assert(sizeof(WBP_InGameMainMenu_C_SelectOptionTab) == 0x000010, "Wrong size on WBP_InGameMainMenu_C_SelectOptionTab");
static_assert(offsetof(WBP_InGameMainMenu_C_SelectOptionTab, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'WBP_InGameMainMenu_C_SelectOptionTab::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SelectOptionTab, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_InGameMainMenu_C_SelectOptionTab::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WBP_InGameMainMenu.WBP_InGameMainMenu_C.SelectPaldexTab
// 0x0020 (0x0020 - 0x0000)
struct WBP_InGameMainMenu_C_SelectPaldexTab final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Paldex_ForDisplay_C*               CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InGameMainMenu_C_SelectPaldexTab) == 0x000008, "Wrong alignment on WBP_InGameMainMenu_C_SelectPaldexTab");
static_assert(sizeof(WBP_InGameMainMenu_C_SelectPaldexTab) == 0x000020, "Wrong size on WBP_InGameMainMenu_C_SelectPaldexTab");
static_assert(offsetof(WBP_InGameMainMenu_C_SelectPaldexTab, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_InGameMainMenu_C_SelectPaldexTab::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SelectPaldexTab, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'WBP_InGameMainMenu_C_SelectPaldexTab::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SelectPaldexTab, CallFunc_Create_ReturnValue) == 0x000018, "Member 'WBP_InGameMainMenu_C_SelectPaldexTab::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WBP_InGameMainMenu.WBP_InGameMainMenu_C.SelectPalTab
// 0x0028 (0x0028 - 0x0000)
struct WBP_InGameMainMenu_C_SelectPalTab final
{
public:
	class UPalOtomoHolderComponentBase*           CallFunc_GetOtomoHolderComponent_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UPalIndividualCharacterHandle*>  CallFunc_GetAllIndividualHandle_OutArray;          // 0x0010(0x0010)(ReferenceParm)
	class UWBP_PalStatus_C*                       CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InGameMainMenu_C_SelectPalTab) == 0x000008, "Wrong alignment on WBP_InGameMainMenu_C_SelectPalTab");
static_assert(sizeof(WBP_InGameMainMenu_C_SelectPalTab) == 0x000028, "Wrong size on WBP_InGameMainMenu_C_SelectPalTab");
static_assert(offsetof(WBP_InGameMainMenu_C_SelectPalTab, CallFunc_GetOtomoHolderComponent_ReturnValue) == 0x000000, "Member 'WBP_InGameMainMenu_C_SelectPalTab::CallFunc_GetOtomoHolderComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SelectPalTab, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_InGameMainMenu_C_SelectPalTab::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SelectPalTab, CallFunc_GetAllIndividualHandle_OutArray) == 0x000010, "Member 'WBP_InGameMainMenu_C_SelectPalTab::CallFunc_GetAllIndividualHandle_OutArray' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SelectPalTab, CallFunc_Create_ReturnValue) == 0x000020, "Member 'WBP_InGameMainMenu_C_SelectPalTab::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WBP_InGameMainMenu.WBP_InGameMainMenu_C.SelectTab
// 0x0003 (0x0003 - 0x0000)
struct WBP_InGameMainMenu_C_SelectTab final
{
public:
	EPalUIInGameMainMenuTabType                   TabType;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InGameMainMenu_C_SelectTab) == 0x000001, "Wrong alignment on WBP_InGameMainMenu_C_SelectTab");
static_assert(sizeof(WBP_InGameMainMenu_C_SelectTab) == 0x000003, "Wrong size on WBP_InGameMainMenu_C_SelectTab");
static_assert(offsetof(WBP_InGameMainMenu_C_SelectTab, TabType) == 0x000000, "Member 'WBP_InGameMainMenu_C_SelectTab::TabType' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SelectTab, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'WBP_InGameMainMenu_C_SelectTab::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SelectTab, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'WBP_InGameMainMenu_C_SelectTab::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_InGameMainMenu.WBP_InGameMainMenu_C.SelectTechnologyTab
// 0x0020 (0x0020 - 0x0000)
struct WBP_InGameMainMenu_C_SelectTechnologyTab final
{
public:
	TDelegate<void(EPalUIInGameMainMenuTabType Tab)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_TechnologyUI_C*                    CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InGameMainMenu_C_SelectTechnologyTab) == 0x000008, "Wrong alignment on WBP_InGameMainMenu_C_SelectTechnologyTab");
static_assert(sizeof(WBP_InGameMainMenu_C_SelectTechnologyTab) == 0x000020, "Wrong size on WBP_InGameMainMenu_C_SelectTechnologyTab");
static_assert(offsetof(WBP_InGameMainMenu_C_SelectTechnologyTab, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_InGameMainMenu_C_SelectTechnologyTab::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SelectTechnologyTab, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'WBP_InGameMainMenu_C_SelectTechnologyTab::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SelectTechnologyTab, CallFunc_Create_ReturnValue) == 0x000018, "Member 'WBP_InGameMainMenu_C_SelectTechnologyTab::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WBP_InGameMainMenu.WBP_InGameMainMenu_C.Setup Attention Dot
// 0x0098 (0x0098 - 0x0000)
struct WBP_InGameMainMenu_C_Setup_Attention_Dot final
{
public:
	EPalUIInGameMainMenuTabType                   Tab;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59D9[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalPlayerState*                        CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59DA[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalPlayerLocalRecordData*              CallFunc_GetLocalRecordData_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59DB[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  CallFunc_Map_Values_Values;                        // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59DC[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_MainMenu_Tab_C*                    CallFunc_GetTabWidgetByMenuType_TabWidget;         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item;                           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59DD[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59DE[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalCharacterParameterComponent*        CallFunc_GetCharacterParameterComponent_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59DF[0x6];                                     // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterParameter*       CallFunc_TryGetIndividualParameter_ReturnValue;    // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStatusPointAllMax_ReturnValue;          // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59E0[0x1];                                     // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetUnusedStatusPoint_ReturnValue;         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalTechnologyData*                     CallFunc_GetLocalTechnologyData_ReturnValue;       // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsExistNewUnlockedTechnology_ReturnValue; // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InGameMainMenu_C_Setup_Attention_Dot) == 0x000008, "Wrong alignment on WBP_InGameMainMenu_C_Setup_Attention_Dot");
static_assert(sizeof(WBP_InGameMainMenu_C_Setup_Attention_Dot) == 0x000098, "Wrong size on WBP_InGameMainMenu_C_Setup_Attention_Dot");
static_assert(offsetof(WBP_InGameMainMenu_C_Setup_Attention_Dot, Tab) == 0x000000, "Member 'WBP_InGameMainMenu_C_Setup_Attention_Dot::Tab' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_Setup_Attention_Dot, CallFunc_GetLocalPlayerState_ReturnValue) == 0x000008, "Member 'WBP_InGameMainMenu_C_Setup_Attention_Dot::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_Setup_Attention_Dot, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'WBP_InGameMainMenu_C_Setup_Attention_Dot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_Setup_Attention_Dot, CallFunc_GetLocalRecordData_ReturnValue) == 0x000018, "Member 'WBP_InGameMainMenu_C_Setup_Attention_Dot::CallFunc_GetLocalRecordData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_Setup_Attention_Dot, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'WBP_InGameMainMenu_C_Setup_Attention_Dot::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_Setup_Attention_Dot, CallFunc_Map_Values_Values) == 0x000028, "Member 'WBP_InGameMainMenu_C_Setup_Attention_Dot::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_Setup_Attention_Dot, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'WBP_InGameMainMenu_C_Setup_Attention_Dot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_Setup_Attention_Dot, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'WBP_InGameMainMenu_C_Setup_Attention_Dot::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_Setup_Attention_Dot, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WBP_InGameMainMenu_C_Setup_Attention_Dot::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_Setup_Attention_Dot, Temp_int_Array_Index_Variable) == 0x000044, "Member 'WBP_InGameMainMenu_C_Setup_Attention_Dot::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_Setup_Attention_Dot, CallFunc_GetTabWidgetByMenuType_TabWidget) == 0x000048, "Member 'WBP_InGameMainMenu_C_Setup_Attention_Dot::CallFunc_GetTabWidgetByMenuType_TabWidget' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_Setup_Attention_Dot, CallFunc_Array_Get_Item) == 0x000050, "Member 'WBP_InGameMainMenu_C_Setup_Attention_Dot::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_Setup_Attention_Dot, CallFunc_IsValid_ReturnValue) == 0x000051, "Member 'WBP_InGameMainMenu_C_Setup_Attention_Dot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_Setup_Attention_Dot, CallFunc_GetPalmi_ReturnValue) == 0x000058, "Member 'WBP_InGameMainMenu_C_Setup_Attention_Dot::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_Setup_Attention_Dot, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'WBP_InGameMainMenu_C_Setup_Attention_Dot::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_Setup_Attention_Dot, CallFunc_GetCharacterParameterComponent_ReturnValue) == 0x000068, "Member 'WBP_InGameMainMenu_C_Setup_Attention_Dot::CallFunc_GetCharacterParameterComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_Setup_Attention_Dot, CallFunc_IsValid_ReturnValue_2) == 0x000070, "Member 'WBP_InGameMainMenu_C_Setup_Attention_Dot::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_Setup_Attention_Dot, CallFunc_IsValid_ReturnValue_3) == 0x000071, "Member 'WBP_InGameMainMenu_C_Setup_Attention_Dot::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_Setup_Attention_Dot, CallFunc_TryGetIndividualParameter_ReturnValue) == 0x000078, "Member 'WBP_InGameMainMenu_C_Setup_Attention_Dot::CallFunc_TryGetIndividualParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_Setup_Attention_Dot, CallFunc_IsValid_ReturnValue_4) == 0x000080, "Member 'WBP_InGameMainMenu_C_Setup_Attention_Dot::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_Setup_Attention_Dot, CallFunc_IsStatusPointAllMax_ReturnValue) == 0x000081, "Member 'WBP_InGameMainMenu_C_Setup_Attention_Dot::CallFunc_IsStatusPointAllMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_Setup_Attention_Dot, CallFunc_Not_PreBool_ReturnValue) == 0x000082, "Member 'WBP_InGameMainMenu_C_Setup_Attention_Dot::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_Setup_Attention_Dot, CallFunc_GetUnusedStatusPoint_ReturnValue) == 0x000084, "Member 'WBP_InGameMainMenu_C_Setup_Attention_Dot::CallFunc_GetUnusedStatusPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_Setup_Attention_Dot, CallFunc_GetLocalTechnologyData_ReturnValue) == 0x000088, "Member 'WBP_InGameMainMenu_C_Setup_Attention_Dot::CallFunc_GetLocalTechnologyData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_Setup_Attention_Dot, CallFunc_Greater_IntInt_ReturnValue) == 0x000090, "Member 'WBP_InGameMainMenu_C_Setup_Attention_Dot::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_Setup_Attention_Dot, CallFunc_IsValid_ReturnValue_5) == 0x000091, "Member 'WBP_InGameMainMenu_C_Setup_Attention_Dot::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_Setup_Attention_Dot, CallFunc_BooleanAND_ReturnValue) == 0x000092, "Member 'WBP_InGameMainMenu_C_Setup_Attention_Dot::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_Setup_Attention_Dot, CallFunc_IsExistNewUnlockedTechnology_ReturnValue) == 0x000093, "Member 'WBP_InGameMainMenu_C_Setup_Attention_Dot::CallFunc_IsExistNewUnlockedTechnology_ReturnValue' has a wrong offset!");

// Function WBP_InGameMainMenu.WBP_InGameMainMenu_C.SetupAllAttentionDot
// 0x001C (0x001C - 0x0000)
struct WBP_InGameMainMenu_C_SetupAllAttentionDot final
{
public:
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59E1[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InGameMainMenu_C_SetupAllAttentionDot) == 0x000004, "Wrong alignment on WBP_InGameMainMenu_C_SetupAllAttentionDot");
static_assert(sizeof(WBP_InGameMainMenu_C_SetupAllAttentionDot) == 0x00001C, "Wrong size on WBP_InGameMainMenu_C_SetupAllAttentionDot");
static_assert(offsetof(WBP_InGameMainMenu_C_SetupAllAttentionDot, CallFunc_MakeLiteralInt_ReturnValue) == 0x000000, "Member 'WBP_InGameMainMenu_C_SetupAllAttentionDot::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SetupAllAttentionDot, Temp_int_Variable) == 0x000004, "Member 'WBP_InGameMainMenu_C_SetupAllAttentionDot::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SetupAllAttentionDot, Temp_int_Variable_1) == 0x000008, "Member 'WBP_InGameMainMenu_C_SetupAllAttentionDot::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SetupAllAttentionDot, CallFunc_Conv_IntToByte_ReturnValue) == 0x00000C, "Member 'WBP_InGameMainMenu_C_SetupAllAttentionDot::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SetupAllAttentionDot, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_InGameMainMenu_C_SetupAllAttentionDot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SetupAllAttentionDot, CallFunc_GetValidValue_ReturnValue) == 0x000014, "Member 'WBP_InGameMainMenu_C_SetupAllAttentionDot::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SetupAllAttentionDot, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000015, "Member 'WBP_InGameMainMenu_C_SetupAllAttentionDot::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SetupAllAttentionDot, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000016, "Member 'WBP_InGameMainMenu_C_SetupAllAttentionDot::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SetupAllAttentionDot, CallFunc_Less_IntInt_ReturnValue) == 0x000017, "Member 'WBP_InGameMainMenu_C_SetupAllAttentionDot::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SetupAllAttentionDot, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000018, "Member 'WBP_InGameMainMenu_C_SetupAllAttentionDot::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function WBP_InGameMainMenu.WBP_InGameMainMenu_C.SetupBgText
// 0x0038 (0x0038 - 0x0000)
struct WBP_InGameMainMenu_C_SetupBgText final
{
public:
	EPalUIInGameMainMenuTabType                   Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59E2[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    CallFunc_Map_Find_Value;                           // 0x0008(0x0010)(NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59E3[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLocalizedText_ReturnValue;             // 0x0020(0x0018)()
};
static_assert(alignof(WBP_InGameMainMenu_C_SetupBgText) == 0x000008, "Wrong alignment on WBP_InGameMainMenu_C_SetupBgText");
static_assert(sizeof(WBP_InGameMainMenu_C_SetupBgText) == 0x000038, "Wrong size on WBP_InGameMainMenu_C_SetupBgText");
static_assert(offsetof(WBP_InGameMainMenu_C_SetupBgText, Type) == 0x000000, "Member 'WBP_InGameMainMenu_C_SetupBgText::Type' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SetupBgText, CallFunc_Map_Find_Value) == 0x000008, "Member 'WBP_InGameMainMenu_C_SetupBgText::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SetupBgText, CallFunc_Map_Find_ReturnValue) == 0x000018, "Member 'WBP_InGameMainMenu_C_SetupBgText::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SetupBgText, CallFunc_GetLocalizedText_ReturnValue) == 0x000020, "Member 'WBP_InGameMainMenu_C_SetupBgText::CallFunc_GetLocalizedText_ReturnValue' has a wrong offset!");

// Function WBP_InGameMainMenu.WBP_InGameMainMenu_C.SetupInputAction
// 0x004C (0x004C - 0x0000)
struct WBP_InGameMainMenu_C_SetupInputAction final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue;        // 0x0020(0x0004)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue_1;      // 0x0034(0x0004)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue_2;      // 0x0048(0x0004)(NoDestructor)
};
static_assert(alignof(WBP_InGameMainMenu_C_SetupInputAction) == 0x000004, "Wrong alignment on WBP_InGameMainMenu_C_SetupInputAction");
static_assert(sizeof(WBP_InGameMainMenu_C_SetupInputAction) == 0x00004C, "Wrong size on WBP_InGameMainMenu_C_SetupInputAction");
static_assert(offsetof(WBP_InGameMainMenu_C_SetupInputAction, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_InGameMainMenu_C_SetupInputAction::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SetupInputAction, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'WBP_InGameMainMenu_C_SetupInputAction::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_InGameMainMenu_C_SetupInputAction, CallFunc_RegisterActionBinding_ReturnValue) == 0x000020, "Member 'WBP_InGameMainMenu_C_SetupInputAction::CallFunc_RegisterActionBinding_ReturnValue' has a wrong offset!");
