#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PalHUD_InGame_InputListener

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Pal_structs.hpp"
#include "EPalUIInGameMainMenuTabType_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_PalHUD_InGame_InputListener.WBP_PalHUD_InGame_InputListener_C.CanOpenAnyUI
// 0x0018 (0x0018 - 0x0000)
struct WBP_PalHUD_InGame_InputListener_C_CanOpenAnyUI final
{
public:
	bool                                          CanOpenUI;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59F2[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalHUD_InGame_InputListener_C_CanOpenAnyUI) == 0x000008, "Wrong alignment on WBP_PalHUD_InGame_InputListener_C_CanOpenAnyUI");
static_assert(sizeof(WBP_PalHUD_InGame_InputListener_C_CanOpenAnyUI) == 0x000018, "Wrong size on WBP_PalHUD_InGame_InputListener_C_CanOpenAnyUI");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_CanOpenAnyUI, CanOpenUI) == 0x000000, "Member 'WBP_PalHUD_InGame_InputListener_C_CanOpenAnyUI::CanOpenUI' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_CanOpenAnyUI, CallFunc_GetPalmi_ReturnValue) == 0x000008, "Member 'WBP_PalHUD_InGame_InputListener_C_CanOpenAnyUI::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_CanOpenAnyUI, CallFunc_IsDead_ReturnValue) == 0x000010, "Member 'WBP_PalHUD_InGame_InputListener_C_CanOpenAnyUI::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_CanOpenAnyUI, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'WBP_PalHUD_InGame_InputListener_C_CanOpenAnyUI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_CanOpenAnyUI, CallFunc_Not_PreBool_ReturnValue) == 0x000012, "Member 'WBP_PalHUD_InGame_InputListener_C_CanOpenAnyUI::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_PalHUD_InGame_InputListener.WBP_PalHUD_InGame_InputListener_C.CREATEDELEGATE_PROXYFUNCTION_0
// 0x02C0 (0x02C0 - 0x0000)
struct WBP_PalHUD_InGame_InputListener_C_CREATEDELEGATE_PROXYFUNCTION_0 final
{
public:
	struct FPalKeyConfigSettings                  PrevSettings;                                      // 0x0000(0x0160)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPalKeyConfigSettings                  NewSettings;                                       // 0x0160(0x0160)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_PalHUD_InGame_InputListener_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000008, "Wrong alignment on WBP_PalHUD_InGame_InputListener_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(sizeof(WBP_PalHUD_InGame_InputListener_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x0002C0, "Wrong size on WBP_PalHUD_InGame_InputListener_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_CREATEDELEGATE_PROXYFUNCTION_0, PrevSettings) == 0x000000, "Member 'WBP_PalHUD_InGame_InputListener_C_CREATEDELEGATE_PROXYFUNCTION_0::PrevSettings' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_CREATEDELEGATE_PROXYFUNCTION_0, NewSettings) == 0x000160, "Member 'WBP_PalHUD_InGame_InputListener_C_CREATEDELEGATE_PROXYFUNCTION_0::NewSettings' has a wrong offset!");

// Function WBP_PalHUD_InGame_InputListener.WBP_PalHUD_InGame_InputListener_C.ExecuteUbergraph_WBP_PalHUD_InGame_InputListener
// 0x0070 (0x0070 - 0x0000)
struct WBP_PalHUD_InGame_InputListener_C_ExecuteUbergraph_WBP_PalHUD_InGame_InputListener final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59F3[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59F4[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalDebugSetting*                       CallFunc_GetPalDebugSetting_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59F5[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue;        // 0x006C(0x0004)(NoDestructor)
};
static_assert(alignof(WBP_PalHUD_InGame_InputListener_C_ExecuteUbergraph_WBP_PalHUD_InGame_InputListener) == 0x000008, "Wrong alignment on WBP_PalHUD_InGame_InputListener_C_ExecuteUbergraph_WBP_PalHUD_InGame_InputListener");
static_assert(sizeof(WBP_PalHUD_InGame_InputListener_C_ExecuteUbergraph_WBP_PalHUD_InGame_InputListener) == 0x000070, "Wrong size on WBP_PalHUD_InGame_InputListener_C_ExecuteUbergraph_WBP_PalHUD_InGame_InputListener");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_ExecuteUbergraph_WBP_PalHUD_InGame_InputListener, EntryPoint) == 0x000000, "Member 'WBP_PalHUD_InGame_InputListener_C_ExecuteUbergraph_WBP_PalHUD_InGame_InputListener::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_ExecuteUbergraph_WBP_PalHUD_InGame_InputListener, K2Node_Event_MyGeometry) == 0x000008, "Member 'WBP_PalHUD_InGame_InputListener_C_ExecuteUbergraph_WBP_PalHUD_InGame_InputListener::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_ExecuteUbergraph_WBP_PalHUD_InGame_InputListener, K2Node_Event_InDeltaTime) == 0x000048, "Member 'WBP_PalHUD_InGame_InputListener_C_ExecuteUbergraph_WBP_PalHUD_InGame_InputListener::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_ExecuteUbergraph_WBP_PalHUD_InGame_InputListener, CallFunc_GetPalDebugSetting_ReturnValue) == 0x000050, "Member 'WBP_PalHUD_InGame_InputListener_C_ExecuteUbergraph_WBP_PalHUD_InGame_InputListener::CallFunc_GetPalDebugSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_ExecuteUbergraph_WBP_PalHUD_InGame_InputListener, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'WBP_PalHUD_InGame_InputListener_C_ExecuteUbergraph_WBP_PalHUD_InGame_InputListener::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_ExecuteUbergraph_WBP_PalHUD_InGame_InputListener, K2Node_CreateDelegate_OutputDelegate) == 0x00005C, "Member 'WBP_PalHUD_InGame_InputListener_C_ExecuteUbergraph_WBP_PalHUD_InGame_InputListener::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_ExecuteUbergraph_WBP_PalHUD_InGame_InputListener, CallFunc_RegisterActionBinding_ReturnValue) == 0x00006C, "Member 'WBP_PalHUD_InGame_InputListener_C_ExecuteUbergraph_WBP_PalHUD_InGame_InputListener::CallFunc_RegisterActionBinding_ReturnValue' has a wrong offset!");

// Function WBP_PalHUD_InGame_InputListener.WBP_PalHUD_InGame_InputListener_C.OnKeyConfigChanged
// 0x0310 (0x0310 - 0x0000)
struct WBP_PalHUD_InGame_InputListener_C_OnKeyConfigChanged final
{
public:
	struct FPalKeyConfigSettings                  PreSetting;                                        // 0x0000(0x0160)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FPalKeyConfigSettings                  NewSetting;                                        // 0x0160(0x0160)(BlueprintVisible, BlueprintReadOnly, Parm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x02C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue;        // 0x02D0(0x0004)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x02D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x02E4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue_1;      // 0x02F4(0x0004)(NoDestructor)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue_2;      // 0x02F8(0x0004)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x02FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue_3;      // 0x030C(0x0004)(NoDestructor)
};
static_assert(alignof(WBP_PalHUD_InGame_InputListener_C_OnKeyConfigChanged) == 0x000008, "Wrong alignment on WBP_PalHUD_InGame_InputListener_C_OnKeyConfigChanged");
static_assert(sizeof(WBP_PalHUD_InGame_InputListener_C_OnKeyConfigChanged) == 0x000310, "Wrong size on WBP_PalHUD_InGame_InputListener_C_OnKeyConfigChanged");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OnKeyConfigChanged, PreSetting) == 0x000000, "Member 'WBP_PalHUD_InGame_InputListener_C_OnKeyConfigChanged::PreSetting' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OnKeyConfigChanged, NewSetting) == 0x000160, "Member 'WBP_PalHUD_InGame_InputListener_C_OnKeyConfigChanged::NewSetting' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OnKeyConfigChanged, K2Node_CreateDelegate_OutputDelegate) == 0x0002C0, "Member 'WBP_PalHUD_InGame_InputListener_C_OnKeyConfigChanged::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OnKeyConfigChanged, CallFunc_RegisterActionBinding_ReturnValue) == 0x0002D0, "Member 'WBP_PalHUD_InGame_InputListener_C_OnKeyConfigChanged::CallFunc_RegisterActionBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OnKeyConfigChanged, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002D4, "Member 'WBP_PalHUD_InGame_InputListener_C_OnKeyConfigChanged::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OnKeyConfigChanged, K2Node_CreateDelegate_OutputDelegate_2) == 0x0002E4, "Member 'WBP_PalHUD_InGame_InputListener_C_OnKeyConfigChanged::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OnKeyConfigChanged, CallFunc_RegisterActionBinding_ReturnValue_1) == 0x0002F4, "Member 'WBP_PalHUD_InGame_InputListener_C_OnKeyConfigChanged::CallFunc_RegisterActionBinding_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OnKeyConfigChanged, CallFunc_RegisterActionBinding_ReturnValue_2) == 0x0002F8, "Member 'WBP_PalHUD_InGame_InputListener_C_OnKeyConfigChanged::CallFunc_RegisterActionBinding_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OnKeyConfigChanged, K2Node_CreateDelegate_OutputDelegate_3) == 0x0002FC, "Member 'WBP_PalHUD_InGame_InputListener_C_OnKeyConfigChanged::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OnKeyConfigChanged, CallFunc_RegisterActionBinding_ReturnValue_3) == 0x00030C, "Member 'WBP_PalHUD_InGame_InputListener_C_OnKeyConfigChanged::CallFunc_RegisterActionBinding_ReturnValue_3' has a wrong offset!");

// Function WBP_PalHUD_InGame_InputListener.WBP_PalHUD_InGame_InputListener_C.OnTriggerEscape
// 0x0001 (0x0001 - 0x0000)
struct WBP_PalHUD_InGame_InputListener_C_OnTriggerEscape final
{
public:
	bool                                          CallFunc_IsAnyMenuOpened_IsOpened;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalHUD_InGame_InputListener_C_OnTriggerEscape) == 0x000001, "Wrong alignment on WBP_PalHUD_InGame_InputListener_C_OnTriggerEscape");
static_assert(sizeof(WBP_PalHUD_InGame_InputListener_C_OnTriggerEscape) == 0x000001, "Wrong size on WBP_PalHUD_InGame_InputListener_C_OnTriggerEscape");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OnTriggerEscape, CallFunc_IsAnyMenuOpened_IsOpened) == 0x000000, "Member 'WBP_PalHUD_InGame_InputListener_C_OnTriggerEscape::CallFunc_IsAnyMenuOpened_IsOpened' has a wrong offset!");

// Function WBP_PalHUD_InGame_InputListener.WBP_PalHUD_InGame_InputListener_C.OnTriggerWorldMap
// 0x0030 (0x0030 - 0x0000)
struct WBP_PalHUD_InGame_InputListener_C_OnTriggerWorldMap final
{
public:
	bool                                          CallFunc_CanOpenAnyUI_CanOpenUI;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59F6[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDService*                         CallFunc_GetHUDService_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalHUDDispatchParameter_WorldMap*      CallFunc_SpawnObject_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalHUDService*                         CallFunc_GetHUDService_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_ShowCommonUI_ReturnValue;                 // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalHUD_InGame_InputListener_C_OnTriggerWorldMap) == 0x000008, "Wrong alignment on WBP_PalHUD_InGame_InputListener_C_OnTriggerWorldMap");
static_assert(sizeof(WBP_PalHUD_InGame_InputListener_C_OnTriggerWorldMap) == 0x000030, "Wrong size on WBP_PalHUD_InGame_InputListener_C_OnTriggerWorldMap");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OnTriggerWorldMap, CallFunc_CanOpenAnyUI_CanOpenUI) == 0x000000, "Member 'WBP_PalHUD_InGame_InputListener_C_OnTriggerWorldMap::CallFunc_CanOpenAnyUI_CanOpenUI' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OnTriggerWorldMap, CallFunc_GetHUDService_ReturnValue) == 0x000008, "Member 'WBP_PalHUD_InGame_InputListener_C_OnTriggerWorldMap::CallFunc_GetHUDService_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OnTriggerWorldMap, CallFunc_SpawnObject_ReturnValue) == 0x000010, "Member 'WBP_PalHUD_InGame_InputListener_C_OnTriggerWorldMap::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OnTriggerWorldMap, CallFunc_GetHUDService_ReturnValue_1) == 0x000018, "Member 'WBP_PalHUD_InGame_InputListener_C_OnTriggerWorldMap::CallFunc_GetHUDService_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OnTriggerWorldMap, CallFunc_ShowCommonUI_ReturnValue) == 0x000020, "Member 'WBP_PalHUD_InGame_InputListener_C_OnTriggerWorldMap::CallFunc_ShowCommonUI_ReturnValue' has a wrong offset!");

// Function WBP_PalHUD_InGame_InputListener.WBP_PalHUD_InGame_InputListener_C.OpenBuildMenu
// 0x0008 (0x0008 - 0x0000)
struct WBP_PalHUD_InGame_InputListener_C_OpenBuildMenu final
{
public:
	int32                                         BuildObjectTypeA;                                  // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalBuildObjectTypeA                          CallFunc_ToBuildObjectTypeA_ReturnValue;           // 0x0005(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalHUD_InGame_InputListener_C_OpenBuildMenu) == 0x000004, "Wrong alignment on WBP_PalHUD_InGame_InputListener_C_OpenBuildMenu");
static_assert(sizeof(WBP_PalHUD_InGame_InputListener_C_OpenBuildMenu) == 0x000008, "Wrong size on WBP_PalHUD_InGame_InputListener_C_OpenBuildMenu");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OpenBuildMenu, BuildObjectTypeA) == 0x000000, "Member 'WBP_PalHUD_InGame_InputListener_C_OpenBuildMenu::BuildObjectTypeA' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OpenBuildMenu, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000004, "Member 'WBP_PalHUD_InGame_InputListener_C_OpenBuildMenu::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OpenBuildMenu, CallFunc_ToBuildObjectTypeA_ReturnValue) == 0x000005, "Member 'WBP_PalHUD_InGame_InputListener_C_OpenBuildMenu::CallFunc_ToBuildObjectTypeA_ReturnValue' has a wrong offset!");

// Function WBP_PalHUD_InGame_InputListener.WBP_PalHUD_InGame_InputListener_C.OpenBuildRadialMenu
// 0x000C (0x000C - 0x0000)
struct WBP_PalHUD_InGame_InputListener_C_OpenBuildRadialMenu final
{
public:
	class FName                                   BuildObjectId;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalBuildObjectTypeA                          SelectObjectType;                                  // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanOpenAnyUI_CanOpenUI;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalHUD_InGame_InputListener_C_OpenBuildRadialMenu) == 0x000004, "Wrong alignment on WBP_PalHUD_InGame_InputListener_C_OpenBuildRadialMenu");
static_assert(sizeof(WBP_PalHUD_InGame_InputListener_C_OpenBuildRadialMenu) == 0x00000C, "Wrong size on WBP_PalHUD_InGame_InputListener_C_OpenBuildRadialMenu");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OpenBuildRadialMenu, BuildObjectId) == 0x000000, "Member 'WBP_PalHUD_InGame_InputListener_C_OpenBuildRadialMenu::BuildObjectId' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OpenBuildRadialMenu, SelectObjectType) == 0x000008, "Member 'WBP_PalHUD_InGame_InputListener_C_OpenBuildRadialMenu::SelectObjectType' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OpenBuildRadialMenu, CallFunc_CanOpenAnyUI_CanOpenUI) == 0x000009, "Member 'WBP_PalHUD_InGame_InputListener_C_OpenBuildRadialMenu::CallFunc_CanOpenAnyUI_CanOpenUI' has a wrong offset!");

// Function WBP_PalHUD_InGame_InputListener.WBP_PalHUD_InGame_InputListener_C.OpenBuildRadialMenuWithSelectedIndex
// 0x0008 (0x0008 - 0x0000)
struct WBP_PalHUD_InGame_InputListener_C_OpenBuildRadialMenuWithSelectedIndex final
{
public:
	int32                                         SelectedIndex;                                     // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanOpenAnyUI_CanOpenUI;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalHUD_InGame_InputListener_C_OpenBuildRadialMenuWithSelectedIndex) == 0x000004, "Wrong alignment on WBP_PalHUD_InGame_InputListener_C_OpenBuildRadialMenuWithSelectedIndex");
static_assert(sizeof(WBP_PalHUD_InGame_InputListener_C_OpenBuildRadialMenuWithSelectedIndex) == 0x000008, "Wrong size on WBP_PalHUD_InGame_InputListener_C_OpenBuildRadialMenuWithSelectedIndex");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OpenBuildRadialMenuWithSelectedIndex, SelectedIndex) == 0x000000, "Member 'WBP_PalHUD_InGame_InputListener_C_OpenBuildRadialMenuWithSelectedIndex::SelectedIndex' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OpenBuildRadialMenuWithSelectedIndex, CallFunc_CanOpenAnyUI_CanOpenUI) == 0x000004, "Member 'WBP_PalHUD_InGame_InputListener_C_OpenBuildRadialMenuWithSelectedIndex::CallFunc_CanOpenAnyUI_CanOpenUI' has a wrong offset!");

// Function WBP_PalHUD_InGame_InputListener.WBP_PalHUD_InGame_InputListener_C.OpenChat
// 0x0018 (0x0018 - 0x0000)
struct WBP_PalHUD_InGame_InputListener_C_OpenChat final
{
public:
	bool                                          CallFunc_CanChat_Result;                           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59F7[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue;        // 0x0014(0x0004)(NoDestructor)
};
static_assert(alignof(WBP_PalHUD_InGame_InputListener_C_OpenChat) == 0x000004, "Wrong alignment on WBP_PalHUD_InGame_InputListener_C_OpenChat");
static_assert(sizeof(WBP_PalHUD_InGame_InputListener_C_OpenChat) == 0x000018, "Wrong size on WBP_PalHUD_InGame_InputListener_C_OpenChat");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OpenChat, CallFunc_CanChat_Result) == 0x000000, "Member 'WBP_PalHUD_InGame_InputListener_C_OpenChat::CallFunc_CanChat_Result' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OpenChat, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_PalHUD_InGame_InputListener_C_OpenChat::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OpenChat, CallFunc_RegisterActionBinding_ReturnValue) == 0x000014, "Member 'WBP_PalHUD_InGame_InputListener_C_OpenChat::CallFunc_RegisterActionBinding_ReturnValue' has a wrong offset!");

// Function WBP_PalHUD_InGame_InputListener.WBP_PalHUD_InGame_InputListener_C.OpenMenu_Internal
// 0x0028 (0x0028 - 0x0000)
struct WBP_PalHUD_InGame_InputListener_C_OpenMenu_Internal final
{
public:
	EPalUIInGameMainMenuTabType                   TabType;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalBuildObjectTypeA                          BuildObjectTypeA;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanOpenAnyUI_CanOpenUI;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59F8[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDService*                         CallFunc_GetHUDService_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_InGameMainMenuParameter_C*          CallFunc_SpawnObject_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_Push_ReturnValue;                         // 0x0018(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalHUD_InGame_InputListener_C_OpenMenu_Internal) == 0x000008, "Wrong alignment on WBP_PalHUD_InGame_InputListener_C_OpenMenu_Internal");
static_assert(sizeof(WBP_PalHUD_InGame_InputListener_C_OpenMenu_Internal) == 0x000028, "Wrong size on WBP_PalHUD_InGame_InputListener_C_OpenMenu_Internal");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OpenMenu_Internal, TabType) == 0x000000, "Member 'WBP_PalHUD_InGame_InputListener_C_OpenMenu_Internal::TabType' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OpenMenu_Internal, BuildObjectTypeA) == 0x000001, "Member 'WBP_PalHUD_InGame_InputListener_C_OpenMenu_Internal::BuildObjectTypeA' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OpenMenu_Internal, CallFunc_CanOpenAnyUI_CanOpenUI) == 0x000002, "Member 'WBP_PalHUD_InGame_InputListener_C_OpenMenu_Internal::CallFunc_CanOpenAnyUI_CanOpenUI' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OpenMenu_Internal, CallFunc_GetHUDService_ReturnValue) == 0x000008, "Member 'WBP_PalHUD_InGame_InputListener_C_OpenMenu_Internal::CallFunc_GetHUDService_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OpenMenu_Internal, CallFunc_SpawnObject_ReturnValue) == 0x000010, "Member 'WBP_PalHUD_InGame_InputListener_C_OpenMenu_Internal::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_OpenMenu_Internal, CallFunc_Push_ReturnValue) == 0x000018, "Member 'WBP_PalHUD_InGame_InputListener_C_OpenMenu_Internal::CallFunc_Push_ReturnValue' has a wrong offset!");

// Function WBP_PalHUD_InGame_InputListener.WBP_PalHUD_InGame_InputListener_C.Setup Input Action
// 0x0090 (0x0090 - 0x0000)
struct WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action final
{
public:
	TDelegate<void(struct FPalKeyConfigSettings& PrevSettings, struct FPalKeyConfigSettings& NewSettings)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalOptionSubsystem*                    CallFunc_GetOptionSubsystem_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue;        // 0x0028(0x0004)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue_1;      // 0x003C(0x0004)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue_2;      // 0x0050(0x0004)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue_3;      // 0x0074(0x0004)(NoDestructor)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue_4;      // 0x0078(0x0004)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue_5;      // 0x008C(0x0004)(NoDestructor)
};
static_assert(alignof(WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action) == 0x000008, "Wrong alignment on WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action");
static_assert(sizeof(WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action) == 0x000090, "Wrong size on WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action, CallFunc_GetOptionSubsystem_ReturnValue) == 0x000010, "Member 'WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action::CallFunc_GetOptionSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action, CallFunc_RegisterActionBinding_ReturnValue) == 0x000028, "Member 'WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action::CallFunc_RegisterActionBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action, CallFunc_RegisterActionBinding_ReturnValue_1) == 0x00003C, "Member 'WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action::CallFunc_RegisterActionBinding_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action, K2Node_CreateDelegate_OutputDelegate_3) == 0x000040, "Member 'WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action, CallFunc_RegisterActionBinding_ReturnValue_2) == 0x000050, "Member 'WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action::CallFunc_RegisterActionBinding_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action, K2Node_CreateDelegate_OutputDelegate_4) == 0x000054, "Member 'WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action, K2Node_CreateDelegate_OutputDelegate_5) == 0x000064, "Member 'WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action, CallFunc_RegisterActionBinding_ReturnValue_3) == 0x000074, "Member 'WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action::CallFunc_RegisterActionBinding_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action, CallFunc_RegisterActionBinding_ReturnValue_4) == 0x000078, "Member 'WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action::CallFunc_RegisterActionBinding_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action, K2Node_CreateDelegate_OutputDelegate_6) == 0x00007C, "Member 'WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action, CallFunc_RegisterActionBinding_ReturnValue_5) == 0x00008C, "Member 'WBP_PalHUD_InGame_InputListener_C_Setup_Input_Action::CallFunc_RegisterActionBinding_ReturnValue_5' has a wrong offset!");

// Function WBP_PalHUD_InGame_InputListener.WBP_PalHUD_InGame_InputListener_C.Tick
// 0x0048 (0x0048 - 0x0000)
struct WBP_PalHUD_InGame_InputListener_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalHUD_InGame_InputListener_C_Tick) == 0x000008, "Wrong alignment on WBP_PalHUD_InGame_InputListener_C_Tick");
static_assert(sizeof(WBP_PalHUD_InGame_InputListener_C_Tick) == 0x000048, "Wrong size on WBP_PalHUD_InGame_InputListener_C_Tick");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_PalHUD_InGame_InputListener_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_InputListener_C_Tick, InDeltaTime) == 0x000040, "Member 'WBP_PalHUD_InGame_InputListener_C_Tick::InDeltaTime' has a wrong offset!");

}

