#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WorkerRadialMenu

#include "Basic.hpp"

#include "Pal_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_WorkerRadialMenu.WBP_WorkerRadialMenu_C.CreateContent
// 0x0030 (0x0030 - 0x0000)
struct WBP_WorkerRadialMenu_C_CreateContent final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWBP_WorkerRadialMenuContent_C*         CreatedWidget;                                     // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_WorkerRadialMenuContent_C*         CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorkerRadialMenu_C_CreateContent) == 0x000008, "Wrong alignment on WBP_WorkerRadialMenu_C_CreateContent");
static_assert(sizeof(WBP_WorkerRadialMenu_C_CreateContent) == 0x000030, "Wrong size on WBP_WorkerRadialMenu_C_CreateContent");
static_assert(offsetof(WBP_WorkerRadialMenu_C_CreateContent, Text) == 0x000000, "Member 'WBP_WorkerRadialMenu_C_CreateContent::Text' has a wrong offset!");
static_assert(offsetof(WBP_WorkerRadialMenu_C_CreateContent, CreatedWidget) == 0x000018, "Member 'WBP_WorkerRadialMenu_C_CreateContent::CreatedWidget' has a wrong offset!");
static_assert(offsetof(WBP_WorkerRadialMenu_C_CreateContent, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000020, "Member 'WBP_WorkerRadialMenu_C_CreateContent::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkerRadialMenu_C_CreateContent, CallFunc_Create_ReturnValue) == 0x000028, "Member 'WBP_WorkerRadialMenu_C_CreateContent::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WBP_WorkerRadialMenu.WBP_WorkerRadialMenu_C.ExecuteUbergraph_WBP_WorkerRadialMenu
// 0x0090 (0x0090 - 0x0000)
struct WBP_WorkerRadialMenu_C_ExecuteUbergraph_WBP_WorkerRadialMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E0F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E10[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerController*                   K2Node_DynamicCast_AsPal_Player_Controller;        // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E11[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Index)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E12[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue_1;   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerController*                   K2Node_DynamicCast_AsPal_Player_Controller_1;      // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorkerRadialMenu_C_ExecuteUbergraph_WBP_WorkerRadialMenu) == 0x000008, "Wrong alignment on WBP_WorkerRadialMenu_C_ExecuteUbergraph_WBP_WorkerRadialMenu");
static_assert(sizeof(WBP_WorkerRadialMenu_C_ExecuteUbergraph_WBP_WorkerRadialMenu) == 0x000090, "Wrong size on WBP_WorkerRadialMenu_C_ExecuteUbergraph_WBP_WorkerRadialMenu");
static_assert(offsetof(WBP_WorkerRadialMenu_C_ExecuteUbergraph_WBP_WorkerRadialMenu, EntryPoint) == 0x000000, "Member 'WBP_WorkerRadialMenu_C_ExecuteUbergraph_WBP_WorkerRadialMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_WorkerRadialMenu_C_ExecuteUbergraph_WBP_WorkerRadialMenu, K2Node_Event_MyGeometry) == 0x000008, "Member 'WBP_WorkerRadialMenu_C_ExecuteUbergraph_WBP_WorkerRadialMenu::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_WorkerRadialMenu_C_ExecuteUbergraph_WBP_WorkerRadialMenu, K2Node_Event_InDeltaTime) == 0x000048, "Member 'WBP_WorkerRadialMenu_C_ExecuteUbergraph_WBP_WorkerRadialMenu::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_WorkerRadialMenu_C_ExecuteUbergraph_WBP_WorkerRadialMenu, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000050, "Member 'WBP_WorkerRadialMenu_C_ExecuteUbergraph_WBP_WorkerRadialMenu::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkerRadialMenu_C_ExecuteUbergraph_WBP_WorkerRadialMenu, K2Node_DynamicCast_AsPal_Player_Controller) == 0x000058, "Member 'WBP_WorkerRadialMenu_C_ExecuteUbergraph_WBP_WorkerRadialMenu::K2Node_DynamicCast_AsPal_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_WorkerRadialMenu_C_ExecuteUbergraph_WBP_WorkerRadialMenu, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'WBP_WorkerRadialMenu_C_ExecuteUbergraph_WBP_WorkerRadialMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_WorkerRadialMenu_C_ExecuteUbergraph_WBP_WorkerRadialMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000064, "Member 'WBP_WorkerRadialMenu_C_ExecuteUbergraph_WBP_WorkerRadialMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_WorkerRadialMenu_C_ExecuteUbergraph_WBP_WorkerRadialMenu, CallFunc_GetLocalPlayerController_ReturnValue_1) == 0x000078, "Member 'WBP_WorkerRadialMenu_C_ExecuteUbergraph_WBP_WorkerRadialMenu::CallFunc_GetLocalPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkerRadialMenu_C_ExecuteUbergraph_WBP_WorkerRadialMenu, K2Node_DynamicCast_AsPal_Player_Controller_1) == 0x000080, "Member 'WBP_WorkerRadialMenu_C_ExecuteUbergraph_WBP_WorkerRadialMenu::K2Node_DynamicCast_AsPal_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkerRadialMenu_C_ExecuteUbergraph_WBP_WorkerRadialMenu, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'WBP_WorkerRadialMenu_C_ExecuteUbergraph_WBP_WorkerRadialMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function WBP_WorkerRadialMenu.WBP_WorkerRadialMenu_C.OnSelectedMenu__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_WorkerRadialMenu_C_OnSelectedMenu__DelegateSignature final
{
public:
	EPalWorkerRadialMenuResult                    Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorkerRadialMenu_C_OnSelectedMenu__DelegateSignature) == 0x000001, "Wrong alignment on WBP_WorkerRadialMenu_C_OnSelectedMenu__DelegateSignature");
static_assert(sizeof(WBP_WorkerRadialMenu_C_OnSelectedMenu__DelegateSignature) == 0x000001, "Wrong size on WBP_WorkerRadialMenu_C_OnSelectedMenu__DelegateSignature");
static_assert(offsetof(WBP_WorkerRadialMenu_C_OnSelectedMenu__DelegateSignature, Result) == 0x000000, "Member 'WBP_WorkerRadialMenu_C_OnSelectedMenu__DelegateSignature::Result' has a wrong offset!");

// Function WBP_WorkerRadialMenu.WBP_WorkerRadialMenu_C.OnSelectedMenu_Internal
// 0x0008 (0x0008 - 0x0000)
struct WBP_WorkerRadialMenu_C_OnSelectedMenu_Internal final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorkerRadialMenu_C_OnSelectedMenu_Internal) == 0x000004, "Wrong alignment on WBP_WorkerRadialMenu_C_OnSelectedMenu_Internal");
static_assert(sizeof(WBP_WorkerRadialMenu_C_OnSelectedMenu_Internal) == 0x000008, "Wrong size on WBP_WorkerRadialMenu_C_OnSelectedMenu_Internal");
static_assert(offsetof(WBP_WorkerRadialMenu_C_OnSelectedMenu_Internal, Param_Index) == 0x000000, "Member 'WBP_WorkerRadialMenu_C_OnSelectedMenu_Internal::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_WorkerRadialMenu_C_OnSelectedMenu_Internal, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WBP_WorkerRadialMenu_C_OnSelectedMenu_Internal::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WBP_WorkerRadialMenu.WBP_WorkerRadialMenu_C.SetupContents
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_WorkerRadialMenu_C_SetupContents final
{
public:
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text;          // 0x0000(0x0018)()
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_1;        // 0x0018(0x0018)()
	class UWBP_WorkerRadialMenuContent_C*         CallFunc_CreateContent_createdWidget;              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_WorkerRadialMenuContent_C*         CallFunc_CreateContent_createdWidget_1;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_Set_Additional_Widget_Canvas;             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_Set_Additional_Widget_Canvas_1;           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_2;        // 0x0050(0x0018)()
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_3;        // 0x0068(0x0018)()
	class UWBP_WorkerRadialMenuContent_C*         CallFunc_CreateContent_createdWidget_2;            // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_WorkerRadialMenuContent_C*         CallFunc_CreateContent_createdWidget_3;            // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_Set_Additional_Widget_Canvas_2;           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_Set_Additional_Widget_Canvas_3;           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_4;        // 0x00A0(0x0018)()
	class UWBP_WorkerRadialMenuContent_C*         CallFunc_CreateContent_createdWidget_4;            // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderTransformAngle_ReturnValue;      // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E13[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_Set_Additional_Widget_Canvas_4;           // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorkerRadialMenu_C_SetupContents) == 0x000008, "Wrong alignment on WBP_WorkerRadialMenu_C_SetupContents");
static_assert(sizeof(WBP_WorkerRadialMenu_C_SetupContents) == 0x0000D0, "Wrong size on WBP_WorkerRadialMenu_C_SetupContents");
static_assert(offsetof(WBP_WorkerRadialMenu_C_SetupContents, CallFunc_GetLocalizedTextFromHandle_Text) == 0x000000, "Member 'WBP_WorkerRadialMenu_C_SetupContents::CallFunc_GetLocalizedTextFromHandle_Text' has a wrong offset!");
static_assert(offsetof(WBP_WorkerRadialMenu_C_SetupContents, CallFunc_GetLocalizedTextFromHandle_Text_1) == 0x000018, "Member 'WBP_WorkerRadialMenu_C_SetupContents::CallFunc_GetLocalizedTextFromHandle_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkerRadialMenu_C_SetupContents, CallFunc_CreateContent_createdWidget) == 0x000030, "Member 'WBP_WorkerRadialMenu_C_SetupContents::CallFunc_CreateContent_createdWidget' has a wrong offset!");
static_assert(offsetof(WBP_WorkerRadialMenu_C_SetupContents, CallFunc_CreateContent_createdWidget_1) == 0x000038, "Member 'WBP_WorkerRadialMenu_C_SetupContents::CallFunc_CreateContent_createdWidget_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkerRadialMenu_C_SetupContents, CallFunc_Set_Additional_Widget_Canvas) == 0x000040, "Member 'WBP_WorkerRadialMenu_C_SetupContents::CallFunc_Set_Additional_Widget_Canvas' has a wrong offset!");
static_assert(offsetof(WBP_WorkerRadialMenu_C_SetupContents, CallFunc_Set_Additional_Widget_Canvas_1) == 0x000048, "Member 'WBP_WorkerRadialMenu_C_SetupContents::CallFunc_Set_Additional_Widget_Canvas_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkerRadialMenu_C_SetupContents, CallFunc_GetLocalizedTextFromHandle_Text_2) == 0x000050, "Member 'WBP_WorkerRadialMenu_C_SetupContents::CallFunc_GetLocalizedTextFromHandle_Text_2' has a wrong offset!");
static_assert(offsetof(WBP_WorkerRadialMenu_C_SetupContents, CallFunc_GetLocalizedTextFromHandle_Text_3) == 0x000068, "Member 'WBP_WorkerRadialMenu_C_SetupContents::CallFunc_GetLocalizedTextFromHandle_Text_3' has a wrong offset!");
static_assert(offsetof(WBP_WorkerRadialMenu_C_SetupContents, CallFunc_CreateContent_createdWidget_2) == 0x000080, "Member 'WBP_WorkerRadialMenu_C_SetupContents::CallFunc_CreateContent_createdWidget_2' has a wrong offset!");
static_assert(offsetof(WBP_WorkerRadialMenu_C_SetupContents, CallFunc_CreateContent_createdWidget_3) == 0x000088, "Member 'WBP_WorkerRadialMenu_C_SetupContents::CallFunc_CreateContent_createdWidget_3' has a wrong offset!");
static_assert(offsetof(WBP_WorkerRadialMenu_C_SetupContents, CallFunc_Set_Additional_Widget_Canvas_2) == 0x000090, "Member 'WBP_WorkerRadialMenu_C_SetupContents::CallFunc_Set_Additional_Widget_Canvas_2' has a wrong offset!");
static_assert(offsetof(WBP_WorkerRadialMenu_C_SetupContents, CallFunc_Set_Additional_Widget_Canvas_3) == 0x000098, "Member 'WBP_WorkerRadialMenu_C_SetupContents::CallFunc_Set_Additional_Widget_Canvas_3' has a wrong offset!");
static_assert(offsetof(WBP_WorkerRadialMenu_C_SetupContents, CallFunc_GetLocalizedTextFromHandle_Text_4) == 0x0000A0, "Member 'WBP_WorkerRadialMenu_C_SetupContents::CallFunc_GetLocalizedTextFromHandle_Text_4' has a wrong offset!");
static_assert(offsetof(WBP_WorkerRadialMenu_C_SetupContents, CallFunc_CreateContent_createdWidget_4) == 0x0000B8, "Member 'WBP_WorkerRadialMenu_C_SetupContents::CallFunc_CreateContent_createdWidget_4' has a wrong offset!");
static_assert(offsetof(WBP_WorkerRadialMenu_C_SetupContents, CallFunc_GetRenderTransformAngle_ReturnValue) == 0x0000C0, "Member 'WBP_WorkerRadialMenu_C_SetupContents::CallFunc_GetRenderTransformAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorkerRadialMenu_C_SetupContents, CallFunc_Set_Additional_Widget_Canvas_4) == 0x0000C8, "Member 'WBP_WorkerRadialMenu_C_SetupContents::CallFunc_Set_Additional_Widget_Canvas_4' has a wrong offset!");

// Function WBP_WorkerRadialMenu.WBP_WorkerRadialMenu_C.Tick
// 0x0048 (0x0048 - 0x0000)
struct WBP_WorkerRadialMenu_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorkerRadialMenu_C_Tick) == 0x000008, "Wrong alignment on WBP_WorkerRadialMenu_C_Tick");
static_assert(sizeof(WBP_WorkerRadialMenu_C_Tick) == 0x000048, "Wrong size on WBP_WorkerRadialMenu_C_Tick");
static_assert(offsetof(WBP_WorkerRadialMenu_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_WorkerRadialMenu_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_WorkerRadialMenu_C_Tick, InDeltaTime) == 0x000040, "Member 'WBP_WorkerRadialMenu_C_Tick::InDeltaTime' has a wrong offset!");

}

