#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenu_PalSkillInfo

#include "Basic.hpp"

#include "Pal_structs.hpp"
#include "E_PalUIStatusDIsplayParameter_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_MainMenu_PalSkillInfo.WBP_MainMenu_PalSkillInfo_C.ConvertToFoodRate
// 0x0005 (0x0005 - 0x0000)
struct WBP_MainMenu_PalSkillInfo_C_ConvertToFoodRate final
{
public:
	EPalPassiveSkillEffectType                    PassiveEffect;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalFoodStatusEffectType                      FoodEffect;                                        // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_PalSkillInfo_C_ConvertToFoodRate) == 0x000001, "Wrong alignment on WBP_MainMenu_PalSkillInfo_C_ConvertToFoodRate");
static_assert(sizeof(WBP_MainMenu_PalSkillInfo_C_ConvertToFoodRate) == 0x000005, "Wrong size on WBP_MainMenu_PalSkillInfo_C_ConvertToFoodRate");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ConvertToFoodRate, PassiveEffect) == 0x000000, "Member 'WBP_MainMenu_PalSkillInfo_C_ConvertToFoodRate::PassiveEffect' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ConvertToFoodRate, FoodEffect) == 0x000001, "Member 'WBP_MainMenu_PalSkillInfo_C_ConvertToFoodRate::FoodEffect' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ConvertToFoodRate, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'WBP_MainMenu_PalSkillInfo_C_ConvertToFoodRate::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ConvertToFoodRate, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000003, "Member 'WBP_MainMenu_PalSkillInfo_C_ConvertToFoodRate::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ConvertToFoodRate, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000004, "Member 'WBP_MainMenu_PalSkillInfo_C_ConvertToFoodRate::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");

// Function WBP_MainMenu_PalSkillInfo.WBP_MainMenu_PalSkillInfo_C.ExecuteUbergraph_WBP_MainMenu_PalSkillInfo
// 0x0580 (0x0580 - 0x0000)
struct WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_PalUIStatusDIsplayParameter                 Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_188F[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_PalUIStatusDIsplayParameter                 Temp_byte_Variable_1;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalPassiveSkillEffectType                    Temp_byte_Variable_2;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalPassiveSkillEffectType                    Temp_byte_Variable_3;                              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalPassiveSkillEffectType                    Temp_byte_Variable_4;                              // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalPassiveSkillEffectType                    Temp_byte_Variable_5;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalPassiveSkillEffectType                    Temp_byte_Variable_6;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalPassiveSkillEffectType                    Temp_byte_Variable_7;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalPassiveSkillEffectType                    Temp_byte_Variable_8;                              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalPassiveSkillEffectType                    Temp_byte_Variable_9;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_11;                             // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Title_1;                        // 0x0028(0x0018)()
	class FText                                   K2Node_CustomEvent_Info;                           // 0x0040(0x0018)()
	class FText                                   K2Node_CustomEvent_SubInfo;                        // 0x0058(0x0018)()
	class FText                                   K2Node_CustomEvent_Title;                          // 0x0070(0x0018)()
	class FText                                   K2Node_CustomEvent_Desc;                           // 0x0088(0x0018)()
	class UPalIndividualCharacterParameter*       K2Node_CustomEvent_IndividualParam;                // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_PalUIStatusDIsplayParameter                 K2Node_CustomEvent_StatusType;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsPlayer;                       // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1890[0x5];                                     // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_PlayerEquipInfoFormat_FormatText;         // 0x00B0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00C8(0x0050)(HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalBaseCampWorkerSickType                    CallFunc_GetWorkerSick_ReturnValue;                // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalPassiveSkillEffectType                    K2Node_Select_Default_1;                           // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1891[0x5];                                     // 0x011B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetWorkSickName_outName;                  // 0x0120(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalFoodStatusEffectType                      CallFunc_ConvertToFoodRate_FoodEffect;             // 0x013E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x013F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFoodStatusRate_ReturnValue;            // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRatePartnerSkill_ReturnValue;          // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRatePassiveSkill_ReturnValue;          // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCraftSpeedSickRate_ReturnValue;        // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_HungerParameterRate_ReturnValue;          // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1892[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFixedPoint64                          CallFunc_GetMaxHP_withBuff_ReturnValue;            // 0x0160(0x0008)(NoDestructor)
	class FText                                   CallFunc_SubInfoFormat_FormatText;                 // 0x0168(0x0018)()
	int32                                         CallFunc_Convert_FixedPoint64ToInt_ReturnValue;    // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1893[0x4];                                     // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0188(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxHP_ReturnValue;                     // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCraftSpeed_withBuff_ReturnValue;       // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCraftSpeed_ReturnValue;                // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDefense_ReturnValue;                   // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShotAttack_ReturnValue;                // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDefense_withBuff_ReturnValue;          // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShotAttack_withBuff_ReturnValue;       // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text;          // 0x01F8(0x0018)()
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_1;        // 0x0210(0x0018)()
	class FText                                   CallFunc_SubInfoFormat_FormatText_1;               // 0x0228(0x0018)()
	class FText                                   CallFunc_SubInfoFormat_FormatText_2;               // 0x0240(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0258(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_2;        // 0x02A8(0x0018)()
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_3;        // 0x02C0(0x0018)()
	class FText                                   CallFunc_SubInfoFormat_FormatText_3;               // 0x02D8(0x0018)()
	class FText                                   CallFunc_SubInfoFormat_FormatText_4;               // 0x02F0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0308(0x0050)(HasGetValueTypeHash)
	E_PalUIStatusDIsplayParameter                 Temp_byte_Variable_12;                             // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_13;                             // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1894[0x6];                                     // 0x035A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_WeightInfoFormat_FormatText;              // 0x0360(0x0018)()
	class FText                                   CallFunc_SelectText_ReturnValue;                   // 0x0378(0x0018)()
	class UPalPlayerInventoryData*                CallFunc_GetLocalInventoryData_ReturnValue;        // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0398(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1895[0x4];                                     // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0400(0x0018)()
	int32                                         K2Node_Select_Default_3;                           // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_14;                             // 0x041C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1896[0x3];                                     // 0x041D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0424(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0425(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1897[0x2];                                     // 0x0426(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0428(0x0018)()
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1898[0x7];                                     // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0448(0x0018)()
	class FText                                   CallFunc_SelectText_ReturnValue_1;                 // 0x0460(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0478(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x04C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x04D8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x04F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0500(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0510(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1899[0x7];                                     // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0528(0x0018)()
	double                                        CallFunc_SubInfoFormat_Value_ImplicitCast;         // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SubInfoFormat_Value_ImplicitCast_1;       // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SubInfoFormat_Value_ImplicitCast_2;       // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_A_ImplicitCast;               // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SubInfoFormat_Value_ImplicitCast_3;       // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo) == 0x000008, "Wrong alignment on WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo");
static_assert(sizeof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo) == 0x000580, "Wrong size on WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, EntryPoint) == 0x000000, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, Temp_int_Variable) == 0x000004, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, Temp_int_Variable_1) == 0x000008, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, Temp_byte_Variable) == 0x00000C, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, Temp_int_Variable_2) == 0x000010, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, Temp_int_Variable_3) == 0x000014, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, Temp_int_Variable_4) == 0x000018, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, Temp_byte_Variable_1) == 0x00001C, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, Temp_byte_Variable_2) == 0x00001D, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, Temp_byte_Variable_3) == 0x00001E, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, Temp_byte_Variable_4) == 0x00001F, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, Temp_byte_Variable_5) == 0x000020, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, Temp_byte_Variable_6) == 0x000021, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, Temp_byte_Variable_7) == 0x000022, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, Temp_byte_Variable_8) == 0x000023, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, Temp_byte_Variable_9) == 0x000024, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, Temp_bool_Variable) == 0x000025, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, Temp_byte_Variable_10) == 0x000026, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, Temp_byte_Variable_11) == 0x000027, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, K2Node_CustomEvent_Title_1) == 0x000028, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::K2Node_CustomEvent_Title_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, K2Node_CustomEvent_Info) == 0x000040, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::K2Node_CustomEvent_Info' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, K2Node_CustomEvent_SubInfo) == 0x000058, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::K2Node_CustomEvent_SubInfo' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, K2Node_CustomEvent_Title) == 0x000070, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::K2Node_CustomEvent_Title' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, K2Node_CustomEvent_Desc) == 0x000088, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::K2Node_CustomEvent_Desc' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, K2Node_CustomEvent_IndividualParam) == 0x0000A0, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::K2Node_CustomEvent_IndividualParam' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, K2Node_CustomEvent_StatusType) == 0x0000A8, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::K2Node_CustomEvent_StatusType' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, K2Node_CustomEvent_IsPlayer) == 0x0000A9, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::K2Node_CustomEvent_IsPlayer' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_TextIsEmpty_ReturnValue) == 0x0000AA, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_PlayerEquipInfoFormat_FormatText) == 0x0000B0, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_PlayerEquipInfoFormat_FormatText' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, K2Node_MakeStruct_FormatArgumentData) == 0x0000C8, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, K2Node_Select_Default) == 0x000118, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_GetWorkerSick_ReturnValue) == 0x000119, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_GetWorkerSick_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, K2Node_Select_Default_1) == 0x00011A, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_GetWorkSickName_outName) == 0x000120, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_GetWorkSickName_outName' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000138, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000139, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00013A, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x00013B, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x00013C, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_BooleanOR_ReturnValue) == 0x00013D, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_ConvertToFoodRate_FoodEffect) == 0x00013E, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_ConvertToFoodRate_FoodEffect' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_BooleanOR_ReturnValue_1) == 0x00013F, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_GetFoodStatusRate_ReturnValue) == 0x000140, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_GetFoodStatusRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_GetRatePartnerSkill_ReturnValue) == 0x000144, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_GetRatePartnerSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_GetRatePassiveSkill_ReturnValue) == 0x000148, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_GetRatePassiveSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_GetCraftSpeedSickRate_ReturnValue) == 0x00014C, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_GetCraftSpeedSickRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_HungerParameterRate_ReturnValue) == 0x000150, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_HungerParameterRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_SelectFloat_ReturnValue) == 0x000158, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_GetMaxHP_withBuff_ReturnValue) == 0x000160, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_GetMaxHP_withBuff_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_SubInfoFormat_FormatText) == 0x000168, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_SubInfoFormat_FormatText' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_Convert_FixedPoint64ToInt_ReturnValue) == 0x000180, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_Convert_FixedPoint64ToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, K2Node_MakeStruct_FormatArgumentData_1) == 0x000188, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_GetMaxHP_ReturnValue) == 0x0001D8, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_GetMaxHP_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_GetCraftSpeed_withBuff_ReturnValue) == 0x0001DC, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_GetCraftSpeed_withBuff_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_GetCraftSpeed_ReturnValue) == 0x0001E0, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_GetCraftSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_GetDefense_ReturnValue) == 0x0001E4, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_GetDefense_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_GetShotAttack_ReturnValue) == 0x0001E8, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_GetShotAttack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_GetDefense_withBuff_ReturnValue) == 0x0001EC, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_GetDefense_withBuff_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_GetShotAttack_withBuff_ReturnValue) == 0x0001F0, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_GetShotAttack_withBuff_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, Temp_int_Variable_5) == 0x0001F4, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_GetLocalizedTextFromHandle_Text) == 0x0001F8, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_GetLocalizedTextFromHandle_Text' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_GetLocalizedTextFromHandle_Text_1) == 0x000210, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_GetLocalizedTextFromHandle_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_SubInfoFormat_FormatText_1) == 0x000228, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_SubInfoFormat_FormatText_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_SubInfoFormat_FormatText_2) == 0x000240, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_SubInfoFormat_FormatText_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, K2Node_MakeStruct_FormatArgumentData_2) == 0x000258, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_GetLocalizedTextFromHandle_Text_2) == 0x0002A8, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_GetLocalizedTextFromHandle_Text_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_GetLocalizedTextFromHandle_Text_3) == 0x0002C0, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_GetLocalizedTextFromHandle_Text_3' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_SubInfoFormat_FormatText_3) == 0x0002D8, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_SubInfoFormat_FormatText_3' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_SubInfoFormat_FormatText_4) == 0x0002F0, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_SubInfoFormat_FormatText_4' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, K2Node_MakeStruct_FormatArgumentData_3) == 0x000308, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, Temp_byte_Variable_12) == 0x000358, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, Temp_byte_Variable_13) == 0x000359, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_WeightInfoFormat_FormatText) == 0x000360, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_WeightInfoFormat_FormatText' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_SelectText_ReturnValue) == 0x000378, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_SelectText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_GetLocalInventoryData_ReturnValue) == 0x000390, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_GetLocalInventoryData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, K2Node_MakeStruct_FormatArgumentData_4) == 0x000398, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_FTrunc_ReturnValue) == 0x0003E8, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0003F0, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, K2Node_Select_Default_2) == 0x0003F8, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_FTrunc_ReturnValue_1) == 0x0003FC, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x000400, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, K2Node_Select_Default_3) == 0x000418, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, Temp_byte_Variable_14) == 0x00041C, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::Temp_byte_Variable_14' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_Subtract_IntInt_ReturnValue) == 0x000420, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, Temp_bool_Variable_1) == 0x000424, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000425, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000428, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, K2Node_Select_Default_4) == 0x000440, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_MakeLiteralText_ReturnValue) == 0x000448, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_SelectText_ReturnValue_1) == 0x000460, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_SelectText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, K2Node_MakeStruct_FormatArgumentData_5) == 0x000478, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, K2Node_MakeArray_Array) == 0x0004C8, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_Format_ReturnValue) == 0x0004D8, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_Conv_TextToString_ReturnValue) == 0x0004F0, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_Split_LeftS) == 0x000500, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_Split_RightS) == 0x000510, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_Split_ReturnValue) == 0x000520, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_Conv_StringToText_ReturnValue) == 0x000528, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_SubInfoFormat_Value_ImplicitCast) == 0x000540, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_SubInfoFormat_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_SubInfoFormat_Value_ImplicitCast_1) == 0x000548, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_SubInfoFormat_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_SubInfoFormat_Value_ImplicitCast_2) == 0x000550, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_SubInfoFormat_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_SelectFloat_A_ImplicitCast) == 0x000558, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_SelectFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_SubInfoFormat_Value_ImplicitCast_3) == 0x000560, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_SubInfoFormat_Value_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_FTrunc_A_ImplicitCast) == 0x000568, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_FTrunc_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000570, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000578, "Member 'WBP_MainMenu_PalSkillInfo_C_ExecuteUbergraph_WBP_MainMenu_PalSkillInfo::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function WBP_MainMenu_PalSkillInfo.WBP_MainMenu_PalSkillInfo_C.PlayerEquipInfoFormat
// 0x0288 (0x0288 - 0x0000)
struct WBP_MainMenu_PalSkillInfo_C_PlayerEquipInfoFormat final
{
public:
	E_PalUIStatusDIsplayParameter                 Status;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlayer;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189A[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   FormatText;                                        // 0x0008(0x0018)(Parm, OutParm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189B[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189C[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0050)(HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189D[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_GetPlayerUIDByActor_ReturnValue;          // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text;          // 0x00A8(0x0018)()
	int32                                         CallFunc_GetPlayerEquipmentDefense_ReturnValue;    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189E[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C8(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerEquipmentHP_ReturnValue;         // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189F[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0120(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0138(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0150(0x0018)()
	class FText                                   CallFunc_SelectText_ReturnValue;                   // 0x0168(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0180(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01E0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01F8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0248(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0258(0x0018)()
	class FText                                   CallFunc_SelectText_ReturnValue_1;                 // 0x0270(0x0018)()
};
static_assert(alignof(WBP_MainMenu_PalSkillInfo_C_PlayerEquipInfoFormat) == 0x000008, "Wrong alignment on WBP_MainMenu_PalSkillInfo_C_PlayerEquipInfoFormat");
static_assert(sizeof(WBP_MainMenu_PalSkillInfo_C_PlayerEquipInfoFormat) == 0x000288, "Wrong size on WBP_MainMenu_PalSkillInfo_C_PlayerEquipInfoFormat");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_PlayerEquipInfoFormat, Status) == 0x000000, "Member 'WBP_MainMenu_PalSkillInfo_C_PlayerEquipInfoFormat::Status' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_PlayerEquipInfoFormat, IsPlayer) == 0x000001, "Member 'WBP_MainMenu_PalSkillInfo_C_PlayerEquipInfoFormat::IsPlayer' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_PlayerEquipInfoFormat, FormatText) == 0x000008, "Member 'WBP_MainMenu_PalSkillInfo_C_PlayerEquipInfoFormat::FormatText' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_PlayerEquipInfoFormat, CallFunc_Greater_IntInt_ReturnValue) == 0x000020, "Member 'WBP_MainMenu_PalSkillInfo_C_PlayerEquipInfoFormat::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_PlayerEquipInfoFormat, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000028, "Member 'WBP_MainMenu_PalSkillInfo_C_PlayerEquipInfoFormat::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_PlayerEquipInfoFormat, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000030, "Member 'WBP_MainMenu_PalSkillInfo_C_PlayerEquipInfoFormat::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_PlayerEquipInfoFormat, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'WBP_MainMenu_PalSkillInfo_C_PlayerEquipInfoFormat::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_PlayerEquipInfoFormat, K2Node_SwitchEnum_CmpSuccess) == 0x000088, "Member 'WBP_MainMenu_PalSkillInfo_C_PlayerEquipInfoFormat::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_PlayerEquipInfoFormat, CallFunc_GetPalmi_ReturnValue) == 0x000090, "Member 'WBP_MainMenu_PalSkillInfo_C_PlayerEquipInfoFormat::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillInfo_C_PlayerEquipInfoFormat, CallFunc_GetPlayerUIDByActor_ReturnValue) == 0x000098, "Member 'WBP_MainMenu_PalSkillInfo_C_PlayerEquipInfoFormat::CallFunc_GetPlayerUIDByActor_ReturnValue' has a wrong offset!");
