#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Buildup_Pal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Pal_structs.hpp"
#include "Pal_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Buildup_Pal.WBP_Buildup_Pal_C
// 0x0100 (0x0530 - 0x0430)
class UWBP_Buildup_Pal_C final : public UPalUserWidgetOverlayUI
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBox_Tab;                                 // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Select;                                            // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Buildup_Pal_Item_C*                WBP_Buildup_Pal_Item;                              // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Buildup_Pal_Item_C*                WBP_Buildup_Pal_Item_1;                            // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Buildup_Pal_Item_C*                WBP_Buildup_Pal_Item_2;                            // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Buildup_Pal_Status_C*              WBP_Buildup_Pal_Status;                            // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Buildup_TabButton_C*               WBP_Buildup_TabButton_Reset;                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Buildup_TabButton_C*               WBP_Buildup_TabButton_Upgrade;                     // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenu_PalBox_PalDetail_C*     WBP_IngameMenu_PalBox_PalDetail;                   // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_btn_C*                        WBP_Menu_btn;                                      // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_PalList_C*                    WBP_Menu_PalList;                                  // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_PalList_C*                    WBP_Menu_PalList_1;                                // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_PalList_C*                    WBP_Menu_PalList_2;                                // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_PalList_C*                    WBP_Menu_PalList_3;                                // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_PalList_C*                    WBP_Menu_PalList_4;                                // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalKeyGuideIcon_C*                 WBP_PalKeyGuideIcon_1;                             // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_Menu_PalList_C*>            PalList;                                           // 0x04B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UWBP_Buildup_Pal_Item_C*>        UpgradeItems;                                      // 0x04C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class FName>                           UpgradeItemIds;                                    // 0x04D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FDataTableRowHandle                    PreTabMsgId;                                       // 0x04E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    NextTabMsgId;                                      // 0x04F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UPalIndividualCharacterHandle*          CurrentHandle;                                     // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          PinDetail;                                         // 0x0510(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hovering;                                          // 0x0511(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49B2[0x2];                                     // 0x0512(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentTab;                                        // 0x0514(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ResultSuccess;                                     // 0x0518(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Replicate_Status;                                  // 0x0519(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Requested;                                         // 0x051A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49B3[0x5];                                     // 0x051B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           ItemUpdateTimer;                                   // 0x0520(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   TabActionName;                                     // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Buildup_Pal_WBP_Menu_btn_K2Node_ComponentBoundEvent_0_OnButtonClicked__DelegateSignature();
	void CloseAction();
	void Destruct();
	void ExecuteUbergraph_WBP_Buildup_Pal(int32 EntryPoint);
	void InvokeRankUp(EPalCharacterStatusOperationName Status, int32 TargetRank);
	void InvokeReset();
	void OnClickPalList(class UPalIndividualCharacterHandle* Handle);
	void OnHoverPalList(class UPalIndividualCharacterHandle* Handle);
	void OnSetup();
	void OnUnhoverPalList();
	void ReciveResult(EPalCharacterStatusOperationResult Result);
	void Refresh_Info();
	void Replicated_Status();
	void Setup();
	void SwitchReset();
	void SwitchTab(int32 Tab);
	void SwitchUpgrade();
	void SynchroCheck();
	void UpdateItemInfo();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Buildup_Pal_C">();
	}
	static class UWBP_Buildup_Pal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Buildup_Pal_C>();
	}
};
static_assert(alignof(UWBP_Buildup_Pal_C) == 0x000008, "Wrong alignment on UWBP_Buildup_Pal_C");
static_assert(sizeof(UWBP_Buildup_Pal_C) == 0x000530, "Wrong size on UWBP_Buildup_Pal_C");
static_assert(offsetof(UWBP_Buildup_Pal_C, UberGraphFrame) == 0x000430, "Member 'UWBP_Buildup_Pal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_C, HorizontalBox_Tab) == 0x000438, "Member 'UWBP_Buildup_Pal_C::HorizontalBox_Tab' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_C, Select) == 0x000440, "Member 'UWBP_Buildup_Pal_C::Select' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_C, WBP_Buildup_Pal_Item) == 0x000448, "Member 'UWBP_Buildup_Pal_C::WBP_Buildup_Pal_Item' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_C, WBP_Buildup_Pal_Item_1) == 0x000450, "Member 'UWBP_Buildup_Pal_C::WBP_Buildup_Pal_Item_1' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_C, WBP_Buildup_Pal_Item_2) == 0x000458, "Member 'UWBP_Buildup_Pal_C::WBP_Buildup_Pal_Item_2' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_C, WBP_Buildup_Pal_Status) == 0x000460, "Member 'UWBP_Buildup_Pal_C::WBP_Buildup_Pal_Status' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_C, WBP_Buildup_TabButton_Reset) == 0x000468, "Member 'UWBP_Buildup_Pal_C::WBP_Buildup_TabButton_Reset' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_C, WBP_Buildup_TabButton_Upgrade) == 0x000470, "Member 'UWBP_Buildup_Pal_C::WBP_Buildup_TabButton_Upgrade' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_C, WBP_IngameMenu_PalBox_PalDetail) == 0x000478, "Member 'UWBP_Buildup_Pal_C::WBP_IngameMenu_PalBox_PalDetail' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_C, WBP_Menu_btn) == 0x000480, "Member 'UWBP_Buildup_Pal_C::WBP_Menu_btn' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_C, WBP_Menu_PalList) == 0x000488, "Member 'UWBP_Buildup_Pal_C::WBP_Menu_PalList' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_C, WBP_Menu_PalList_1) == 0x000490, "Member 'UWBP_Buildup_Pal_C::WBP_Menu_PalList_1' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_C, WBP_Menu_PalList_2) == 0x000498, "Member 'UWBP_Buildup_Pal_C::WBP_Menu_PalList_2' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_C, WBP_Menu_PalList_3) == 0x0004A0, "Member 'UWBP_Buildup_Pal_C::WBP_Menu_PalList_3' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_C, WBP_Menu_PalList_4) == 0x0004A8, "Member 'UWBP_Buildup_Pal_C::WBP_Menu_PalList_4' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_C, WBP_PalKeyGuideIcon_1) == 0x0004B0, "Member 'UWBP_Buildup_Pal_C::WBP_PalKeyGuideIcon_1' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_C, PalList) == 0x0004B8, "Member 'UWBP_Buildup_Pal_C::PalList' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_C, UpgradeItems) == 0x0004C8, "Member 'UWBP_Buildup_Pal_C::UpgradeItems' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_C, UpgradeItemIds) == 0x0004D8, "Member 'UWBP_Buildup_Pal_C::UpgradeItemIds' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_C, PreTabMsgId) == 0x0004E8, "Member 'UWBP_Buildup_Pal_C::PreTabMsgId' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_C, NextTabMsgId) == 0x0004F8, "Member 'UWBP_Buildup_Pal_C::NextTabMsgId' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_C, CurrentHandle) == 0x000508, "Member 'UWBP_Buildup_Pal_C::CurrentHandle' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_C, PinDetail) == 0x000510, "Member 'UWBP_Buildup_Pal_C::PinDetail' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_C, Hovering) == 0x000511, "Member 'UWBP_Buildup_Pal_C::Hovering' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_C, CurrentTab) == 0x000514, "Member 'UWBP_Buildup_Pal_C::CurrentTab' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_C, ResultSuccess) == 0x000518, "Member 'UWBP_Buildup_Pal_C::ResultSuccess' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_C, Replicate_Status) == 0x000519, "Member 'UWBP_Buildup_Pal_C::Replicate_Status' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_C, Requested) == 0x00051A, "Member 'UWBP_Buildup_Pal_C::Requested' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_C, ItemUpdateTimer) == 0x000520, "Member 'UWBP_Buildup_Pal_C::ItemUpdateTimer' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_C, TabActionName) == 0x000528, "Member 'UWBP_Buildup_Pal_C::TabActionName' has a wrong offset!");

}

