#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ConvertItemStatusIndicator

#include "Basic.hpp"

#include "Pal_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_ConvertItemStatusIndicator.WBP_ConvertItemStatusIndicator_C.DisplayDetail
// 0x0020 (0x0020 - 0x0000)
struct WBP_ConvertItemStatusIndicator_C_DisplayDetail final
{
public:
	class UPalMapObjectWorkeeModule*              CallFunc_GetWorkeeModule_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481A[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalWorkProgress*                       CallFunc_GetWorkProgress_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConvertItemStatusIndicator_C_DisplayDetail) == 0x000008, "Wrong alignment on WBP_ConvertItemStatusIndicator_C_DisplayDetail");
static_assert(sizeof(WBP_ConvertItemStatusIndicator_C_DisplayDetail) == 0x000020, "Wrong size on WBP_ConvertItemStatusIndicator_C_DisplayDetail");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_DisplayDetail, CallFunc_GetWorkeeModule_ReturnValue) == 0x000000, "Member 'WBP_ConvertItemStatusIndicator_C_DisplayDetail::CallFunc_GetWorkeeModule_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_DisplayDetail, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_ConvertItemStatusIndicator_C_DisplayDetail::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_DisplayDetail, CallFunc_GetWorkProgress_ReturnValue) == 0x000010, "Member 'WBP_ConvertItemStatusIndicator_C_DisplayDetail::CallFunc_GetWorkProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_DisplayDetail, CallFunc_IsValid_ReturnValue_1) == 0x000018, "Member 'WBP_ConvertItemStatusIndicator_C_DisplayDetail::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_ConvertItemStatusIndicator.WBP_ConvertItemStatusIndicator_C.ExecuteUbergraph_WBP_ConvertItemStatusIndicator
// 0x0080 (0x0080 - 0x0000)
struct WBP_ConvertItemStatusIndicator_C_ExecuteUbergraph_WBP_ConvertItemStatusIndicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetMapObjectLocation_outVector;           // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481C[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalGameSetting*                        CallFunc_GetGameSetting_ReturnValue;               // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481D[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481E[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConvertItemStatusIndicator_C_ExecuteUbergraph_WBP_ConvertItemStatusIndicator) == 0x000008, "Wrong alignment on WBP_ConvertItemStatusIndicator_C_ExecuteUbergraph_WBP_ConvertItemStatusIndicator");
static_assert(sizeof(WBP_ConvertItemStatusIndicator_C_ExecuteUbergraph_WBP_ConvertItemStatusIndicator) == 0x000080, "Wrong size on WBP_ConvertItemStatusIndicator_C_ExecuteUbergraph_WBP_ConvertItemStatusIndicator");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_ExecuteUbergraph_WBP_ConvertItemStatusIndicator, EntryPoint) == 0x000000, "Member 'WBP_ConvertItemStatusIndicator_C_ExecuteUbergraph_WBP_ConvertItemStatusIndicator::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_ExecuteUbergraph_WBP_ConvertItemStatusIndicator, CallFunc_GetMapObjectLocation_outVector) == 0x000008, "Member 'WBP_ConvertItemStatusIndicator_C_ExecuteUbergraph_WBP_ConvertItemStatusIndicator::CallFunc_GetMapObjectLocation_outVector' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_ExecuteUbergraph_WBP_ConvertItemStatusIndicator, CallFunc_GetPalmi_ReturnValue) == 0x000020, "Member 'WBP_ConvertItemStatusIndicator_C_ExecuteUbergraph_WBP_ConvertItemStatusIndicator::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_ExecuteUbergraph_WBP_ConvertItemStatusIndicator, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WBP_ConvertItemStatusIndicator_C_ExecuteUbergraph_WBP_ConvertItemStatusIndicator::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_ExecuteUbergraph_WBP_ConvertItemStatusIndicator, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'WBP_ConvertItemStatusIndicator_C_ExecuteUbergraph_WBP_ConvertItemStatusIndicator::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_ExecuteUbergraph_WBP_ConvertItemStatusIndicator, CallFunc_Vector_Distance_ReturnValue) == 0x000048, "Member 'WBP_ConvertItemStatusIndicator_C_ExecuteUbergraph_WBP_ConvertItemStatusIndicator::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_ExecuteUbergraph_WBP_ConvertItemStatusIndicator, CallFunc_GetGameSetting_ReturnValue) == 0x000050, "Member 'WBP_ConvertItemStatusIndicator_C_ExecuteUbergraph_WBP_ConvertItemStatusIndicator::CallFunc_GetGameSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_ExecuteUbergraph_WBP_ConvertItemStatusIndicator, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000058, "Member 'WBP_ConvertItemStatusIndicator_C_ExecuteUbergraph_WBP_ConvertItemStatusIndicator::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_ExecuteUbergraph_WBP_ConvertItemStatusIndicator, K2Node_CreateDelegate_OutputDelegate) == 0x00005C, "Member 'WBP_ConvertItemStatusIndicator_C_ExecuteUbergraph_WBP_ConvertItemStatusIndicator::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_ExecuteUbergraph_WBP_ConvertItemStatusIndicator, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x00006C, "Member 'WBP_ConvertItemStatusIndicator_C_ExecuteUbergraph_WBP_ConvertItemStatusIndicator::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_ExecuteUbergraph_WBP_ConvertItemStatusIndicator, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000070, "Member 'WBP_ConvertItemStatusIndicator_C_ExecuteUbergraph_WBP_ConvertItemStatusIndicator::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_ExecuteUbergraph_WBP_ConvertItemStatusIndicator, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x000078, "Member 'WBP_ConvertItemStatusIndicator_C_ExecuteUbergraph_WBP_ConvertItemStatusIndicator::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function WBP_ConvertItemStatusIndicator.WBP_ConvertItemStatusIndicator_C.Initialize
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_ConvertItemStatusIndicator_C_Initialize final
{
public:
	class UPalMapObjectWorkeeModule*              CallFunc_GetWorkeeModule_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalWorkProgress*                       CallFunc_GetWorkProgress_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalMapObjectWorkeeModule*              CallFunc_GetWorkeeModule_ReturnValue_1;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalMapObjectWorkeeModule*              CallFunc_GetWorkeeModule_ReturnValue_2;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481F[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalWorkProgress*                       CallFunc_GetWorkProgress_ReturnValue_1;            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalWorkProgress*                       CallFunc_GetWorkProgress_ReturnValue_2;            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4820[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalItemSlot*                           CallFunc_GetProductSlot_ReturnValue;               // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPalWorkBase* Work)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalMapObjectEnergyModule*              CallFunc_GetEnergyModule_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPalItemSlot* Slot)>     K2Node_CreateDelegate_OutputDelegate_1;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPalWorkProgress* WorkProgress)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPalMapObjectConvertItemModel* Model)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPalMapObjectConvertItemModel* Model)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalHUDDispatchParameterBase*           CallFunc_GetParam_ReturnValue;                     // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalUIMapObjectStatusIndicatorParameterBase* K2Node_DynamicCast_AsPal_UIMap_Object_Status_Indicator_Parameter_Base; // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4821[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalMapObjectConcreteModelBase*         CallFunc_GetConcreteModel_ReturnValue;             // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalMapObjectConvertItemModel*          K2Node_DynamicCast_AsPal_Map_Object_Convert_Item_Model; // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConvertItemStatusIndicator_C_Initialize) == 0x000008, "Wrong alignment on WBP_ConvertItemStatusIndicator_C_Initialize");
static_assert(sizeof(WBP_ConvertItemStatusIndicator_C_Initialize) == 0x0000D0, "Wrong size on WBP_ConvertItemStatusIndicator_C_Initialize");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_Initialize, CallFunc_GetWorkeeModule_ReturnValue) == 0x000000, "Member 'WBP_ConvertItemStatusIndicator_C_Initialize::CallFunc_GetWorkeeModule_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_Initialize, CallFunc_GetWorkProgress_ReturnValue) == 0x000008, "Member 'WBP_ConvertItemStatusIndicator_C_Initialize::CallFunc_GetWorkProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_Initialize, CallFunc_GetWorkeeModule_ReturnValue_1) == 0x000010, "Member 'WBP_ConvertItemStatusIndicator_C_Initialize::CallFunc_GetWorkeeModule_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_Initialize, CallFunc_GetWorkeeModule_ReturnValue_2) == 0x000018, "Member 'WBP_ConvertItemStatusIndicator_C_Initialize::CallFunc_GetWorkeeModule_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_Initialize, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_ConvertItemStatusIndicator_C_Initialize::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_Initialize, CallFunc_GetWorkProgress_ReturnValue_1) == 0x000028, "Member 'WBP_ConvertItemStatusIndicator_C_Initialize::CallFunc_GetWorkProgress_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_Initialize, CallFunc_GetWorkProgress_ReturnValue_2) == 0x000030, "Member 'WBP_ConvertItemStatusIndicator_C_Initialize::CallFunc_GetWorkProgress_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_Initialize, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'WBP_ConvertItemStatusIndicator_C_Initialize::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_Initialize, CallFunc_GetProductSlot_ReturnValue) == 0x000040, "Member 'WBP_ConvertItemStatusIndicator_C_Initialize::CallFunc_GetProductSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_Initialize, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'WBP_ConvertItemStatusIndicator_C_Initialize::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_Initialize, CallFunc_GetEnergyModule_ReturnValue) == 0x000058, "Member 'WBP_ConvertItemStatusIndicator_C_Initialize::CallFunc_GetEnergyModule_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_Initialize, K2Node_CreateDelegate_OutputDelegate_1) == 0x000060, "Member 'WBP_ConvertItemStatusIndicator_C_Initialize::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_Initialize, K2Node_CreateDelegate_OutputDelegate_2) == 0x000070, "Member 'WBP_ConvertItemStatusIndicator_C_Initialize::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_Initialize, K2Node_CreateDelegate_OutputDelegate_3) == 0x000080, "Member 'WBP_ConvertItemStatusIndicator_C_Initialize::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_Initialize, K2Node_CreateDelegate_OutputDelegate_4) == 0x000090, "Member 'WBP_ConvertItemStatusIndicator_C_Initialize::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_Initialize, CallFunc_GetParam_ReturnValue) == 0x0000A0, "Member 'WBP_ConvertItemStatusIndicator_C_Initialize::CallFunc_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_Initialize, K2Node_DynamicCast_AsPal_UIMap_Object_Status_Indicator_Parameter_Base) == 0x0000A8, "Member 'WBP_ConvertItemStatusIndicator_C_Initialize::K2Node_DynamicCast_AsPal_UIMap_Object_Status_Indicator_Parameter_Base' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_Initialize, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'WBP_ConvertItemStatusIndicator_C_Initialize::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_Initialize, CallFunc_GetConcreteModel_ReturnValue) == 0x0000B8, "Member 'WBP_ConvertItemStatusIndicator_C_Initialize::CallFunc_GetConcreteModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_Initialize, K2Node_DynamicCast_AsPal_Map_Object_Convert_Item_Model) == 0x0000C0, "Member 'WBP_ConvertItemStatusIndicator_C_Initialize::K2Node_DynamicCast_AsPal_Map_Object_Convert_Item_Model' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_Initialize, K2Node_DynamicCast_bSuccess_1) == 0x0000C8, "Member 'WBP_ConvertItemStatusIndicator_C_Initialize::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function WBP_ConvertItemStatusIndicator.WBP_ConvertItemStatusIndicator_C.OnReflectWorkProgress
// 0x0018 (0x0018 - 0x0000)
struct WBP_ConvertItemStatusIndicator_C_OnReflectWorkProgress final
{
public:
	class UPalWorkProgress*                       WorkProgress;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetProgressRate_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4822[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetWorkProgressRate_rate_ImplicitCast;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConvertItemStatusIndicator_C_OnReflectWorkProgress) == 0x000008, "Wrong alignment on WBP_ConvertItemStatusIndicator_C_OnReflectWorkProgress");
static_assert(sizeof(WBP_ConvertItemStatusIndicator_C_OnReflectWorkProgress) == 0x000018, "Wrong size on WBP_ConvertItemStatusIndicator_C_OnReflectWorkProgress");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_OnReflectWorkProgress, WorkProgress) == 0x000000, "Member 'WBP_ConvertItemStatusIndicator_C_OnReflectWorkProgress::WorkProgress' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_OnReflectWorkProgress, CallFunc_GetProgressRate_ReturnValue) == 0x000008, "Member 'WBP_ConvertItemStatusIndicator_C_OnReflectWorkProgress::CallFunc_GetProgressRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_OnReflectWorkProgress, CallFunc_SetWorkProgressRate_rate_ImplicitCast) == 0x000010, "Member 'WBP_ConvertItemStatusIndicator_C_OnReflectWorkProgress::CallFunc_SetWorkProgressRate_rate_ImplicitCast' has a wrong offset!");

// Function WBP_ConvertItemStatusIndicator.WBP_ConvertItemStatusIndicator_C.OnUpdatedWorkerPal
// 0x0030 (0x0030 - 0x0000)
struct WBP_ConvertItemStatusIndicator_C_OnUpdatedWorkerPal final
{
public:
	class UPalWorkBase*                           Work;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPalWorkSuitability                           CallFunc_GetWorkSuitability_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4823[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_GetWorkId_ReturnValue;                    // 0x000C(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4824[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPalIndividualCharacterSlot*>    CallFunc_GetAssignedCharacters_IndividualSlots;    // 0x0020(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_ConvertItemStatusIndicator_C_OnUpdatedWorkerPal) == 0x000008, "Wrong alignment on WBP_ConvertItemStatusIndicator_C_OnUpdatedWorkerPal");
static_assert(sizeof(WBP_ConvertItemStatusIndicator_C_OnUpdatedWorkerPal) == 0x000030, "Wrong size on WBP_ConvertItemStatusIndicator_C_OnUpdatedWorkerPal");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_OnUpdatedWorkerPal, Work) == 0x000000, "Member 'WBP_ConvertItemStatusIndicator_C_OnUpdatedWorkerPal::Work' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_OnUpdatedWorkerPal, CallFunc_GetWorkSuitability_ReturnValue) == 0x000008, "Member 'WBP_ConvertItemStatusIndicator_C_OnUpdatedWorkerPal::CallFunc_GetWorkSuitability_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_OnUpdatedWorkerPal, CallFunc_GetWorkId_ReturnValue) == 0x00000C, "Member 'WBP_ConvertItemStatusIndicator_C_OnUpdatedWorkerPal::CallFunc_GetWorkId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_OnUpdatedWorkerPal, CallFunc_GetAssignedCharacters_IndividualSlots) == 0x000020, "Member 'WBP_ConvertItemStatusIndicator_C_OnUpdatedWorkerPal::CallFunc_GetAssignedCharacters_IndividualSlots' has a wrong offset!");

// Function WBP_ConvertItemStatusIndicator.WBP_ConvertItemStatusIndicator_C.OnUpdateProductSlot
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_ConvertItemStatusIndicator_C_OnUpdateProductSlot final
{
public:
	class UPalItemSlot*                           Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         RemainCreateNum;                                   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ProductStackCount;                                 // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRemainCreateNum_ReturnValue;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4825[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPalItemRecipe                         CallFunc_GetCurrentRecipe_ReturnValue;             // 0x0018(0x0070)()
	int32                                         CallFunc_GetRemainCreateNum_ReturnValue_1;         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsProductNumInfinite_ReturnValue;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4826[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStackCount_ReturnValue;                // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConvertItemStatusIndicator_C_OnUpdateProductSlot) == 0x000008, "Wrong alignment on WBP_ConvertItemStatusIndicator_C_OnUpdateProductSlot");
static_assert(sizeof(WBP_ConvertItemStatusIndicator_C_OnUpdateProductSlot) == 0x0000A0, "Wrong size on WBP_ConvertItemStatusIndicator_C_OnUpdateProductSlot");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_OnUpdateProductSlot, Param_Slot) == 0x000000, "Member 'WBP_ConvertItemStatusIndicator_C_OnUpdateProductSlot::Param_Slot' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_OnUpdateProductSlot, RemainCreateNum) == 0x000008, "Member 'WBP_ConvertItemStatusIndicator_C_OnUpdateProductSlot::RemainCreateNum' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_OnUpdateProductSlot, ProductStackCount) == 0x00000C, "Member 'WBP_ConvertItemStatusIndicator_C_OnUpdateProductSlot::ProductStackCount' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_OnUpdateProductSlot, CallFunc_GetRemainCreateNum_ReturnValue) == 0x000010, "Member 'WBP_ConvertItemStatusIndicator_C_OnUpdateProductSlot::CallFunc_GetRemainCreateNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_OnUpdateProductSlot, CallFunc_GetCurrentRecipe_ReturnValue) == 0x000018, "Member 'WBP_ConvertItemStatusIndicator_C_OnUpdateProductSlot::CallFunc_GetCurrentRecipe_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_OnUpdateProductSlot, CallFunc_GetRemainCreateNum_ReturnValue_1) == 0x000088, "Member 'WBP_ConvertItemStatusIndicator_C_OnUpdateProductSlot::CallFunc_GetRemainCreateNum_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_OnUpdateProductSlot, CallFunc_Multiply_IntInt_ReturnValue) == 0x00008C, "Member 'WBP_ConvertItemStatusIndicator_C_OnUpdateProductSlot::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_OnUpdateProductSlot, CallFunc_IsProductNumInfinite_ReturnValue) == 0x000090, "Member 'WBP_ConvertItemStatusIndicator_C_OnUpdateProductSlot::CallFunc_IsProductNumInfinite_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_OnUpdateProductSlot, CallFunc_Add_IntInt_ReturnValue) == 0x000094, "Member 'WBP_ConvertItemStatusIndicator_C_OnUpdateProductSlot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_OnUpdateProductSlot, CallFunc_GetStackCount_ReturnValue) == 0x000098, "Member 'WBP_ConvertItemStatusIndicator_C_OnUpdateProductSlot::CallFunc_GetStackCount_ReturnValue' has a wrong offset!");

// Function WBP_ConvertItemStatusIndicator.WBP_ConvertItemStatusIndicator_C.OnUpdateRecipe
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_ConvertItemStatusIndicator_C_OnUpdateRecipe final
{
public:
	class UPalMapObjectConvertItemModel*          Param_Model;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalItemRecipe                         CurrentRecipe;                                     // 0x0008(0x0070)(Edit, BlueprintVisible)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0079(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4827[0x6];                                     // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPalItemRecipe                         CallFunc_GetCurrentRecipe_ReturnValue;             // 0x0080(0x0070)()
};
static_assert(alignof(WBP_ConvertItemStatusIndicator_C_OnUpdateRecipe) == 0x000008, "Wrong alignment on WBP_ConvertItemStatusIndicator_C_OnUpdateRecipe");
static_assert(sizeof(WBP_ConvertItemStatusIndicator_C_OnUpdateRecipe) == 0x0000F0, "Wrong size on WBP_ConvertItemStatusIndicator_C_OnUpdateRecipe");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_OnUpdateRecipe, Param_Model) == 0x000000, "Member 'WBP_ConvertItemStatusIndicator_C_OnUpdateRecipe::Param_Model' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_OnUpdateRecipe, CurrentRecipe) == 0x000008, "Member 'WBP_ConvertItemStatusIndicator_C_OnUpdateRecipe::CurrentRecipe' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_OnUpdateRecipe, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'WBP_ConvertItemStatusIndicator_C_OnUpdateRecipe::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_OnUpdateRecipe, CallFunc_IsValid_ReturnValue_1) == 0x000079, "Member 'WBP_ConvertItemStatusIndicator_C_OnUpdateRecipe::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_OnUpdateRecipe, CallFunc_GetCurrentRecipe_ReturnValue) == 0x000080, "Member 'WBP_ConvertItemStatusIndicator_C_OnUpdateRecipe::CallFunc_GetCurrentRecipe_ReturnValue' has a wrong offset!");

// Function WBP_ConvertItemStatusIndicator.WBP_ConvertItemStatusIndicator_C.UpdateProductNum
// 0x0010 (0x0010 - 0x0000)
struct WBP_ConvertItemStatusIndicator_C_UpdateProductNum final
{
public:
	class UPalMapObjectConvertItemModel*          Param_Model;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalItemSlot*                           CallFunc_GetProductSlot_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConvertItemStatusIndicator_C_UpdateProductNum) == 0x000008, "Wrong alignment on WBP_ConvertItemStatusIndicator_C_UpdateProductNum");
static_assert(sizeof(WBP_ConvertItemStatusIndicator_C_UpdateProductNum) == 0x000010, "Wrong size on WBP_ConvertItemStatusIndicator_C_UpdateProductNum");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_UpdateProductNum, Param_Model) == 0x000000, "Member 'WBP_ConvertItemStatusIndicator_C_UpdateProductNum::Param_Model' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemStatusIndicator_C_UpdateProductNum, CallFunc_GetProductSlot_ReturnValue) == 0x000008, "Member 'WBP_ConvertItemStatusIndicator_C_UpdateProductNum::CallFunc_GetProductSlot_ReturnValue' has a wrong offset!");

}

