#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IngameMenu_WorkSpace_StartButton

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_IngameMenu_WorkSpace_StartButton.WBP_IngameMenu_WorkSpace_StartButton_C.BndEvt__WBP_IngameMenu_WorkSpace_StartButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_IngameMenu_WorkSpace_StartButton_C_BndEvt__WBP_IngameMenu_WorkSpace_StartButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_WorkSpace_StartButton_C_BndEvt__WBP_IngameMenu_WorkSpace_StartButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_IngameMenu_WorkSpace_StartButton_C_BndEvt__WBP_IngameMenu_WorkSpace_StartButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_IngameMenu_WorkSpace_StartButton_C_BndEvt__WBP_IngameMenu_WorkSpace_StartButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_IngameMenu_WorkSpace_StartButton_C_BndEvt__WBP_IngameMenu_WorkSpace_StartButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_IngameMenu_WorkSpace_StartButton_C_BndEvt__WBP_IngameMenu_WorkSpace_StartButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_IngameMenu_WorkSpace_StartButton_C_BndEvt__WBP_IngameMenu_WorkSpace_StartButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_IngameMenu_WorkSpace_StartButton.WBP_IngameMenu_WorkSpace_StartButton_C.ExecuteUbergraph_WBP_IngameMenu_WorkSpace_StartButton
// 0x0020 (0x0020 - 0x0000)
struct WBP_IngameMenu_WorkSpace_StartButton_C_ExecuteUbergraph_WBP_IngameMenu_WorkSpace_StartButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enable;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5768[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_WorkSpace_StartButton_C_ExecuteUbergraph_WBP_IngameMenu_WorkSpace_StartButton) == 0x000008, "Wrong alignment on WBP_IngameMenu_WorkSpace_StartButton_C_ExecuteUbergraph_WBP_IngameMenu_WorkSpace_StartButton");
static_assert(sizeof(WBP_IngameMenu_WorkSpace_StartButton_C_ExecuteUbergraph_WBP_IngameMenu_WorkSpace_StartButton) == 0x000020, "Wrong size on WBP_IngameMenu_WorkSpace_StartButton_C_ExecuteUbergraph_WBP_IngameMenu_WorkSpace_StartButton");
static_assert(offsetof(WBP_IngameMenu_WorkSpace_StartButton_C_ExecuteUbergraph_WBP_IngameMenu_WorkSpace_StartButton, EntryPoint) == 0x000000, "Member 'WBP_IngameMenu_WorkSpace_StartButton_C_ExecuteUbergraph_WBP_IngameMenu_WorkSpace_StartButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_WorkSpace_StartButton_C_ExecuteUbergraph_WBP_IngameMenu_WorkSpace_StartButton, Temp_bool_Variable) == 0x000004, "Member 'WBP_IngameMenu_WorkSpace_StartButton_C_ExecuteUbergraph_WBP_IngameMenu_WorkSpace_StartButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_WorkSpace_StartButton_C_ExecuteUbergraph_WBP_IngameMenu_WorkSpace_StartButton, Temp_byte_Variable) == 0x000005, "Member 'WBP_IngameMenu_WorkSpace_StartButton_C_ExecuteUbergraph_WBP_IngameMenu_WorkSpace_StartButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_WorkSpace_StartButton_C_ExecuteUbergraph_WBP_IngameMenu_WorkSpace_StartButton, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_IngameMenu_WorkSpace_StartButton_C_ExecuteUbergraph_WBP_IngameMenu_WorkSpace_StartButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_WorkSpace_StartButton_C_ExecuteUbergraph_WBP_IngameMenu_WorkSpace_StartButton, K2Node_CustomEvent_Enable) == 0x000007, "Member 'WBP_IngameMenu_WorkSpace_StartButton_C_ExecuteUbergraph_WBP_IngameMenu_WorkSpace_StartButton::K2Node_CustomEvent_Enable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_WorkSpace_StartButton_C_ExecuteUbergraph_WBP_IngameMenu_WorkSpace_StartButton, K2Node_Select_Default) == 0x000008, "Member 'WBP_IngameMenu_WorkSpace_StartButton_C_ExecuteUbergraph_WBP_IngameMenu_WorkSpace_StartButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_WorkSpace_StartButton_C_ExecuteUbergraph_WBP_IngameMenu_WorkSpace_StartButton, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000009, "Member 'WBP_IngameMenu_WorkSpace_StartButton_C_ExecuteUbergraph_WBP_IngameMenu_WorkSpace_StartButton::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_WorkSpace_StartButton_C_ExecuteUbergraph_WBP_IngameMenu_WorkSpace_StartButton, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WBP_IngameMenu_WorkSpace_StartButton_C_ExecuteUbergraph_WBP_IngameMenu_WorkSpace_StartButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_WorkSpace_StartButton_C_ExecuteUbergraph_WBP_IngameMenu_WorkSpace_StartButton, K2Node_ComponentBoundEvent_Button) == 0x000018, "Member 'WBP_IngameMenu_WorkSpace_StartButton_C_ExecuteUbergraph_WBP_IngameMenu_WorkSpace_StartButton::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function WBP_IngameMenu_WorkSpace_StartButton.WBP_IngameMenu_WorkSpace_StartButton_C.SetEnable
// 0x0001 (0x0001 - 0x0000)
struct WBP_IngameMenu_WorkSpace_StartButton_C_SetEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_WorkSpace_StartButton_C_SetEnable) == 0x000001, "Wrong alignment on WBP_IngameMenu_WorkSpace_StartButton_C_SetEnable");
static_assert(sizeof(WBP_IngameMenu_WorkSpace_StartButton_C_SetEnable) == 0x000001, "Wrong size on WBP_IngameMenu_WorkSpace_StartButton_C_SetEnable");
static_assert(offsetof(WBP_IngameMenu_WorkSpace_StartButton_C_SetEnable, Enable) == 0x000000, "Member 'WBP_IngameMenu_WorkSpace_StartButton_C_SetEnable::Enable' has a wrong offset!");

}

