#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_CharacterExpGauge

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Menu_CharacterExpGauge.WBP_Menu_CharacterExpGauge_C.ExecuteUbergraph_WBP_Menu_CharacterExpGauge
// 0x0024 (0x0024 - 0x0000)
struct WBP_Menu_CharacterExpGauge_C_ExecuteUbergraph_WBP_Menu_CharacterExpGauge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 NewLevel)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 AddExp, int32 OldExp, double NowExpRate)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_CharacterExpGauge_C_ExecuteUbergraph_WBP_Menu_CharacterExpGauge) == 0x000004, "Wrong alignment on WBP_Menu_CharacterExpGauge_C_ExecuteUbergraph_WBP_Menu_CharacterExpGauge");
static_assert(sizeof(WBP_Menu_CharacterExpGauge_C_ExecuteUbergraph_WBP_Menu_CharacterExpGauge) == 0x000024, "Wrong size on WBP_Menu_CharacterExpGauge_C_ExecuteUbergraph_WBP_Menu_CharacterExpGauge");
static_assert(offsetof(WBP_Menu_CharacterExpGauge_C_ExecuteUbergraph_WBP_Menu_CharacterExpGauge, EntryPoint) == 0x000000, "Member 'WBP_Menu_CharacterExpGauge_C_ExecuteUbergraph_WBP_Menu_CharacterExpGauge::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterExpGauge_C_ExecuteUbergraph_WBP_Menu_CharacterExpGauge, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Menu_CharacterExpGauge_C_ExecuteUbergraph_WBP_Menu_CharacterExpGauge::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterExpGauge_C_ExecuteUbergraph_WBP_Menu_CharacterExpGauge, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_Menu_CharacterExpGauge_C_ExecuteUbergraph_WBP_Menu_CharacterExpGauge::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WBP_Menu_CharacterExpGauge.WBP_Menu_CharacterExpGauge_C.UpdateExp
// 0x0068 (0x0068 - 0x0000)
struct WBP_Menu_CharacterExpGauge_C_UpdateExp final
{
public:
	int32                                         AddExp;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OldExp;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NowExpRate;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterHandle*          CallFunc_GetBindedHandle_targetHandle;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5844[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterParameter*       CallFunc_TryGetIndividualParameter_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLevel_ReturnValue;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5845[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalExpDatabase*                        CallFunc_GetExpDatabase_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNextExp_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5846[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0048(0x0018)()
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_CharacterExpGauge_C_UpdateExp) == 0x000008, "Wrong alignment on WBP_Menu_CharacterExpGauge_C_UpdateExp");
static_assert(sizeof(WBP_Menu_CharacterExpGauge_C_UpdateExp) == 0x000068, "Wrong size on WBP_Menu_CharacterExpGauge_C_UpdateExp");
static_assert(offsetof(WBP_Menu_CharacterExpGauge_C_UpdateExp, AddExp) == 0x000000, "Member 'WBP_Menu_CharacterExpGauge_C_UpdateExp::AddExp' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterExpGauge_C_UpdateExp, OldExp) == 0x000004, "Member 'WBP_Menu_CharacterExpGauge_C_UpdateExp::OldExp' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterExpGauge_C_UpdateExp, NowExpRate) == 0x000008, "Member 'WBP_Menu_CharacterExpGauge_C_UpdateExp::NowExpRate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterExpGauge_C_UpdateExp, CallFunc_GetBindedHandle_targetHandle) == 0x000010, "Member 'WBP_Menu_CharacterExpGauge_C_UpdateExp::CallFunc_GetBindedHandle_targetHandle' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterExpGauge_C_UpdateExp, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Menu_CharacterExpGauge_C_UpdateExp::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterExpGauge_C_UpdateExp, CallFunc_TryGetIndividualParameter_ReturnValue) == 0x000020, "Member 'WBP_Menu_CharacterExpGauge_C_UpdateExp::CallFunc_TryGetIndividualParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterExpGauge_C_UpdateExp, CallFunc_GetLevel_ReturnValue) == 0x000028, "Member 'WBP_Menu_CharacterExpGauge_C_UpdateExp::CallFunc_GetLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterExpGauge_C_UpdateExp, CallFunc_GetExpDatabase_ReturnValue) == 0x000030, "Member 'WBP_Menu_CharacterExpGauge_C_UpdateExp::CallFunc_GetExpDatabase_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterExpGauge_C_UpdateExp, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'WBP_Menu_CharacterExpGauge_C_UpdateExp::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterExpGauge_C_UpdateExp, CallFunc_GetNextExp_ReturnValue) == 0x00003C, "Member 'WBP_Menu_CharacterExpGauge_C_UpdateExp::CallFunc_GetNextExp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterExpGauge_C_UpdateExp, CallFunc_Subtract_IntInt_ReturnValue) == 0x000040, "Member 'WBP_Menu_CharacterExpGauge_C_UpdateExp::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterExpGauge_C_UpdateExp, CallFunc_Conv_IntToText_ReturnValue) == 0x000048, "Member 'WBP_Menu_CharacterExpGauge_C_UpdateExp::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterExpGauge_C_UpdateExp, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000060, "Member 'WBP_Menu_CharacterExpGauge_C_UpdateExp::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function WBP_Menu_CharacterExpGauge.WBP_Menu_CharacterExpGauge_C.UpdateLevel
// 0x0028 (0x0028 - 0x0000)
struct WBP_Menu_CharacterExpGauge_C_UpdateLevel final
{
public:
	int32                                         NewLevel;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5847[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_CharacterExpGauge_C_UpdateLevel) == 0x000008, "Wrong alignment on WBP_Menu_CharacterExpGauge_C_UpdateLevel");
static_assert(sizeof(WBP_Menu_CharacterExpGauge_C_UpdateLevel) == 0x000028, "Wrong size on WBP_Menu_CharacterExpGauge_C_UpdateLevel");
static_assert(offsetof(WBP_Menu_CharacterExpGauge_C_UpdateLevel, NewLevel) == 0x000000, "Member 'WBP_Menu_CharacterExpGauge_C_UpdateLevel::NewLevel' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterExpGauge_C_UpdateLevel, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_Menu_CharacterExpGauge_C_UpdateLevel::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterExpGauge_C_UpdateLevel, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'WBP_Menu_CharacterExpGauge_C_UpdateLevel::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

}

