#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CommonSelectNum

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CommonSelectNum.WBP_CommonSelectNum_C.BndEvt__WBP_CommonSelectNum_EditableTextBox_0_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_CommonSelectNum_C_BndEvt__WBP_CommonSelectNum_EditableTextBox_0_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonSelectNum_C_BndEvt__WBP_CommonSelectNum_EditableTextBox_0_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CommonSelectNum_C_BndEvt__WBP_CommonSelectNum_EditableTextBox_0_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_CommonSelectNum_C_BndEvt__WBP_CommonSelectNum_EditableTextBox_0_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on WBP_CommonSelectNum_C_BndEvt__WBP_CommonSelectNum_EditableTextBox_0_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_CommonSelectNum_C_BndEvt__WBP_CommonSelectNum_EditableTextBox_0_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_CommonSelectNum_C_BndEvt__WBP_CommonSelectNum_EditableTextBox_0_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_BndEvt__WBP_CommonSelectNum_EditableTextBox_0_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'WBP_CommonSelectNum_C_BndEvt__WBP_CommonSelectNum_EditableTextBox_0_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_CommonSelectNum.WBP_CommonSelectNum_C.BndEvt__WBP_CommonSelectNum_EditableTextBox_0_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_CommonSelectNum_C_BndEvt__WBP_CommonSelectNum_EditableTextBox_0_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CommonSelectNum_C_BndEvt__WBP_CommonSelectNum_EditableTextBox_0_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CommonSelectNum_C_BndEvt__WBP_CommonSelectNum_EditableTextBox_0_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_CommonSelectNum_C_BndEvt__WBP_CommonSelectNum_EditableTextBox_0_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_CommonSelectNum_C_BndEvt__WBP_CommonSelectNum_EditableTextBox_0_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_CommonSelectNum_C_BndEvt__WBP_CommonSelectNum_EditableTextBox_0_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_CommonSelectNum_C_BndEvt__WBP_CommonSelectNum_EditableTextBox_0_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_CommonSelectNum.WBP_CommonSelectNum_C.Check Numeric
// 0x0078 (0x0078 - 0x0000)
struct WBP_CommonSelectNum_C_Check_Numeric final
{
public:
	class FString                                 CheckString;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 OutString;                                         // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CheckedString;                                     // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_GetCharacterArrayFromString_ReturnValue;  // 0x0030(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNumeric_ReturnValue;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B84[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B85[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonSelectNum_C_Check_Numeric) == 0x000008, "Wrong alignment on WBP_CommonSelectNum_C_Check_Numeric");
static_assert(sizeof(WBP_CommonSelectNum_C_Check_Numeric) == 0x000078, "Wrong size on WBP_CommonSelectNum_C_Check_Numeric");
static_assert(offsetof(WBP_CommonSelectNum_C_Check_Numeric, CheckString) == 0x000000, "Member 'WBP_CommonSelectNum_C_Check_Numeric::CheckString' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_Check_Numeric, OutString) == 0x000010, "Member 'WBP_CommonSelectNum_C_Check_Numeric::OutString' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_Check_Numeric, CheckedString) == 0x000020, "Member 'WBP_CommonSelectNum_C_Check_Numeric::CheckedString' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_Check_Numeric, CallFunc_GetCharacterArrayFromString_ReturnValue) == 0x000030, "Member 'WBP_CommonSelectNum_C_Check_Numeric::CallFunc_GetCharacterArrayFromString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_Check_Numeric, Temp_int_Array_Index_Variable) == 0x000040, "Member 'WBP_CommonSelectNum_C_Check_Numeric::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_Check_Numeric, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'WBP_CommonSelectNum_C_Check_Numeric::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_Check_Numeric, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_CommonSelectNum_C_Check_Numeric::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_Check_Numeric, CallFunc_IsNumeric_ReturnValue) == 0x000058, "Member 'WBP_CommonSelectNum_C_Check_Numeric::CallFunc_IsNumeric_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_Check_Numeric, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'WBP_CommonSelectNum_C_Check_Numeric::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_Check_Numeric, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'WBP_CommonSelectNum_C_Check_Numeric::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_Check_Numeric, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'WBP_CommonSelectNum_C_Check_Numeric::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_Check_Numeric, CallFunc_Concat_StrStr_ReturnValue) == 0x000068, "Member 'WBP_CommonSelectNum_C_Check_Numeric::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function WBP_CommonSelectNum.WBP_CommonSelectNum_C.CheckMaxCount
// 0x0040 (0x0040 - 0x0000)
struct WBP_CommonSelectNum_C_CheckMaxCount final
{
public:
	class FString                                 InString;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 OutString;                                         // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B86[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B87[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonSelectNum_C_CheckMaxCount) == 0x000008, "Wrong alignment on WBP_CommonSelectNum_C_CheckMaxCount");
static_assert(sizeof(WBP_CommonSelectNum_C_CheckMaxCount) == 0x000040, "Wrong size on WBP_CommonSelectNum_C_CheckMaxCount");
static_assert(offsetof(WBP_CommonSelectNum_C_CheckMaxCount, InString) == 0x000000, "Member 'WBP_CommonSelectNum_C_CheckMaxCount::InString' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_CheckMaxCount, OutString) == 0x000010, "Member 'WBP_CommonSelectNum_C_CheckMaxCount::OutString' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_CheckMaxCount, CallFunc_Conv_StringToInt_ReturnValue) == 0x000020, "Member 'WBP_CommonSelectNum_C_CheckMaxCount::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_CheckMaxCount, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'WBP_CommonSelectNum_C_CheckMaxCount::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_CheckMaxCount, CallFunc_SelectInt_ReturnValue) == 0x000028, "Member 'WBP_CommonSelectNum_C_CheckMaxCount::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_CheckMaxCount, CallFunc_Conv_IntToString_ReturnValue) == 0x000030, "Member 'WBP_CommonSelectNum_C_CheckMaxCount::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");

// Function WBP_CommonSelectNum.WBP_CommonSelectNum_C.Decrement
// 0x000C (0x000C - 0x0000)
struct WBP_CommonSelectNum_C_Decrement final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonSelectNum_C_Decrement) == 0x000004, "Wrong alignment on WBP_CommonSelectNum_C_Decrement");
static_assert(sizeof(WBP_CommonSelectNum_C_Decrement) == 0x00000C, "Wrong size on WBP_CommonSelectNum_C_Decrement");
static_assert(offsetof(WBP_CommonSelectNum_C_Decrement, Temp_int_Variable) == 0x000000, "Member 'WBP_CommonSelectNum_C_Decrement::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_Decrement, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'WBP_CommonSelectNum_C_Decrement::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_Decrement, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_CommonSelectNum_C_Decrement::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_CommonSelectNum.WBP_CommonSelectNum_C.ExecuteUbergraph_WBP_CommonSelectNum
// 0x0198 (0x0198 - 0x0000)
struct WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& NewString)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B88[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x0048(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B89[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0068(0x0018)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Check_Numeric_outString;                  // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Check_Numeric_outString_1;                // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B8A[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_CheckMaxCount_outString;                  // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00D8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00F0(0x0018)()
	class FString                                 CallFunc_Left_ReturnValue;                         // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B8B[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Check_Numeric_outString_2;                // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B8C[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_CheckMaxCount_outString_1;                // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0148(0x0018)()
	class UPalHUDDispatchParameterBase*           CallFunc_GetParam_ReturnValue;                     // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalUISelectNumParameter*               K2Node_DynamicCast_AsPal_UISelect_Num_Parameter;   // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B8D[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_newString;                      // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_1;           // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B8E[0x4];                                     // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum) == 0x000008, "Wrong alignment on WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum");
static_assert(sizeof(WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum) == 0x000198, "Wrong size on WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum");
static_assert(offsetof(WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum, EntryPoint) == 0x000000, "Member 'WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum, K2Node_CreateDelegate_OutputDelegate_3) == 0x000034, "Member 'WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum, K2Node_ComponentBoundEvent_Text_1) == 0x000048, "Member 'WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum::K2Node_ComponentBoundEvent_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum, K2Node_ComponentBoundEvent_CommitMethod) == 0x000060, "Member 'WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum, K2Node_ComponentBoundEvent_Text) == 0x000068, "Member 'WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum, CallFunc_Conv_TextToString_ReturnValue) == 0x000080, "Member 'WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000090, "Member 'WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum, CallFunc_Check_Numeric_outString) == 0x0000A0, "Member 'WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum::CallFunc_Check_Numeric_outString' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum, CallFunc_Check_Numeric_outString_1) == 0x0000B0, "Member 'WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum::CallFunc_Check_Numeric_outString_1' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum, CallFunc_Conv_StringToInt_ReturnValue) == 0x0000C0, "Member 'WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum, CallFunc_CheckMaxCount_outString) == 0x0000C8, "Member 'WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum::CallFunc_CheckMaxCount_outString' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum, CallFunc_Conv_StringToText_ReturnValue) == 0x0000D8, "Member 'WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000F0, "Member 'WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum, CallFunc_Left_ReturnValue) == 0x000108, "Member 'WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum::CallFunc_Left_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum, CallFunc_Len_ReturnValue) == 0x000118, "Member 'WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum, CallFunc_Check_Numeric_outString_2) == 0x000120, "Member 'WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum::CallFunc_Check_Numeric_outString_2' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum, CallFunc_Greater_IntInt_ReturnValue) == 0x000130, "Member 'WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum, CallFunc_CheckMaxCount_outString_1) == 0x000138, "Member 'WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum::CallFunc_CheckMaxCount_outString_1' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000148, "Member 'WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum, CallFunc_GetParam_ReturnValue) == 0x000160, "Member 'WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum::CallFunc_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum, K2Node_DynamicCast_AsPal_UISelect_Num_Parameter) == 0x000168, "Member 'WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum::K2Node_DynamicCast_AsPal_UISelect_Num_Parameter' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum, K2Node_DynamicCast_bSuccess) == 0x000170, "Member 'WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum, K2Node_CustomEvent_newString) == 0x000178, "Member 'WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum::K2Node_CustomEvent_newString' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum, CallFunc_Conv_StringToInt_ReturnValue_1) == 0x000188, "Member 'WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum::CallFunc_Conv_StringToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000190, "Member 'WBP_CommonSelectNum_C_ExecuteUbergraph_WBP_CommonSelectNum::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");

// Function WBP_CommonSelectNum.WBP_CommonSelectNum_C.GetNowCount
// 0x0004 (0x0004 - 0x0000)
struct WBP_CommonSelectNum_C_GetNowCount final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonSelectNum_C_GetNowCount) == 0x000004, "Wrong alignment on WBP_CommonSelectNum_C_GetNowCount");
static_assert(sizeof(WBP_CommonSelectNum_C_GetNowCount) == 0x000004, "Wrong size on WBP_CommonSelectNum_C_GetNowCount");
static_assert(offsetof(WBP_CommonSelectNum_C_GetNowCount, Count) == 0x000000, "Member 'WBP_CommonSelectNum_C_GetNowCount::Count' has a wrong offset!");

// Function WBP_CommonSelectNum.WBP_CommonSelectNum_C.Increment
// 0x000C (0x000C - 0x0000)
struct WBP_CommonSelectNum_C_Increment final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B8F[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonSelectNum_C_Increment) == 0x000004, "Wrong alignment on WBP_CommonSelectNum_C_Increment");
static_assert(sizeof(WBP_CommonSelectNum_C_Increment) == 0x00000C, "Wrong size on WBP_CommonSelectNum_C_Increment");
static_assert(offsetof(WBP_CommonSelectNum_C_Increment, Temp_int_Variable) == 0x000000, "Member 'WBP_CommonSelectNum_C_Increment::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_Increment, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'WBP_CommonSelectNum_C_Increment::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_Increment, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_CommonSelectNum_C_Increment::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_CommonSelectNum.WBP_CommonSelectNum_C.OnTextChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_CommonSelectNum_C_OnTextChanged final
{
public:
	class FString                                 NewString;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonSelectNum_C_OnTextChanged) == 0x000008, "Wrong alignment on WBP_CommonSelectNum_C_OnTextChanged");
static_assert(sizeof(WBP_CommonSelectNum_C_OnTextChanged) == 0x000010, "Wrong size on WBP_CommonSelectNum_C_OnTextChanged");
static_assert(offsetof(WBP_CommonSelectNum_C_OnTextChanged, NewString) == 0x000000, "Member 'WBP_CommonSelectNum_C_OnTextChanged::NewString' has a wrong offset!");

// Function WBP_CommonSelectNum.WBP_CommonSelectNum_C.OnTextCommited__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_CommonSelectNum_C_OnTextCommited__DelegateSignature final
{
public:
	class FString                                 NewString;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonSelectNum_C_OnTextCommited__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CommonSelectNum_C_OnTextCommited__DelegateSignature");
static_assert(sizeof(WBP_CommonSelectNum_C_OnTextCommited__DelegateSignature) == 0x000010, "Wrong size on WBP_CommonSelectNum_C_OnTextCommited__DelegateSignature");
static_assert(offsetof(WBP_CommonSelectNum_C_OnTextCommited__DelegateSignature, NewString) == 0x000000, "Member 'WBP_CommonSelectNum_C_OnTextCommited__DelegateSignature::NewString' has a wrong offset!");

// Function WBP_CommonSelectNum.WBP_CommonSelectNum_C.Setup
// 0x0008 (0x0008 - 0x0000)
struct WBP_CommonSelectNum_C_Setup final
{
public:
	int32                                         InMaxCount;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DefaultCount;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonSelectNum_C_Setup) == 0x000004, "Wrong alignment on WBP_CommonSelectNum_C_Setup");
static_assert(sizeof(WBP_CommonSelectNum_C_Setup) == 0x000008, "Wrong size on WBP_CommonSelectNum_C_Setup");
static_assert(offsetof(WBP_CommonSelectNum_C_Setup, InMaxCount) == 0x000000, "Member 'WBP_CommonSelectNum_C_Setup::InMaxCount' has a wrong offset!");
static_assert(offsetof(WBP_CommonSelectNum_C_Setup, DefaultCount) == 0x000004, "Member 'WBP_CommonSelectNum_C_Setup::DefaultCount' has a wrong offset!");

// Function WBP_CommonSelectNum.WBP_CommonSelectNum_C.UpdateText
// 0x0018 (0x0018 - 0x0000)
struct WBP_CommonSelectNum_C_UpdateText final
{
public:
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0000(0x0018)()
};
static_assert(alignof(WBP_CommonSelectNum_C_UpdateText) == 0x000008, "Wrong alignment on WBP_CommonSelectNum_C_UpdateText");
static_assert(sizeof(WBP_CommonSelectNum_C_UpdateText) == 0x000018, "Wrong size on WBP_CommonSelectNum_C_UpdateText");
static_assert(offsetof(WBP_CommonSelectNum_C_UpdateText, CallFunc_Conv_IntToText_ReturnValue) == 0x000000, "Member 'WBP_CommonSelectNum_C_UpdateText::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

}

