#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MenuESCPlayerListItem

#include "Basic.hpp"

#include "Pal_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_MenuESCPlayerListItem.WBP_MenuESCPlayerListItem_C.BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MenuESCPlayerListItem_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuESCPlayerListItem_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MenuESCPlayerListItem_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_MenuESCPlayerListItem_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_MenuESCPlayerListItem_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_MenuESCPlayerListItem_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MenuESCPlayerListItem.WBP_MenuESCPlayerListItem_C.BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MenuESCPlayerListItem_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuESCPlayerListItem_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MenuESCPlayerListItem_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_MenuESCPlayerListItem_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_MenuESCPlayerListItem_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_MenuESCPlayerListItem_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MenuESCPlayerListItem.WBP_MenuESCPlayerListItem_C.BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MenuESCPlayerListItem_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuESCPlayerListItem_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MenuESCPlayerListItem_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_MenuESCPlayerListItem_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_MenuESCPlayerListItem_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_MenuESCPlayerListItem_C_BndEvt__WBP_Guild_MemberList_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MenuESCPlayerListItem.WBP_MenuESCPlayerListItem_C.BndEvt__WBP_PlayerListItem_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MenuESCPlayerListItem_C_BndEvt__WBP_PlayerListItem_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuESCPlayerListItem_C_BndEvt__WBP_PlayerListItem_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MenuESCPlayerListItem_C_BndEvt__WBP_PlayerListItem_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_MenuESCPlayerListItem_C_BndEvt__WBP_PlayerListItem_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_MenuESCPlayerListItem_C_BndEvt__WBP_PlayerListItem_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_BndEvt__WBP_PlayerListItem_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_MenuESCPlayerListItem_C_BndEvt__WBP_PlayerListItem_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MenuESCPlayerListItem.WBP_MenuESCPlayerListItem_C.ExecuteUbergraph_WBP_MenuESCPlayerListItem
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58B3[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0008(0x0018)()
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0050)(HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0098(0x0018)()
	TDelegate<void(bool bResult)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bResult;                        // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58B4[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bResult)>                 K2Node_CreateDelegate_OutputDelegate_1;            // 0x00E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_Dialog_ReturnValue;                       // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0100(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0118(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_ClipboardCopy_ReturnValue;                // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58B5[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0170(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0180(0x0018)()
	struct FGuid                                  CallFunc_Dialog_ReturnValue_1;                     // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClipboardCopy_ReturnValue_1;              // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem) == 0x000008, "Wrong alignment on WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem");
static_assert(sizeof(WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem) == 0x0001B0, "Wrong size on WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem, EntryPoint) == 0x000000, "Member 'WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem, CallFunc_Conv_StringToText_ReturnValue) == 0x000008, "Member 'WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem, K2Node_ComponentBoundEvent_Button_3) == 0x000020, "Member 'WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem, K2Node_ComponentBoundEvent_Button_2) == 0x000078, "Member 'WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem, K2Node_MakeArray_Array) == 0x000080, "Member 'WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem, K2Node_ComponentBoundEvent_Button_1) == 0x000090, "Member 'WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem, CallFunc_Format_ReturnValue) == 0x000098, "Member 'WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem, K2Node_CreateDelegate_OutputDelegate) == 0x0000B0, "Member 'WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem, CallFunc_PlayAnimation_ReturnValue) == 0x0000C0, "Member 'WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000C8, "Member 'WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem, K2Node_CustomEvent_bResult) == 0x0000D0, "Member 'WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem::K2Node_CustomEvent_bResult' has a wrong offset!");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem, K2Node_ComponentBoundEvent_Button) == 0x0000D8, "Member 'WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000E0, "Member 'WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem, CallFunc_Dialog_ReturnValue) == 0x0000F0, "Member 'WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem::CallFunc_Dialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000100, "Member 'WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem, K2Node_MakeStruct_FormatArgumentData_1) == 0x000118, "Member 'WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem, CallFunc_ClipboardCopy_ReturnValue) == 0x000168, "Member 'WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem::CallFunc_ClipboardCopy_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem, K2Node_MakeArray_Array_1) == 0x000170, "Member 'WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem, CallFunc_Format_ReturnValue_1) == 0x000180, "Member 'WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem, CallFunc_Dialog_ReturnValue_1) == 0x000198, "Member 'WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem::CallFunc_Dialog_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem, CallFunc_ClipboardCopy_ReturnValue_1) == 0x0001A8, "Member 'WBP_MenuESCPlayerListItem_C_ExecuteUbergraph_WBP_MenuESCPlayerListItem::CallFunc_ClipboardCopy_ReturnValue_1' has a wrong offset!");

// Function WBP_MenuESCPlayerListItem.WBP_MenuESCPlayerListItem_C.GetDisplayInfo
// 0x0018 (0x0018 - 0x0000)
struct WBP_MenuESCPlayerListItem_C_GetDisplayInfo final
{
public:
	struct FPalUIGuildMemberDisplayInfo           DisplayInfo;                                       // 0x0000(0x0018)(Parm, OutParm)
};
static_assert(alignof(WBP_MenuESCPlayerListItem_C_GetDisplayInfo) == 0x000008, "Wrong alignment on WBP_MenuESCPlayerListItem_C_GetDisplayInfo");
static_assert(sizeof(WBP_MenuESCPlayerListItem_C_GetDisplayInfo) == 0x000018, "Wrong size on WBP_MenuESCPlayerListItem_C_GetDisplayInfo");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_GetDisplayInfo, DisplayInfo) == 0x000000, "Member 'WBP_MenuESCPlayerListItem_C_GetDisplayInfo::DisplayInfo' has a wrong offset!");

// Function WBP_MenuESCPlayerListItem.WBP_MenuESCPlayerListItem_C.GetFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_MenuESCPlayerListItem_C_GetFocusTarget final
{
public:
	class UWidget*                                TargetWidget;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuESCPlayerListItem_C_GetFocusTarget) == 0x000008, "Wrong alignment on WBP_MenuESCPlayerListItem_C_GetFocusTarget");
static_assert(sizeof(WBP_MenuESCPlayerListItem_C_GetFocusTarget) == 0x000008, "Wrong size on WBP_MenuESCPlayerListItem_C_GetFocusTarget");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_GetFocusTarget, TargetWidget) == 0x000000, "Member 'WBP_MenuESCPlayerListItem_C_GetFocusTarget::TargetWidget' has a wrong offset!");

// Function WBP_MenuESCPlayerListItem.WBP_MenuESCPlayerListItem_C.OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MenuESCPlayerListItem_C_OnClicked__DelegateSignature final
{
public:
	class UWBP_Guild_MemberList_C*                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuESCPlayerListItem_C_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MenuESCPlayerListItem_C_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_MenuESCPlayerListItem_C_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_MenuESCPlayerListItem_C_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_OnClicked__DelegateSignature, Widget) == 0x000000, "Member 'WBP_MenuESCPlayerListItem_C_OnClicked__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_MenuESCPlayerListItem.WBP_MenuESCPlayerListItem_C.OnHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MenuESCPlayerListItem_C_OnHovered__DelegateSignature final
{
public:
	class UWBP_Guild_MemberList_C*                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuESCPlayerListItem_C_OnHovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MenuESCPlayerListItem_C_OnHovered__DelegateSignature");
static_assert(sizeof(WBP_MenuESCPlayerListItem_C_OnHovered__DelegateSignature) == 0x000008, "Wrong size on WBP_MenuESCPlayerListItem_C_OnHovered__DelegateSignature");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_OnHovered__DelegateSignature, Widget) == 0x000000, "Member 'WBP_MenuESCPlayerListItem_C_OnHovered__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_MenuESCPlayerListItem.WBP_MenuESCPlayerListItem_C.SetPlayerName
// 0x0028 (0x0028 - 0x0000)
struct WBP_MenuESCPlayerListItem_C_SetPlayerName final
{
public:
	class FString                                 PlayerName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
};
static_assert(alignof(WBP_MenuESCPlayerListItem_C_SetPlayerName) == 0x000008, "Wrong alignment on WBP_MenuESCPlayerListItem_C_SetPlayerName");
static_assert(sizeof(WBP_MenuESCPlayerListItem_C_SetPlayerName) == 0x000028, "Wrong size on WBP_MenuESCPlayerListItem_C_SetPlayerName");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_SetPlayerName, PlayerName) == 0x000000, "Member 'WBP_MenuESCPlayerListItem_C_SetPlayerName::PlayerName' has a wrong offset!");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_SetPlayerName, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'WBP_MenuESCPlayerListItem_C_SetPlayerName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_MenuESCPlayerListItem.WBP_MenuESCPlayerListItem_C.Setup
// 0x0030 (0x0030 - 0x0000)
struct WBP_MenuESCPlayerListItem_C_Setup final
{
public:
	class FString                                 PlayerName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 PlayerUId;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 UserId;                                            // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuESCPlayerListItem_C_Setup) == 0x000008, "Wrong alignment on WBP_MenuESCPlayerListItem_C_Setup");
static_assert(sizeof(WBP_MenuESCPlayerListItem_C_Setup) == 0x000030, "Wrong size on WBP_MenuESCPlayerListItem_C_Setup");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_Setup, PlayerName) == 0x000000, "Member 'WBP_MenuESCPlayerListItem_C_Setup::PlayerName' has a wrong offset!");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_Setup, PlayerUId) == 0x000010, "Member 'WBP_MenuESCPlayerListItem_C_Setup::PlayerUId' has a wrong offset!");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_Setup, UserId) == 0x000020, "Member 'WBP_MenuESCPlayerListItem_C_Setup::UserId' has a wrong offset!");

// Function WBP_MenuESCPlayerListItem.WBP_MenuESCPlayerListItem_C.«¹¿à¤ÙóÈ
// 0x0001 (0x0001 - 0x0000)
struct WBP_MenuESCPlayerListItem_C_________ final
{
public:
	bool                                          bResult;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuESCPlayerListItem_C_________) == 0x000001, "Wrong alignment on WBP_MenuESCPlayerListItem_C_________");
static_assert(sizeof(WBP_MenuESCPlayerListItem_C_________) == 0x000001, "Wrong size on WBP_MenuESCPlayerListItem_C_________");
static_assert(offsetof(WBP_MenuESCPlayerListItem_C_________, bResult) == 0x000000, "Member 'WBP_MenuESCPlayerListItem_C_________::bResult' has a wrong offset!");

}

