#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenu_bg

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MainMenu_bg.WBP_MainMenu_bg_C
// 0x0018 (0x0290 - 0x0278)
class UWBP_MainMenu_bg_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anm_bg_Open;                                       // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_Title;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Anm_Open();
	void ExecuteUbergraph_WBP_MainMenu_bg(int32 EntryPoint);
	void SetText(const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MainMenu_bg_C">();
	}
	static class UWBP_MainMenu_bg_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MainMenu_bg_C>();
	}
};
static_assert(alignof(UWBP_MainMenu_bg_C) == 0x000008, "Wrong alignment on UWBP_MainMenu_bg_C");
static_assert(sizeof(UWBP_MainMenu_bg_C) == 0x000290, "Wrong size on UWBP_MainMenu_bg_C");
static_assert(offsetof(UWBP_MainMenu_bg_C, UberGraphFrame) == 0x000278, "Member 'UWBP_MainMenu_bg_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_bg_C, Anm_bg_Open) == 0x000280, "Member 'UWBP_MainMenu_bg_C::Anm_bg_Open' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_bg_C, Text_Title) == 0x000288, "Member 'UWBP_MainMenu_bg_C::Text_Title' has a wrong offset!");

}

