#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Buildup_Pal_Item

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Buildup_Pal_Item.WBP_Buildup_Pal_Item_C
// 0x0018 (0x0290 - 0x0278)
class UWBP_Buildup_Pal_Item_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 IconHaveItem;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_HaveNum;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Buildup_Pal_Item(int32 EntryPoint);
	void SetIcon(int32 IconIndex);
	void SetNum(int32 Num);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Buildup_Pal_Item_C">();
	}
	static class UWBP_Buildup_Pal_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Buildup_Pal_Item_C>();
	}
};
static_assert(alignof(UWBP_Buildup_Pal_Item_C) == 0x000008, "Wrong alignment on UWBP_Buildup_Pal_Item_C");
static_assert(sizeof(UWBP_Buildup_Pal_Item_C) == 0x000290, "Wrong size on UWBP_Buildup_Pal_Item_C");
static_assert(offsetof(UWBP_Buildup_Pal_Item_C, UberGraphFrame) == 0x000278, "Member 'UWBP_Buildup_Pal_Item_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_Item_C, IconHaveItem) == 0x000280, "Member 'UWBP_Buildup_Pal_Item_C::IconHaveItem' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_Item_C, Text_HaveNum) == 0x000288, "Member 'UWBP_Buildup_Pal_Item_C::Text_HaveNum' has a wrong offset!");

}

