#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenu_PalSkillSwap

#include "Basic.hpp"

#include "Pal_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_MainMenu_PalSkillSwap.WBP_MainMenu_PalSkillSwap_C.ExecuteUbergraph_WBP_MainMenu_PalSkillSwap
// 0x0050 (0x0050 - 0x0000)
struct WBP_MainMenu_PalSkillSwap_C_ExecuteUbergraph_WBP_MainMenu_PalSkillSwap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4314[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDDispatchParameterBase*           CallFunc_GetParam_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_MainMenuSkillSwapParameter_C*       K2Node_DynamicCast_AsBP_Main_Menu_Skill_Swap_Parameter; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4315[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPalWazaID SelectedWazaId)>    K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4316[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EPalWazaID>                            CallFunc_GetEquipableWaza_ReturnValue;             // 0x0030(0x0010)(ReferenceParm)
	TArray<EPalWazaID>                            CallFunc_GetEquipWaza_ReturnValue;                 // 0x0040(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_MainMenu_PalSkillSwap_C_ExecuteUbergraph_WBP_MainMenu_PalSkillSwap) == 0x000008, "Wrong alignment on WBP_MainMenu_PalSkillSwap_C_ExecuteUbergraph_WBP_MainMenu_PalSkillSwap");
static_assert(sizeof(WBP_MainMenu_PalSkillSwap_C_ExecuteUbergraph_WBP_MainMenu_PalSkillSwap) == 0x000050, "Wrong size on WBP_MainMenu_PalSkillSwap_C_ExecuteUbergraph_WBP_MainMenu_PalSkillSwap");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_ExecuteUbergraph_WBP_MainMenu_PalSkillSwap, EntryPoint) == 0x000000, "Member 'WBP_MainMenu_PalSkillSwap_C_ExecuteUbergraph_WBP_MainMenu_PalSkillSwap::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_ExecuteUbergraph_WBP_MainMenu_PalSkillSwap, CallFunc_GetParam_ReturnValue) == 0x000008, "Member 'WBP_MainMenu_PalSkillSwap_C_ExecuteUbergraph_WBP_MainMenu_PalSkillSwap::CallFunc_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_ExecuteUbergraph_WBP_MainMenu_PalSkillSwap, K2Node_DynamicCast_AsBP_Main_Menu_Skill_Swap_Parameter) == 0x000010, "Member 'WBP_MainMenu_PalSkillSwap_C_ExecuteUbergraph_WBP_MainMenu_PalSkillSwap::K2Node_DynamicCast_AsBP_Main_Menu_Skill_Swap_Parameter' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_ExecuteUbergraph_WBP_MainMenu_PalSkillSwap, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_MainMenu_PalSkillSwap_C_ExecuteUbergraph_WBP_MainMenu_PalSkillSwap::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_ExecuteUbergraph_WBP_MainMenu_PalSkillSwap, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'WBP_MainMenu_PalSkillSwap_C_ExecuteUbergraph_WBP_MainMenu_PalSkillSwap::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_ExecuteUbergraph_WBP_MainMenu_PalSkillSwap, CallFunc_GetEquipableWaza_ReturnValue) == 0x000030, "Member 'WBP_MainMenu_PalSkillSwap_C_ExecuteUbergraph_WBP_MainMenu_PalSkillSwap::CallFunc_GetEquipableWaza_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_ExecuteUbergraph_WBP_MainMenu_PalSkillSwap, CallFunc_GetEquipWaza_ReturnValue) == 0x000040, "Member 'WBP_MainMenu_PalSkillSwap_C_ExecuteUbergraph_WBP_MainMenu_PalSkillSwap::CallFunc_GetEquipWaza_ReturnValue' has a wrong offset!");

// Function WBP_MainMenu_PalSkillSwap.WBP_MainMenu_PalSkillSwap_C.On_BaseBlack_MouseButtonDown
// 0x0248 (0x0248 - 0x0000)
struct WBP_MainMenu_PalSkillSwap_C_On_BaseBlack_MouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0040(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00D8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0190(0x00B8)()
};
static_assert(alignof(WBP_MainMenu_PalSkillSwap_C_On_BaseBlack_MouseButtonDown) == 0x000008, "Wrong alignment on WBP_MainMenu_PalSkillSwap_C_On_BaseBlack_MouseButtonDown");
static_assert(sizeof(WBP_MainMenu_PalSkillSwap_C_On_BaseBlack_MouseButtonDown) == 0x000248, "Wrong size on WBP_MainMenu_PalSkillSwap_C_On_BaseBlack_MouseButtonDown");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_On_BaseBlack_MouseButtonDown, MyGeometry) == 0x000000, "Member 'WBP_MainMenu_PalSkillSwap_C_On_BaseBlack_MouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_On_BaseBlack_MouseButtonDown, MouseEvent) == 0x000040, "Member 'WBP_MainMenu_PalSkillSwap_C_On_BaseBlack_MouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_On_BaseBlack_MouseButtonDown, ReturnValue) == 0x0000D8, "Member 'WBP_MainMenu_PalSkillSwap_C_On_BaseBlack_MouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_On_BaseBlack_MouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000190, "Member 'WBP_MainMenu_PalSkillSwap_C_On_BaseBlack_MouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_MainMenu_PalSkillSwap.WBP_MainMenu_PalSkillSwap_C.OnClicked_Internal
// 0x0010 (0x0010 - 0x0000)
struct WBP_MainMenu_PalSkillSwap_C_OnClicked_Internal final
{
public:
	class UWBP_MainMenu_Pal_Skill_Active_C*       SkillWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPalWazaID                                    CallFunc_GetBindedWazaID_wazaID;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_PalSkillSwap_C_OnClicked_Internal) == 0x000008, "Wrong alignment on WBP_MainMenu_PalSkillSwap_C_OnClicked_Internal");
static_assert(sizeof(WBP_MainMenu_PalSkillSwap_C_OnClicked_Internal) == 0x000010, "Wrong size on WBP_MainMenu_PalSkillSwap_C_OnClicked_Internal");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_OnClicked_Internal, SkillWidget) == 0x000000, "Member 'WBP_MainMenu_PalSkillSwap_C_OnClicked_Internal::SkillWidget' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_OnClicked_Internal, CallFunc_GetBindedWazaID_wazaID) == 0x000008, "Member 'WBP_MainMenu_PalSkillSwap_C_OnClicked_Internal::CallFunc_GetBindedWazaID_wazaID' has a wrong offset!");

// Function WBP_MainMenu_PalSkillSwap.WBP_MainMenu_PalSkillSwap_C.OnHovered_Internal
// 0x0020 (0x0020 - 0x0000)
struct WBP_MainMenu_PalSkillSwap_C_OnHovered_Internal final
{
public:
	class UWBP_MainMenu_Pal_Skill_Active_C*       SkillWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPalWazaID                                    CallFunc_GetBindedWazaID_wazaID;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4317[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_PalSkillSwap_C_OnHovered_Internal) == 0x000008, "Wrong alignment on WBP_MainMenu_PalSkillSwap_C_OnHovered_Internal");
static_assert(sizeof(WBP_MainMenu_PalSkillSwap_C_OnHovered_Internal) == 0x000020, "Wrong size on WBP_MainMenu_PalSkillSwap_C_OnHovered_Internal");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_OnHovered_Internal, SkillWidget) == 0x000000, "Member 'WBP_MainMenu_PalSkillSwap_C_OnHovered_Internal::SkillWidget' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_OnHovered_Internal, CallFunc_GetBindedWazaID_wazaID) == 0x000008, "Member 'WBP_MainMenu_PalSkillSwap_C_OnHovered_Internal::CallFunc_GetBindedWazaID_wazaID' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_OnHovered_Internal, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000010, "Member 'WBP_MainMenu_PalSkillSwap_C_OnHovered_Internal::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_OnHovered_Internal, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_MainMenu_PalSkillSwap_C_OnHovered_Internal::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_MainMenu_PalSkillSwap.WBP_MainMenu_PalSkillSwap_C.OnSelected__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_MainMenu_PalSkillSwap_C_OnSelected__DelegateSignature final
{
public:
	EPalWazaID                                    SelectedWazaId;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_PalSkillSwap_C_OnSelected__DelegateSignature) == 0x000001, "Wrong alignment on WBP_MainMenu_PalSkillSwap_C_OnSelected__DelegateSignature");
static_assert(sizeof(WBP_MainMenu_PalSkillSwap_C_OnSelected__DelegateSignature) == 0x000001, "Wrong size on WBP_MainMenu_PalSkillSwap_C_OnSelected__DelegateSignature");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_OnSelected__DelegateSignature, SelectedWazaId) == 0x000000, "Member 'WBP_MainMenu_PalSkillSwap_C_OnSelected__DelegateSignature::SelectedWazaId' has a wrong offset!");

// Function WBP_MainMenu_PalSkillSwap.WBP_MainMenu_PalSkillSwap_C.OnUnhovered_Internal
// 0x0008 (0x0008 - 0x0000)
struct WBP_MainMenu_PalSkillSwap_C_OnUnhovered_Internal final
{
public:
	class UWBP_MainMenu_Pal_Skill_Active_C*       SkillWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_PalSkillSwap_C_OnUnhovered_Internal) == 0x000008, "Wrong alignment on WBP_MainMenu_PalSkillSwap_C_OnUnhovered_Internal");
static_assert(sizeof(WBP_MainMenu_PalSkillSwap_C_OnUnhovered_Internal) == 0x000008, "Wrong size on WBP_MainMenu_PalSkillSwap_C_OnUnhovered_Internal");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_OnUnhovered_Internal, SkillWidget) == 0x000000, "Member 'WBP_MainMenu_PalSkillSwap_C_OnUnhovered_Internal::SkillWidget' has a wrong offset!");

// Function WBP_MainMenu_PalSkillSwap.WBP_MainMenu_PalSkillSwap_C.Setup
// 0x0108 (0x0108 - 0x0000)
struct WBP_MainMenu_PalSkillSwap_C_Setup final
{
public:
	TArray<EPalWazaID>                            MasteredSkills;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<EPalWazaID>                            EquipedSkills;                                     // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4318[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalWazaID                                    CallFunc_Array_Get_Item;                           // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4319[0x2];                                     // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431A[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_MainMenu_Pal_Skill_Active_C* SelfWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USpacer*                                CallFunc_SpawnObject_ReturnValue;                  // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_MainMenu_Pal_Skill_Active_C* SelfWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_MainMenu_Pal_Skill_Active_C* SelfWidget)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431B[0x6];                                     // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x00A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue_1;   // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431C[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MainMenu_Pal_Skill_Active_C*       CallFunc_Create_ReturnValue;                       // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431D[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    K2Node_Select_Default;                             // 0x00D8(0x0010)(NoDestructor)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text;          // 0x00E8(0x0018)()
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_PalSkillSwap_C_Setup) == 0x000008, "Wrong alignment on WBP_MainMenu_PalSkillSwap_C_Setup");
static_assert(sizeof(WBP_MainMenu_PalSkillSwap_C_Setup) == 0x000108, "Wrong size on WBP_MainMenu_PalSkillSwap_C_Setup");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_Setup, MasteredSkills) == 0x000000, "Member 'WBP_MainMenu_PalSkillSwap_C_Setup::MasteredSkills' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_Setup, EquipedSkills) == 0x000010, "Member 'WBP_MainMenu_PalSkillSwap_C_Setup::EquipedSkills' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_Setup, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_MainMenu_PalSkillSwap_C_Setup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_Setup, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WBP_MainMenu_PalSkillSwap_C_Setup::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_Setup, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'WBP_MainMenu_PalSkillSwap_C_Setup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_Setup, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_MainMenu_PalSkillSwap_C_Setup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_Setup, Temp_int_Array_Index_Variable) == 0x000030, "Member 'WBP_MainMenu_PalSkillSwap_C_Setup::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_Setup, Temp_bool_Has_Been_Initd_Variable) == 0x000034, "Member 'WBP_MainMenu_PalSkillSwap_C_Setup::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_Setup, CallFunc_Array_Get_Item) == 0x000035, "Member 'WBP_MainMenu_PalSkillSwap_C_Setup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_Setup, CallFunc_Array_Find_ReturnValue) == 0x000038, "Member 'WBP_MainMenu_PalSkillSwap_C_Setup::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_Setup, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_MainMenu_PalSkillSwap_C_Setup::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_Setup, K2Node_MakeStruct_Margin) == 0x000040, "Member 'WBP_MainMenu_PalSkillSwap_C_Setup::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_Setup, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000050, "Member 'WBP_MainMenu_PalSkillSwap_C_Setup::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_Setup, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'WBP_MainMenu_PalSkillSwap_C_Setup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_Setup, CallFunc_SpawnObject_ReturnValue) == 0x000068, "Member 'WBP_MainMenu_PalSkillSwap_C_Setup::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_Setup, K2Node_CreateDelegate_OutputDelegate_1) == 0x000070, "Member 'WBP_MainMenu_PalSkillSwap_C_Setup::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_Setup, CallFunc_AddChild_ReturnValue) == 0x000080, "Member 'WBP_MainMenu_PalSkillSwap_C_Setup::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_Setup, K2Node_CreateDelegate_OutputDelegate_2) == 0x000088, "Member 'WBP_MainMenu_PalSkillSwap_C_Setup::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_Setup, Temp_bool_Variable) == 0x000098, "Member 'WBP_MainMenu_PalSkillSwap_C_Setup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_Setup, Temp_bool_IsClosed_Variable) == 0x000099, "Member 'WBP_MainMenu_PalSkillSwap_C_Setup::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_Setup, CallFunc_GetAllChildren_ReturnValue) == 0x0000A0, "Member 'WBP_MainMenu_PalSkillSwap_C_Setup::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_Setup, CallFunc_GetLocalPlayerController_ReturnValue_1) == 0x0000B0, "Member 'WBP_MainMenu_PalSkillSwap_C_Setup::CallFunc_GetLocalPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_Setup, CallFunc_Array_Length_ReturnValue_1) == 0x0000B8, "Member 'WBP_MainMenu_PalSkillSwap_C_Setup::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_Setup, CallFunc_Create_ReturnValue) == 0x0000C0, "Member 'WBP_MainMenu_PalSkillSwap_C_Setup::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_Setup, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000C8, "Member 'WBP_MainMenu_PalSkillSwap_C_Setup::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_Setup, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x0000D0, "Member 'WBP_MainMenu_PalSkillSwap_C_Setup::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_Setup, K2Node_Select_Default) == 0x0000D8, "Member 'WBP_MainMenu_PalSkillSwap_C_Setup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_Setup, CallFunc_GetLocalizedTextFromHandle_Text) == 0x0000E8, "Member 'WBP_MainMenu_PalSkillSwap_C_Setup::CallFunc_GetLocalizedTextFromHandle_Text' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_Setup, CallFunc_AddChild_ReturnValue_1) == 0x000100, "Member 'WBP_MainMenu_PalSkillSwap_C_Setup::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");

// Function WBP_MainMenu_PalSkillSwap.WBP_MainMenu_PalSkillSwap_C.BP_GetDesiredFocusTarget
// 0x0028 (0x0028 - 0x0000)
struct WBP_MainMenu_PalSkillSwap_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431E[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MainMenu_Pal_Skill_Active_C*       K2Node_DynamicCast_AsWBP_Main_Menu_Pal_Skill_Active; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_PalSkillSwap_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_MainMenu_PalSkillSwap_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_MainMenu_PalSkillSwap_C_BP_GetDesiredFocusTarget) == 0x000028, "Wrong size on WBP_MainMenu_PalSkillSwap_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_MainMenu_PalSkillSwap_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_BP_GetDesiredFocusTarget, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'WBP_MainMenu_PalSkillSwap_C_BP_GetDesiredFocusTarget::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_BP_GetDesiredFocusTarget, CallFunc_HasAnyChildren_ReturnValue) == 0x000010, "Member 'WBP_MainMenu_PalSkillSwap_C_BP_GetDesiredFocusTarget::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_BP_GetDesiredFocusTarget, K2Node_DynamicCast_AsWBP_Main_Menu_Pal_Skill_Active) == 0x000018, "Member 'WBP_MainMenu_PalSkillSwap_C_BP_GetDesiredFocusTarget::K2Node_DynamicCast_AsWBP_Main_Menu_Pal_Skill_Active' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_PalSkillSwap_C_BP_GetDesiredFocusTarget, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_MainMenu_PalSkillSwap_C_BP_GetDesiredFocusTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

