#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GuildMemberMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_GuildMemberMenu.WBP_GuildMemberMenu_C.BndEvt__WBP_GuildMemberMenu_WBP_GuildMemberMenuList_1_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_GuildMemberMenu_C_BndEvt__WBP_GuildMemberMenu_WBP_GuildMemberMenuList_1_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature final
{
public:
	class UWBP_GuildMemberMenuList_C*             Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GuildMemberMenu_C_BndEvt__WBP_GuildMemberMenu_WBP_GuildMemberMenuList_1_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GuildMemberMenu_C_BndEvt__WBP_GuildMemberMenu_WBP_GuildMemberMenuList_1_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_GuildMemberMenu_C_BndEvt__WBP_GuildMemberMenu_WBP_GuildMemberMenuList_1_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_GuildMemberMenu_C_BndEvt__WBP_GuildMemberMenu_WBP_GuildMemberMenuList_1_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_GuildMemberMenu_C_BndEvt__WBP_GuildMemberMenu_WBP_GuildMemberMenuList_1_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_GuildMemberMenu_C_BndEvt__WBP_GuildMemberMenu_WBP_GuildMemberMenuList_1_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_GuildMemberMenu.WBP_GuildMemberMenu_C.BndEvt__WBP_GuildMemberMenu_WBP_GuildMemberMenuList_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_GuildMemberMenu_C_BndEvt__WBP_GuildMemberMenu_WBP_GuildMemberMenuList_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature final
{
public:
	class UWBP_GuildMemberMenuList_C*             Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GuildMemberMenu_C_BndEvt__WBP_GuildMemberMenu_WBP_GuildMemberMenuList_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GuildMemberMenu_C_BndEvt__WBP_GuildMemberMenu_WBP_GuildMemberMenuList_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_GuildMemberMenu_C_BndEvt__WBP_GuildMemberMenu_WBP_GuildMemberMenuList_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_GuildMemberMenu_C_BndEvt__WBP_GuildMemberMenu_WBP_GuildMemberMenuList_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_GuildMemberMenu_C_BndEvt__WBP_GuildMemberMenu_WBP_GuildMemberMenuList_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_GuildMemberMenu_C_BndEvt__WBP_GuildMemberMenu_WBP_GuildMemberMenuList_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_GuildMemberMenu.WBP_GuildMemberMenu_C.ExecuteUbergraph_WBP_GuildMemberMenu
// 0x0048 (0x0048 - 0x0000)
struct WBP_GuildMemberMenu_C_ExecuteUbergraph_WBP_GuildMemberMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5889[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text;          // 0x0008(0x0018)()
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_1;        // 0x0020(0x0018)()
	class UWBP_GuildMemberMenuList_C*             K2Node_ComponentBoundEvent_Button_1;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_GuildMemberMenuList_C*             K2Node_ComponentBoundEvent_Button;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GuildMemberMenu_C_ExecuteUbergraph_WBP_GuildMemberMenu) == 0x000008, "Wrong alignment on WBP_GuildMemberMenu_C_ExecuteUbergraph_WBP_GuildMemberMenu");
static_assert(sizeof(WBP_GuildMemberMenu_C_ExecuteUbergraph_WBP_GuildMemberMenu) == 0x000048, "Wrong size on WBP_GuildMemberMenu_C_ExecuteUbergraph_WBP_GuildMemberMenu");
static_assert(offsetof(WBP_GuildMemberMenu_C_ExecuteUbergraph_WBP_GuildMemberMenu, EntryPoint) == 0x000000, "Member 'WBP_GuildMemberMenu_C_ExecuteUbergraph_WBP_GuildMemberMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GuildMemberMenu_C_ExecuteUbergraph_WBP_GuildMemberMenu, CallFunc_GetLocalizedTextFromHandle_Text) == 0x000008, "Member 'WBP_GuildMemberMenu_C_ExecuteUbergraph_WBP_GuildMemberMenu::CallFunc_GetLocalizedTextFromHandle_Text' has a wrong offset!");
static_assert(offsetof(WBP_GuildMemberMenu_C_ExecuteUbergraph_WBP_GuildMemberMenu, CallFunc_GetLocalizedTextFromHandle_Text_1) == 0x000020, "Member 'WBP_GuildMemberMenu_C_ExecuteUbergraph_WBP_GuildMemberMenu::CallFunc_GetLocalizedTextFromHandle_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_GuildMemberMenu_C_ExecuteUbergraph_WBP_GuildMemberMenu, K2Node_ComponentBoundEvent_Button_1) == 0x000038, "Member 'WBP_GuildMemberMenu_C_ExecuteUbergraph_WBP_GuildMemberMenu::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_GuildMemberMenu_C_ExecuteUbergraph_WBP_GuildMemberMenu, K2Node_ComponentBoundEvent_Button) == 0x000040, "Member 'WBP_GuildMemberMenu_C_ExecuteUbergraph_WBP_GuildMemberMenu::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function WBP_GuildMemberMenu.WBP_GuildMemberMenu_C.GetTopFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_GuildMemberMenu_C_GetTopFocusTarget final
{
public:
	class UWidget*                                TargetWidget;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GuildMemberMenu_C_GetTopFocusTarget) == 0x000008, "Wrong alignment on WBP_GuildMemberMenu_C_GetTopFocusTarget");
static_assert(sizeof(WBP_GuildMemberMenu_C_GetTopFocusTarget) == 0x000008, "Wrong size on WBP_GuildMemberMenu_C_GetTopFocusTarget");
static_assert(offsetof(WBP_GuildMemberMenu_C_GetTopFocusTarget, TargetWidget) == 0x000000, "Member 'WBP_GuildMemberMenu_C_GetTopFocusTarget::TargetWidget' has a wrong offset!");

// Function WBP_GuildMemberMenu.WBP_GuildMemberMenu_C.SetPlayerName
// 0x0028 (0x0028 - 0x0000)
struct WBP_GuildMemberMenu_C_SetPlayerName final
{
public:
	class FString                                 DisplayName;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
};
static_assert(alignof(WBP_GuildMemberMenu_C_SetPlayerName) == 0x000008, "Wrong alignment on WBP_GuildMemberMenu_C_SetPlayerName");
static_assert(sizeof(WBP_GuildMemberMenu_C_SetPlayerName) == 0x000028, "Wrong size on WBP_GuildMemberMenu_C_SetPlayerName");
static_assert(offsetof(WBP_GuildMemberMenu_C_SetPlayerName, DisplayName) == 0x000000, "Member 'WBP_GuildMemberMenu_C_SetPlayerName::DisplayName' has a wrong offset!");
static_assert(offsetof(WBP_GuildMemberMenu_C_SetPlayerName, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'WBP_GuildMemberMenu_C_SetPlayerName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

