#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenu_Technology_List

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MainMenu_Technology_List.WBP_MainMenu_Technology_List_C
// 0x0078 (0x02F0 - 0x0278)
class UWBP_MainMenu_Technology_List_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anm_LockToUnlock;                                  // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_TechnologyButton;                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Line;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_TechnologyLevel;                              // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MainMenu_Technology_Content_C*     WBP_MainMenu_Technology_Content_Boss;              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnClickedTechnology;                               // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnHoveredTechnoogy;                                // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnUnhoveredTechnology;                             // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         CachedPlayerLevel;                                 // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CachedTechnologyLevel;                             // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_MainMenu_Technology_Content_C*> TechnologyContents;                                // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void AnmEvent_Lock();
	void AnmEvent_Unlock();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_MainMenu_Technology_List(int32 EntryPoint);
	void Get_Top_Focus_Target(class UWidget** Target);
	void GetButtonIndex(class UWBP_MainMenu_Technology_Content_C* ButtonWidget, int32* Param_Index);
	void GetButtonNum(int32* Num);
	void GetFocusTargetByIndex(int32 ButtonIndex, class UWidget** Widget);
	void OnClickedTechnology__DelegateSignature(class UWBP_MainMenu_Technology_Content_C* Widget);
	void OnClickedTechnology_Internal(class UWBP_MainMenu_Technology_Content_C* Widget);
	void OnHoveredTechnology_Internal(class UWBP_MainMenu_Technology_Content_C* Widget);
	void OnHoveredTechnoogy__DelegateSignature(class UWBP_MainMenu_Technology_Content_C* Widget, class UWBP_MainMenu_Technology_List_C* ListWidget);
	void OnUnhoveredTechnology__DelegateSignature(class UWBP_MainMenu_Technology_Content_C* Widget);
	void OnUnhoveredTechnology_Internal(class UWBP_MainMenu_Technology_Content_C* Widget);
	void OnUpdatePlayerLevel(int32 AddLevel, int32 NowLevel);
	void RegisterButtonEvent(class UWBP_MainMenu_Technology_Content_C* TechnologyContentWidget);
	void RegisterPlayerEvent();
	void SetTechnologyData(const struct FF_PalUITechnologyDataMapContent& DisplayTechnologyData);
	void SetTechnologyLevel(int32 Level);
	void UnregisterAllButtonEvent();
	void UnregisterPlayerEvent();
	void UpdateAllButtonDetail();
	void UpdateListActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MainMenu_Technology_List_C">();
	}
	static class UWBP_MainMenu_Technology_List_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MainMenu_Technology_List_C>();
	}
};
static_assert(alignof(UWBP_MainMenu_Technology_List_C) == 0x000008, "Wrong alignment on UWBP_MainMenu_Technology_List_C");
static_assert(sizeof(UWBP_MainMenu_Technology_List_C) == 0x0002F0, "Wrong size on UWBP_MainMenu_Technology_List_C");
static_assert(offsetof(UWBP_MainMenu_Technology_List_C, UberGraphFrame) == 0x000278, "Member 'UWBP_MainMenu_Technology_List_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_List_C, Anm_LockToUnlock) == 0x000280, "Member 'UWBP_MainMenu_Technology_List_C::Anm_LockToUnlock' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_List_C, HorizontalBox_TechnologyButton) == 0x000288, "Member 'UWBP_MainMenu_Technology_List_C::HorizontalBox_TechnologyButton' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_List_C, Image_Line) == 0x000290, "Member 'UWBP_MainMenu_Technology_List_C::Image_Line' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_List_C, Text_TechnologyLevel) == 0x000298, "Member 'UWBP_MainMenu_Technology_List_C::Text_TechnologyLevel' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_List_C, WBP_MainMenu_Technology_Content_Boss) == 0x0002A0, "Member 'UWBP_MainMenu_Technology_List_C::WBP_MainMenu_Technology_Content_Boss' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_List_C, OnClickedTechnology) == 0x0002A8, "Member 'UWBP_MainMenu_Technology_List_C::OnClickedTechnology' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_List_C, OnHoveredTechnoogy) == 0x0002B8, "Member 'UWBP_MainMenu_Technology_List_C::OnHoveredTechnoogy' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_List_C, OnUnhoveredTechnology) == 0x0002C8, "Member 'UWBP_MainMenu_Technology_List_C::OnUnhoveredTechnology' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_List_C, CachedPlayerLevel) == 0x0002D8, "Member 'UWBP_MainMenu_Technology_List_C::CachedPlayerLevel' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_List_C, CachedTechnologyLevel) == 0x0002DC, "Member 'UWBP_MainMenu_Technology_List_C::CachedTechnologyLevel' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_List_C, TechnologyContents) == 0x0002E0, "Member 'UWBP_MainMenu_Technology_List_C::TechnologyContents' has a wrong offset!");

}

