#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IngameMenuConstruction_LR

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_IngameMenuConstruction_LR.WBP_IngameMenuConstruction_LR_C.ExecuteUbergraph_WBP_IngameMenuConstruction_LR
// 0x0018 (0x0018 - 0x0000)
struct WBP_IngameMenuConstruction_LR_C_ExecuteUbergraph_WBP_IngameMenuConstruction_LR final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4134[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_PalKeyGuideIcon_C*>         K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_IngameMenuConstruction_LR_C_ExecuteUbergraph_WBP_IngameMenuConstruction_LR) == 0x000008, "Wrong alignment on WBP_IngameMenuConstruction_LR_C_ExecuteUbergraph_WBP_IngameMenuConstruction_LR");
static_assert(sizeof(WBP_IngameMenuConstruction_LR_C_ExecuteUbergraph_WBP_IngameMenuConstruction_LR) == 0x000018, "Wrong size on WBP_IngameMenuConstruction_LR_C_ExecuteUbergraph_WBP_IngameMenuConstruction_LR");
static_assert(offsetof(WBP_IngameMenuConstruction_LR_C_ExecuteUbergraph_WBP_IngameMenuConstruction_LR, EntryPoint) == 0x000000, "Member 'WBP_IngameMenuConstruction_LR_C_ExecuteUbergraph_WBP_IngameMenuConstruction_LR::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_LR_C_ExecuteUbergraph_WBP_IngameMenuConstruction_LR, K2Node_MakeArray_Array) == 0x000008, "Member 'WBP_IngameMenuConstruction_LR_C_ExecuteUbergraph_WBP_IngameMenuConstruction_LR::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_IngameMenuConstruction_LR.WBP_IngameMenuConstruction_LR_C.SetInputAction
// 0x0028 (0x0028 - 0x0000)
struct WBP_IngameMenuConstruction_LR_C_SetInputAction final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ActionName;                                        // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4135[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PalKeyGuideIcon_C*                 CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4136[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenuConstruction_LR_C_SetInputAction) == 0x000008, "Wrong alignment on WBP_IngameMenuConstruction_LR_C_SetInputAction");
static_assert(sizeof(WBP_IngameMenuConstruction_LR_C_SetInputAction) == 0x000028, "Wrong size on WBP_IngameMenuConstruction_LR_C_SetInputAction");
static_assert(offsetof(WBP_IngameMenuConstruction_LR_C_SetInputAction, Param_Index) == 0x000000, "Member 'WBP_IngameMenuConstruction_LR_C_SetInputAction::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_LR_C_SetInputAction, ActionName) == 0x000004, "Member 'WBP_IngameMenuConstruction_LR_C_SetInputAction::ActionName' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_LR_C_SetInputAction, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_IngameMenuConstruction_LR_C_SetInputAction::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_LR_C_SetInputAction, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_IngameMenuConstruction_LR_C_SetInputAction::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_LR_C_SetInputAction, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'WBP_IngameMenuConstruction_LR_C_SetInputAction::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_LR_C_SetInputAction, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'WBP_IngameMenuConstruction_LR_C_SetInputAction::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_LR_C_SetInputAction, CallFunc_BooleanAND_ReturnValue) == 0x000021, "Member 'WBP_IngameMenuConstruction_LR_C_SetInputAction::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

