#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WorldMap_IconBase_OnlyIcon

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_WorldMap_IconBase_OnlyIcon.WBP_WorldMap_IconBase_OnlyIcon_C.BndEvt__WBP_WorldMap_IconBase_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_WorldMap_IconBase_OnlyIcon_C_BndEvt__WBP_WorldMap_IconBase_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldMap_IconBase_OnlyIcon_C_BndEvt__WBP_WorldMap_IconBase_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_WorldMap_IconBase_OnlyIcon_C_BndEvt__WBP_WorldMap_IconBase_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_WorldMap_IconBase_OnlyIcon_C_BndEvt__WBP_WorldMap_IconBase_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_WorldMap_IconBase_OnlyIcon_C_BndEvt__WBP_WorldMap_IconBase_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_WorldMap_IconBase_OnlyIcon_C_BndEvt__WBP_WorldMap_IconBase_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_WorldMap_IconBase_OnlyIcon_C_BndEvt__WBP_WorldMap_IconBase_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_WorldMap_IconBase_OnlyIcon.WBP_WorldMap_IconBase_OnlyIcon_C.BndEvt__WBP_WorldMap_IconBase_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_WorldMap_IconBase_OnlyIcon_C_BndEvt__WBP_WorldMap_IconBase_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldMap_IconBase_OnlyIcon_C_BndEvt__WBP_WorldMap_IconBase_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_WorldMap_IconBase_OnlyIcon_C_BndEvt__WBP_WorldMap_IconBase_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_WorldMap_IconBase_OnlyIcon_C_BndEvt__WBP_WorldMap_IconBase_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_WorldMap_IconBase_OnlyIcon_C_BndEvt__WBP_WorldMap_IconBase_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_WorldMap_IconBase_OnlyIcon_C_BndEvt__WBP_WorldMap_IconBase_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_WorldMap_IconBase_OnlyIcon_C_BndEvt__WBP_WorldMap_IconBase_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_WorldMap_IconBase_OnlyIcon.WBP_WorldMap_IconBase_OnlyIcon_C.BndEvt__WBP_WorldMap_IconBase_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_WorldMap_IconBase_OnlyIcon_C_BndEvt__WBP_WorldMap_IconBase_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldMap_IconBase_OnlyIcon_C_BndEvt__WBP_WorldMap_IconBase_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_WorldMap_IconBase_OnlyIcon_C_BndEvt__WBP_WorldMap_IconBase_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_WorldMap_IconBase_OnlyIcon_C_BndEvt__WBP_WorldMap_IconBase_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_WorldMap_IconBase_OnlyIcon_C_BndEvt__WBP_WorldMap_IconBase_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_WorldMap_IconBase_OnlyIcon_C_BndEvt__WBP_WorldMap_IconBase_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_WorldMap_IconBase_OnlyIcon_C_BndEvt__WBP_WorldMap_IconBase_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_WorldMap_IconBase_OnlyIcon.WBP_WorldMap_IconBase_OnlyIcon_C.ChangeTexture
// 0x0008 (0x0008 - 0x0000)
struct WBP_WorldMap_IconBase_OnlyIcon_C_ChangeTexture final
{
public:
	class UTexture2D*                             NewTexture;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldMap_IconBase_OnlyIcon_C_ChangeTexture) == 0x000008, "Wrong alignment on WBP_WorldMap_IconBase_OnlyIcon_C_ChangeTexture");
static_assert(sizeof(WBP_WorldMap_IconBase_OnlyIcon_C_ChangeTexture) == 0x000008, "Wrong size on WBP_WorldMap_IconBase_OnlyIcon_C_ChangeTexture");
static_assert(offsetof(WBP_WorldMap_IconBase_OnlyIcon_C_ChangeTexture, NewTexture) == 0x000000, "Member 'WBP_WorldMap_IconBase_OnlyIcon_C_ChangeTexture::NewTexture' has a wrong offset!");

// Function WBP_WorldMap_IconBase_OnlyIcon.WBP_WorldMap_IconBase_OnlyIcon_C.ExecuteUbergraph_WBP_WorldMap_IconBase_OnlyIcon
// 0x0038 (0x0038 - 0x0000)
struct WBP_WorldMap_IconBase_OnlyIcon_C_ExecuteUbergraph_WBP_WorldMap_IconBase_OnlyIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5161[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5162[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldMap_IconBase_OnlyIcon_C_ExecuteUbergraph_WBP_WorldMap_IconBase_OnlyIcon) == 0x000008, "Wrong alignment on WBP_WorldMap_IconBase_OnlyIcon_C_ExecuteUbergraph_WBP_WorldMap_IconBase_OnlyIcon");
static_assert(sizeof(WBP_WorldMap_IconBase_OnlyIcon_C_ExecuteUbergraph_WBP_WorldMap_IconBase_OnlyIcon) == 0x000038, "Wrong size on WBP_WorldMap_IconBase_OnlyIcon_C_ExecuteUbergraph_WBP_WorldMap_IconBase_OnlyIcon");
static_assert(offsetof(WBP_WorldMap_IconBase_OnlyIcon_C_ExecuteUbergraph_WBP_WorldMap_IconBase_OnlyIcon, EntryPoint) == 0x000000, "Member 'WBP_WorldMap_IconBase_OnlyIcon_C_ExecuteUbergraph_WBP_WorldMap_IconBase_OnlyIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_WorldMap_IconBase_OnlyIcon_C_ExecuteUbergraph_WBP_WorldMap_IconBase_OnlyIcon, K2Node_ComponentBoundEvent_Button_2) == 0x000008, "Member 'WBP_WorldMap_IconBase_OnlyIcon_C_ExecuteUbergraph_WBP_WorldMap_IconBase_OnlyIcon::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_WorldMap_IconBase_OnlyIcon_C_ExecuteUbergraph_WBP_WorldMap_IconBase_OnlyIcon, K2Node_ComponentBoundEvent_Button_1) == 0x000010, "Member 'WBP_WorldMap_IconBase_OnlyIcon_C_ExecuteUbergraph_WBP_WorldMap_IconBase_OnlyIcon::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldMap_IconBase_OnlyIcon_C_ExecuteUbergraph_WBP_WorldMap_IconBase_OnlyIcon, K2Node_ComponentBoundEvent_Button) == 0x000018, "Member 'WBP_WorldMap_IconBase_OnlyIcon_C_ExecuteUbergraph_WBP_WorldMap_IconBase_OnlyIcon::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_WorldMap_IconBase_OnlyIcon_C_ExecuteUbergraph_WBP_WorldMap_IconBase_OnlyIcon, K2Node_Event_IsDesignTime) == 0x000020, "Member 'WBP_WorldMap_IconBase_OnlyIcon_C_ExecuteUbergraph_WBP_WorldMap_IconBase_OnlyIcon::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_WorldMap_IconBase_OnlyIcon_C_ExecuteUbergraph_WBP_WorldMap_IconBase_OnlyIcon, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'WBP_WorldMap_IconBase_OnlyIcon_C_ExecuteUbergraph_WBP_WorldMap_IconBase_OnlyIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldMap_IconBase_OnlyIcon_C_ExecuteUbergraph_WBP_WorldMap_IconBase_OnlyIcon, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'WBP_WorldMap_IconBase_OnlyIcon_C_ExecuteUbergraph_WBP_WorldMap_IconBase_OnlyIcon::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldMap_IconBase_OnlyIcon_C_ExecuteUbergraph_WBP_WorldMap_IconBase_OnlyIcon, CallFunc_PlayAnimation_ReturnValue_1) == 0x000030, "Member 'WBP_WorldMap_IconBase_OnlyIcon_C_ExecuteUbergraph_WBP_WorldMap_IconBase_OnlyIcon::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function WBP_WorldMap_IconBase_OnlyIcon.WBP_WorldMap_IconBase_OnlyIcon_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_WorldMap_IconBase_OnlyIcon_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldMap_IconBase_OnlyIcon_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_WorldMap_IconBase_OnlyIcon_C_PreConstruct");
static_assert(sizeof(WBP_WorldMap_IconBase_OnlyIcon_C_PreConstruct) == 0x000001, "Wrong size on WBP_WorldMap_IconBase_OnlyIcon_C_PreConstruct");
static_assert(offsetof(WBP_WorldMap_IconBase_OnlyIcon_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_WorldMap_IconBase_OnlyIcon_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_WorldMap_IconBase_OnlyIcon.WBP_WorldMap_IconBase_OnlyIcon_C.Setup_Internal
// 0x0008 (0x0008 - 0x0000)
struct WBP_WorldMap_IconBase_OnlyIcon_C_Setup_Internal final
{
public:
	class UPalLocationPoint*                      LocationPoint;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldMap_IconBase_OnlyIcon_C_Setup_Internal) == 0x000008, "Wrong alignment on WBP_WorldMap_IconBase_OnlyIcon_C_Setup_Internal");
static_assert(sizeof(WBP_WorldMap_IconBase_OnlyIcon_C_Setup_Internal) == 0x000008, "Wrong size on WBP_WorldMap_IconBase_OnlyIcon_C_Setup_Internal");
static_assert(offsetof(WBP_WorldMap_IconBase_OnlyIcon_C_Setup_Internal, LocationPoint) == 0x000000, "Member 'WBP_WorldMap_IconBase_OnlyIcon_C_Setup_Internal::LocationPoint' has a wrong offset!");

}

