#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BattleEntry_Member

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_BattleEntry_Member.WBP_BattleEntry_Member_C.AddTaslDetailText
// 0x0030 (0x0030 - 0x0000)
struct WBP_BattleEntry_Member_C_AddTaslDetailText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         NowNum;                                            // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RequireNum;                                        // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterial*>                      NewLocalVar_0;                                     // 0x0020(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(WBP_BattleEntry_Member_C_AddTaslDetailText) == 0x000008, "Wrong alignment on WBP_BattleEntry_Member_C_AddTaslDetailText");
static_assert(sizeof(WBP_BattleEntry_Member_C_AddTaslDetailText) == 0x000030, "Wrong size on WBP_BattleEntry_Member_C_AddTaslDetailText");
static_assert(offsetof(WBP_BattleEntry_Member_C_AddTaslDetailText, Text) == 0x000000, "Member 'WBP_BattleEntry_Member_C_AddTaslDetailText::Text' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_AddTaslDetailText, NowNum) == 0x000018, "Member 'WBP_BattleEntry_Member_C_AddTaslDetailText::NowNum' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_AddTaslDetailText, RequireNum) == 0x00001C, "Member 'WBP_BattleEntry_Member_C_AddTaslDetailText::RequireNum' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_AddTaslDetailText, NewLocalVar_0) == 0x000020, "Member 'WBP_BattleEntry_Member_C_AddTaslDetailText::NewLocalVar_0' has a wrong offset!");

// Function WBP_BattleEntry_Member.WBP_BattleEntry_Member_C.ExecuteUbergraph_WBP_BattleEntry_Member
// 0x0178 (0x0178 - 0x0000)
struct WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BossType;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APalPlayerCharacter*>            K2Node_CustomEvent_PlayerList;                     // 0x0020(0x0010)(ConstParm, ReferenceParm)
	class UPalBossBattleManager*                  CallFunc_GetBossBattleManager_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxJoinablePlayerNum_ReturnValue;      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5474[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5475[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0050)(HasGetValueTypeHash)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x00A8(0x0010)(NoDestructor)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text;          // 0x00C8(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0018)()
	class UWBP_BattleEntry_MemberList_C*          CallFunc_SpawnObject_ReturnValue;                  // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_BattleEntry_MemberList_C*          CallFunc_Array_Get_Item;                           // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5476[0x3];                                     // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalPlayerCharacter*                    CallFunc_Array_Get_Item_1;                         // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5477[0x2];                                     // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_GetPlayerUIDByActor_ReturnValue;          // 0x012C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLevel_ReturnValue;                     // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetNickName_outName;                      // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_GetLocalPlayerUID_ReturnValue;            // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GuidGuid_ReturnValue;          // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5478[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member) == 0x000008, "Wrong alignment on WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member");
static_assert(sizeof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member) == 0x000178, "Wrong size on WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, EntryPoint) == 0x000000, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, K2Node_CustomEvent_BossType) == 0x000018, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::K2Node_CustomEvent_BossType' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, K2Node_CustomEvent_PlayerList) == 0x000020, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::K2Node_CustomEvent_PlayerList' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, CallFunc_GetBossBattleManager_ReturnValue) == 0x000030, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::CallFunc_GetBossBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, CallFunc_GetMaxJoinablePlayerNum_ReturnValue) == 0x00003C, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::CallFunc_GetMaxJoinablePlayerNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, CallFunc_Array_Length_ReturnValue_1) == 0x000044, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000048, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000050, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, K2Node_MakeStruct_FormatArgumentData) == 0x000058, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, K2Node_MakeStruct_DataTableRowHandle) == 0x0000A8, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, K2Node_MakeArray_Array) == 0x0000B8, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, CallFunc_GetLocalizedTextFromHandle_Text) == 0x0000C8, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::CallFunc_GetLocalizedTextFromHandle_Text' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, CallFunc_SpawnObject_ReturnValue) == 0x0000F8, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000100, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, CallFunc_Array_Get_Item) == 0x000108, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, CallFunc_Array_Length_ReturnValue_2) == 0x000110, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, CallFunc_Less_IntInt_ReturnValue_1) == 0x000114, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, Temp_int_Array_Index_Variable_1) == 0x000118, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, CallFunc_Array_Add_ReturnValue) == 0x00011C, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, CallFunc_Array_Get_Item_1) == 0x000120, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, CallFunc_Less_IntInt_ReturnValue_2) == 0x000128, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, CallFunc_IsValid_ReturnValue_1) == 0x000129, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, CallFunc_GetPlayerUIDByActor_ReturnValue) == 0x00012C, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::CallFunc_GetPlayerUIDByActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, CallFunc_GetLevel_ReturnValue) == 0x00013C, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::CallFunc_GetLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, CallFunc_GetNickName_outName) == 0x000140, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::CallFunc_GetNickName_outName' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, CallFunc_GetLocalPlayerUID_ReturnValue) == 0x000150, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::CallFunc_GetLocalPlayerUID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, CallFunc_EqualEqual_GuidGuid_ReturnValue) == 0x000160, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::CallFunc_EqualEqual_GuidGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, CallFunc_GetPalmi_ReturnValue) == 0x000168, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member, CallFunc_Array_Contains_ReturnValue) == 0x000170, "Member 'WBP_BattleEntry_Member_C_ExecuteUbergraph_WBP_BattleEntry_Member::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function WBP_BattleEntry_Member.WBP_BattleEntry_Member_C.OnChangedBossBattlePlayerListEvent
// 0x0018 (0x0018 - 0x0000)
struct WBP_BattleEntry_Member_C_OnChangedBossBattlePlayerListEvent final
{
public:
	class FName                                   BossType;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APalPlayerCharacter*>            PlayerList;                                        // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_BattleEntry_Member_C_OnChangedBossBattlePlayerListEvent) == 0x000008, "Wrong alignment on WBP_BattleEntry_Member_C_OnChangedBossBattlePlayerListEvent");
static_assert(sizeof(WBP_BattleEntry_Member_C_OnChangedBossBattlePlayerListEvent) == 0x000018, "Wrong size on WBP_BattleEntry_Member_C_OnChangedBossBattlePlayerListEvent");
static_assert(offsetof(WBP_BattleEntry_Member_C_OnChangedBossBattlePlayerListEvent, BossType) == 0x000000, "Member 'WBP_BattleEntry_Member_C_OnChangedBossBattlePlayerListEvent::BossType' has a wrong offset!");
static_assert(offsetof(WBP_BattleEntry_Member_C_OnChangedBossBattlePlayerListEvent, PlayerList) == 0x000008, "Member 'WBP_BattleEntry_Member_C_OnChangedBossBattlePlayerListEvent::PlayerList' has a wrong offset!");

}

