#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IngameMenuConstruction_LR

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_IngameMenuConstruction_LR.WBP_IngameMenuConstruction_LR_C
// 0x0040 (0x02B8 - 0x0278)
class UWBP_IngameMenuConstruction_LR_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anm_PushArrowR;                                    // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anm_PushArrowL;                                    // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ArrowImage;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalKeyGuideIcon_C*                 WBP_PalKeyGuideIcon;                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalKeyGuideIcon_C*                 WBP_PalKeyGuideIcon_1;                             // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_PalKeyGuideIcon_C*>         Icons;                                             // 0x02A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_WBP_IngameMenuConstruction_LR(int32 EntryPoint);
	void OnInitialized();
	void SetInputAction(int32 Param_Index, class FName ActionName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_IngameMenuConstruction_LR_C">();
	}
	static class UWBP_IngameMenuConstruction_LR_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_IngameMenuConstruction_LR_C>();
	}
};
static_assert(alignof(UWBP_IngameMenuConstruction_LR_C) == 0x000008, "Wrong alignment on UWBP_IngameMenuConstruction_LR_C");
static_assert(sizeof(UWBP_IngameMenuConstruction_LR_C) == 0x0002B8, "Wrong size on UWBP_IngameMenuConstruction_LR_C");
static_assert(offsetof(UWBP_IngameMenuConstruction_LR_C, UberGraphFrame) == 0x000278, "Member 'UWBP_IngameMenuConstruction_LR_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_LR_C, Anm_PushArrowR) == 0x000280, "Member 'UWBP_IngameMenuConstruction_LR_C::Anm_PushArrowR' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_LR_C, Anm_PushArrowL) == 0x000288, "Member 'UWBP_IngameMenuConstruction_LR_C::Anm_PushArrowL' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_LR_C, ArrowImage) == 0x000290, "Member 'UWBP_IngameMenuConstruction_LR_C::ArrowImage' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_LR_C, WBP_PalKeyGuideIcon) == 0x000298, "Member 'UWBP_IngameMenuConstruction_LR_C::WBP_PalKeyGuideIcon' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_LR_C, WBP_PalKeyGuideIcon_1) == 0x0002A0, "Member 'UWBP_IngameMenuConstruction_LR_C::WBP_PalKeyGuideIcon_1' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_LR_C, Icons) == 0x0002A8, "Member 'UWBP_IngameMenuConstruction_LR_C::Icons' has a wrong offset!");

}

