#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PalHud_PossessItem

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_PalHud_PossessItem.WBP_PalHud_PossessItem_C.ExecuteUbergraph_WBP_PalHud_PossessItem
// 0x0014 (0x0014 - 0x0000)
struct WBP_PalHud_PossessItem_C_ExecuteUbergraph_WBP_PalHud_PossessItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalHud_PossessItem_C_ExecuteUbergraph_WBP_PalHud_PossessItem) == 0x000004, "Wrong alignment on WBP_PalHud_PossessItem_C_ExecuteUbergraph_WBP_PalHud_PossessItem");
static_assert(sizeof(WBP_PalHud_PossessItem_C_ExecuteUbergraph_WBP_PalHud_PossessItem) == 0x000014, "Wrong size on WBP_PalHud_PossessItem_C_ExecuteUbergraph_WBP_PalHud_PossessItem");
static_assert(offsetof(WBP_PalHud_PossessItem_C_ExecuteUbergraph_WBP_PalHud_PossessItem, EntryPoint) == 0x000000, "Member 'WBP_PalHud_PossessItem_C_ExecuteUbergraph_WBP_PalHud_PossessItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PalHud_PossessItem_C_ExecuteUbergraph_WBP_PalHud_PossessItem, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_PalHud_PossessItem_C_ExecuteUbergraph_WBP_PalHud_PossessItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_PalHud_PossessItem.WBP_PalHud_PossessItem_C.SetupUI
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_PalHud_PossessItem_C_SetupUI final
{
public:
	class UPalItemIDManager*                      CallFunc_GetItemIDManager_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalHUDDispatchParameterBase*           CallFunc_GetParam_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalUIItemPossessStatusIndicatorParameter* K2Node_DynamicCast_AsPal_UIItem_Possess_Status_Indicator_Parameter; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A39[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_TryGetIndividualActor_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A3A[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalStaticItemDataBase*                 CallFunc_GetStaticItemData_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0038(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A3B[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalHud_PossessItem_C_SetupUI) == 0x000008, "Wrong alignment on WBP_PalHud_PossessItem_C_SetupUI");
static_assert(sizeof(WBP_PalHud_PossessItem_C_SetupUI) == 0x0000E0, "Wrong size on WBP_PalHud_PossessItem_C_SetupUI");
static_assert(offsetof(WBP_PalHud_PossessItem_C_SetupUI, CallFunc_GetItemIDManager_ReturnValue) == 0x000000, "Member 'WBP_PalHud_PossessItem_C_SetupUI::CallFunc_GetItemIDManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHud_PossessItem_C_SetupUI, CallFunc_GetParam_ReturnValue) == 0x000008, "Member 'WBP_PalHud_PossessItem_C_SetupUI::CallFunc_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHud_PossessItem_C_SetupUI, K2Node_DynamicCast_AsPal_UIItem_Possess_Status_Indicator_Parameter) == 0x000010, "Member 'WBP_PalHud_PossessItem_C_SetupUI::K2Node_DynamicCast_AsPal_UIItem_Possess_Status_Indicator_Parameter' has a wrong offset!");
static_assert(offsetof(WBP_PalHud_PossessItem_C_SetupUI, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_PalHud_PossessItem_C_SetupUI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PalHud_PossessItem_C_SetupUI, CallFunc_TryGetIndividualActor_ReturnValue) == 0x000020, "Member 'WBP_PalHud_PossessItem_C_SetupUI::CallFunc_TryGetIndividualActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHud_PossessItem_C_SetupUI, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WBP_PalHud_PossessItem_C_SetupUI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHud_PossessItem_C_SetupUI, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'WBP_PalHud_PossessItem_C_SetupUI::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalHud_PossessItem_C_SetupUI, CallFunc_GetStaticItemData_ReturnValue) == 0x000030, "Member 'WBP_PalHud_PossessItem_C_SetupUI::CallFunc_GetStaticItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHud_PossessItem_C_SetupUI, CallFunc_Conv_NameToText_ReturnValue) == 0x000038, "Member 'WBP_PalHud_PossessItem_C_SetupUI::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHud_PossessItem_C_SetupUI, CallFunc_IsValid_ReturnValue_2) == 0x000050, "Member 'WBP_PalHud_PossessItem_C_SetupUI::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PalHud_PossessItem_C_SetupUI, K2Node_MakeStruct_FormatArgumentData) == 0x000058, "Member 'WBP_PalHud_PossessItem_C_SetupUI::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_PalHud_PossessItem_C_SetupUI, K2Node_MakeArray_Array) == 0x0000A8, "Member 'WBP_PalHud_PossessItem_C_SetupUI::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_PalHud_PossessItem_C_SetupUI, CallFunc_Format_ReturnValue) == 0x0000B8, "Member 'WBP_PalHud_PossessItem_C_SetupUI::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHud_PossessItem_C_SetupUI, CallFunc_Conv_TextToString_ReturnValue) == 0x0000D0, "Member 'WBP_PalHud_PossessItem_C_SetupUI::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

}

