#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RadialMenu_base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RadialMenu_base.WBP_RadialMenu_base_C
// 0x0058 (0x02D0 - 0x0278)
class UWBP_RadialMenu_base_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anm_Close;                                         // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anm_Open;                                          // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           ArrowCanvas;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base;                                              // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_1;                                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CenterCanvas;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arrow;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line;                                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MenuCanvas;                                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Anm_CloseMenu();
	void Anm_OpenMenu();
	void ExecuteUbergraph_WBP_RadialMenu_base(int32 EntryPoint);
	void GetCenterPosition(struct FVector2D* Position);
	void SetArrowAngle(double AngleDegree);
	void SetArrowVisible(ESlateVisibility Param_Visibility);
	void SetVisibilityArrow(ESlateVisibility NewVisibility);
	void SetVisibilityCenterBaseImage(ESlateVisibility NewVisibility);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RadialMenu_base_C">();
	}
	static class UWBP_RadialMenu_base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RadialMenu_base_C>();
	}
};
static_assert(alignof(UWBP_RadialMenu_base_C) == 0x000008, "Wrong alignment on UWBP_RadialMenu_base_C");
static_assert(sizeof(UWBP_RadialMenu_base_C) == 0x0002D0, "Wrong size on UWBP_RadialMenu_base_C");
static_assert(offsetof(UWBP_RadialMenu_base_C, UberGraphFrame) == 0x000278, "Member 'UWBP_RadialMenu_base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_base_C, Anm_Close) == 0x000280, "Member 'UWBP_RadialMenu_base_C::Anm_Close' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_base_C, Anm_Open) == 0x000288, "Member 'UWBP_RadialMenu_base_C::Anm_Open' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_base_C, ArrowCanvas) == 0x000290, "Member 'UWBP_RadialMenu_base_C::ArrowCanvas' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_base_C, Base) == 0x000298, "Member 'UWBP_RadialMenu_base_C::Base' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_base_C, Base_1) == 0x0002A0, "Member 'UWBP_RadialMenu_base_C::Base_1' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_base_C, CenterCanvas) == 0x0002A8, "Member 'UWBP_RadialMenu_base_C::CenterCanvas' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_base_C, Image_Arrow) == 0x0002B0, "Member 'UWBP_RadialMenu_base_C::Image_Arrow' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_base_C, Line) == 0x0002B8, "Member 'UWBP_RadialMenu_base_C::Line' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_base_C, MenuCanvas) == 0x0002C0, "Member 'UWBP_RadialMenu_base_C::MenuCanvas' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_base_C, Shadow) == 0x0002C8, "Member 'UWBP_RadialMenu_base_C::Shadow' has a wrong offset!");

}

