#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Paldex_Map

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Pal_structs.hpp"
#include "E_PaldexDistributionTimeType_structs.hpp"


namespace SDK::Params
{

// Function WBP_Paldex_Map.WBP_Paldex_Map_C.AddOffset
// 0x0068 (0x0068 - 0x0000)
struct WBP_Paldex_Map_C_AddOffset final
{
public:
	struct FVector2D                              Offset;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_1;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue_1;                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Paldex_Map_C_AddOffset) == 0x000008, "Wrong alignment on WBP_Paldex_Map_C_AddOffset");
static_assert(sizeof(WBP_Paldex_Map_C_AddOffset) == 0x000068, "Wrong size on WBP_Paldex_Map_C_AddOffset");
static_assert(offsetof(WBP_Paldex_Map_C_AddOffset, Offset) == 0x000000, "Member 'WBP_Paldex_Map_C_AddOffset::Offset' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_AddOffset, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_Paldex_Map_C_AddOffset::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_AddOffset, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000018, "Member 'WBP_Paldex_Map_C_AddOffset::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_AddOffset, CallFunc_BreakVector2D_X) == 0x000028, "Member 'WBP_Paldex_Map_C_AddOffset::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_AddOffset, CallFunc_BreakVector2D_Y) == 0x000030, "Member 'WBP_Paldex_Map_C_AddOffset::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_AddOffset, CallFunc_FMax_ReturnValue) == 0x000038, "Member 'WBP_Paldex_Map_C_AddOffset::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_AddOffset, CallFunc_FMax_ReturnValue_1) == 0x000040, "Member 'WBP_Paldex_Map_C_AddOffset::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_AddOffset, CallFunc_FMin_ReturnValue) == 0x000048, "Member 'WBP_Paldex_Map_C_AddOffset::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_AddOffset, CallFunc_FMin_ReturnValue_1) == 0x000050, "Member 'WBP_Paldex_Map_C_AddOffset::CallFunc_FMin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_AddOffset, CallFunc_MakeVector2D_ReturnValue) == 0x000058, "Member 'WBP_Paldex_Map_C_AddOffset::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function WBP_Paldex_Map.WBP_Paldex_Map_C.AddZoomRate
// 0x0020 (0x0020 - 0x0000)
struct WBP_Paldex_Map_C_AddZoomRate final
{
public:
	double                                        Param_AddZoomRate;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Paldex_Map_C_AddZoomRate) == 0x000008, "Wrong alignment on WBP_Paldex_Map_C_AddZoomRate");
static_assert(sizeof(WBP_Paldex_Map_C_AddZoomRate) == 0x000020, "Wrong size on WBP_Paldex_Map_C_AddZoomRate");
static_assert(offsetof(WBP_Paldex_Map_C_AddZoomRate, Param_AddZoomRate) == 0x000000, "Member 'WBP_Paldex_Map_C_AddZoomRate::Param_AddZoomRate' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_AddZoomRate, CallFunc_BreakVector2D_X) == 0x000008, "Member 'WBP_Paldex_Map_C_AddZoomRate::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_AddZoomRate, CallFunc_BreakVector2D_Y) == 0x000010, "Member 'WBP_Paldex_Map_C_AddZoomRate::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_AddZoomRate, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_Paldex_Map_C_AddZoomRate::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

// Function WBP_Paldex_Map.WBP_Paldex_Map_C.BndEvt__WBP_Paldex_Map_WBP_PalInvisibleButton_Day_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Paldex_Map_C_BndEvt__WBP_Paldex_Map_WBP_PalInvisibleButton_Day_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Paldex_Map_C_BndEvt__WBP_Paldex_Map_WBP_PalInvisibleButton_Day_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Paldex_Map_C_BndEvt__WBP_Paldex_Map_WBP_PalInvisibleButton_Day_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Paldex_Map_C_BndEvt__WBP_Paldex_Map_WBP_PalInvisibleButton_Day_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Paldex_Map_C_BndEvt__WBP_Paldex_Map_WBP_PalInvisibleButton_Day_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Paldex_Map_C_BndEvt__WBP_Paldex_Map_WBP_PalInvisibleButton_Day_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Paldex_Map_C_BndEvt__WBP_Paldex_Map_WBP_PalInvisibleButton_Day_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Paldex_Map.WBP_Paldex_Map_C.BndEvt__WBP_Paldex_Map_WBP_PalInvisibleButton_Night_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Paldex_Map_C_BndEvt__WBP_Paldex_Map_WBP_PalInvisibleButton_Night_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Paldex_Map_C_BndEvt__WBP_Paldex_Map_WBP_PalInvisibleButton_Night_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Paldex_Map_C_BndEvt__WBP_Paldex_Map_WBP_PalInvisibleButton_Night_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Paldex_Map_C_BndEvt__WBP_Paldex_Map_WBP_PalInvisibleButton_Night_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Paldex_Map_C_BndEvt__WBP_Paldex_Map_WBP_PalInvisibleButton_Night_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Paldex_Map_C_BndEvt__WBP_Paldex_Map_WBP_PalInvisibleButton_Night_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Paldex_Map_C_BndEvt__WBP_Paldex_Map_WBP_PalInvisibleButton_Night_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Paldex_Map.WBP_Paldex_Map_C.ExecuteUbergraph_WBP_Paldex_Map
// 0x0438 (0x0438 - 0x0000)
struct WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5111[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5112[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPalWorldMapUIDataTableRow             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0030(0x00D8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5113[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0110(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalWorldMapUIRegionData               CallFunc_Map_Find_Value;                           // 0x0130(0x0058)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5114[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D_1;                 // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5115[0x7];                                     // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalWorldMapUIData*                     CallFunc_GetLocalWorldMapData_ReturnValue;         // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5116[0x7];                                     // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetAbs2D_ReturnValue;                     // 0x01D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPalWorldMapUIDataTableRow             CallFunc_GetCurrentPlayMapUIData_outData;          // 0x01E8(0x00D8)()
	bool                                          CallFunc_GetCurrentPlayMapUIData_ReturnValue;      // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5117[0x7];                                     // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0300(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0310(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0320(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0330(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalWorldMapUIDataTableRow             CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0340(0x00D8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5118[0x7];                                     // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalWorldMapUIData*                     CallFunc_GetLocalWorldMapData_ReturnValue_1;       // 0x0420(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_CustomEvent_TargetMaterial;                 // 0x0428(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map) == 0x000008, "Wrong alignment on WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map");
static_assert(sizeof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map) == 0x000438, "Wrong size on WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, EntryPoint) == 0x000000, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, Temp_object_Variable) == 0x000008, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, K2Node_DynamicCast_AsTexture_2D) == 0x000020, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, CallFunc_GetDataTableRowFromName_OutRow) == 0x000030, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000108, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, CallFunc_Map_Keys_Keys) == 0x000110, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, CallFunc_Array_Get_Item) == 0x000120, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, CallFunc_PlayAnimation_ReturnValue) == 0x000128, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, CallFunc_Map_Find_Value) == 0x000130, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, CallFunc_Map_Find_ReturnValue) == 0x000188, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000190, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, CallFunc_PlayAnimation_ReturnValue_1) == 0x000198, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, K2Node_DynamicCast_AsTexture_2D_1) == 0x0001A0, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::K2Node_DynamicCast_AsTexture_2D_1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, K2Node_DynamicCast_bSuccess_1) == 0x0001A8, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, CallFunc_PlayAnimation_ReturnValue_2) == 0x0001B0, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, CallFunc_GetLocalWorldMapData_ReturnValue) == 0x0001B8, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::CallFunc_GetLocalWorldMapData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x0001C0, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, CallFunc_IsValid_ReturnValue) == 0x0001D0, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, CallFunc_GetAbs2D_ReturnValue) == 0x0001D8, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::CallFunc_GetAbs2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, CallFunc_GetCurrentPlayMapUIData_outData) == 0x0001E8, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::CallFunc_GetCurrentPlayMapUIData_outData' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, CallFunc_GetCurrentPlayMapUIData_ReturnValue) == 0x0002C0, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::CallFunc_GetCurrentPlayMapUIData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, K2Node_CustomEvent_Loaded) == 0x0002C8, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, CallFunc_BreakVector_X) == 0x0002D0, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, CallFunc_BreakVector_Y) == 0x0002D8, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, CallFunc_BreakVector_Z) == 0x0002E0, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, CallFunc_BreakVector_X_1) == 0x0002E8, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, CallFunc_BreakVector_Y_1) == 0x0002F0, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, CallFunc_BreakVector_Z_1) == 0x0002F8, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, CallFunc_MakeVector2D_ReturnValue) == 0x000300, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, CallFunc_MakeVector2D_ReturnValue_1) == 0x000310, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, K2Node_ComponentBoundEvent_Button_1) == 0x000320, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000328, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, K2Node_ComponentBoundEvent_Button) == 0x000330, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000338, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000340, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000418, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, CallFunc_GetLocalWorldMapData_ReturnValue_1) == 0x000420, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::CallFunc_GetLocalWorldMapData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, K2Node_CustomEvent_TargetMaterial) == 0x000428, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::K2Node_CustomEvent_TargetMaterial' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map, CallFunc_IsValid_ReturnValue_1) == 0x000430, "Member 'WBP_Paldex_Map_C_ExecuteUbergraph_WBP_Paldex_Map::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_Paldex_Map.WBP_Paldex_Map_C.IsZoomMax
// 0x0020 (0x0020 - 0x0000)
struct WBP_Paldex_Map_C_IsZoomMax final
{
public:
	bool                                          IsMax;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5119[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Paldex_Map_C_IsZoomMax) == 0x000008, "Wrong alignment on WBP_Paldex_Map_C_IsZoomMax");
static_assert(sizeof(WBP_Paldex_Map_C_IsZoomMax) == 0x000020, "Wrong size on WBP_Paldex_Map_C_IsZoomMax");
static_assert(offsetof(WBP_Paldex_Map_C_IsZoomMax, IsMax) == 0x000000, "Member 'WBP_Paldex_Map_C_IsZoomMax::IsMax' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_IsZoomMax, CallFunc_BreakVector2D_X) == 0x000008, "Member 'WBP_Paldex_Map_C_IsZoomMax::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_IsZoomMax, CallFunc_BreakVector2D_Y) == 0x000010, "Member 'WBP_Paldex_Map_C_IsZoomMax::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_IsZoomMax, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_Paldex_Map_C_IsZoomMax::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");

// Function WBP_Paldex_Map.WBP_Paldex_Map_C.LoadAndApplyDefaultMaskTexture
// 0x0008 (0x0008 - 0x0000)
struct WBP_Paldex_Map_C_LoadAndApplyDefaultMaskTexture final
{
public:
	class UMaterialInstanceDynamic*               TargetMaterial;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Paldex_Map_C_LoadAndApplyDefaultMaskTexture) == 0x000008, "Wrong alignment on WBP_Paldex_Map_C_LoadAndApplyDefaultMaskTexture");
static_assert(sizeof(WBP_Paldex_Map_C_LoadAndApplyDefaultMaskTexture) == 0x000008, "Wrong size on WBP_Paldex_Map_C_LoadAndApplyDefaultMaskTexture");
static_assert(offsetof(WBP_Paldex_Map_C_LoadAndApplyDefaultMaskTexture, TargetMaterial) == 0x000000, "Member 'WBP_Paldex_Map_C_LoadAndApplyDefaultMaskTexture::TargetMaterial' has a wrong offset!");

// Function WBP_Paldex_Map.WBP_Paldex_Map_C.OnLoaded_EA50B4624B0D0BBAA2C2429C4AAD87A5
// 0x0008 (0x0008 - 0x0000)
struct WBP_Paldex_Map_C_OnLoaded_EA50B4624B0D0BBAA2C2429C4AAD87A5 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Paldex_Map_C_OnLoaded_EA50B4624B0D0BBAA2C2429C4AAD87A5) == 0x000008, "Wrong alignment on WBP_Paldex_Map_C_OnLoaded_EA50B4624B0D0BBAA2C2429C4AAD87A5");
static_assert(sizeof(WBP_Paldex_Map_C_OnLoaded_EA50B4624B0D0BBAA2C2429C4AAD87A5) == 0x000008, "Wrong size on WBP_Paldex_Map_C_OnLoaded_EA50B4624B0D0BBAA2C2429C4AAD87A5");
static_assert(offsetof(WBP_Paldex_Map_C_OnLoaded_EA50B4624B0D0BBAA2C2429C4AAD87A5, Loaded) == 0x000000, "Member 'WBP_Paldex_Map_C_OnLoaded_EA50B4624B0D0BBAA2C2429C4AAD87A5::Loaded' has a wrong offset!");

// Function WBP_Paldex_Map.WBP_Paldex_Map_C.OnSwitchDayNight__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Paldex_Map_C_OnSwitchDayNight__DelegateSignature final
{
public:
	E_PaldexDistributionTimeType                  Time;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Paldex_Map_C_OnSwitchDayNight__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Paldex_Map_C_OnSwitchDayNight__DelegateSignature");
static_assert(sizeof(WBP_Paldex_Map_C_OnSwitchDayNight__DelegateSignature) == 0x000001, "Wrong size on WBP_Paldex_Map_C_OnSwitchDayNight__DelegateSignature");
static_assert(offsetof(WBP_Paldex_Map_C_OnSwitchDayNight__DelegateSignature, Time) == 0x000000, "Member 'WBP_Paldex_Map_C_OnSwitchDayNight__DelegateSignature::Time' has a wrong offset!");

// Function WBP_Paldex_Map.WBP_Paldex_Map_C.SetDistributionLocations
// 0x0160 (0x0160 - 0x0000)
struct WBP_Paldex_Map_C_SetDistributionLocations final
{
public:
	struct FPalUIPaldexDistributionLocationStruct DayTimeLocationStruct;                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FPalUIPaldexDistributionLocationStruct NightTimeLocationStruct;                           // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	E_PaldexDistributionTimeType                  TimeType;                                          // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNoDistribution;                                  // 0x0031(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511A[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CreatedWidget;                                     // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerState*                        CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Map_IconPlayer_C*                  CallFunc_Create_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FPalPlayerInfoForMap                   CallFunc_GetPlayerInfoForMap_ReturnValue;          // 0x0070(0x0070)()
	struct FVector                                CallFunc_GetLocationPosition_LocationPosition;     // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511B[0x5];                                     // 0x0103(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_1;                         // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511C[0x3];                                     // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511D[0x2];                                     // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetupCircleWidget_realSpawnSize_ImplicitCast; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetupCircleWidget_realSpawnSize_ImplicitCast_1; // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Paldex_Map_C_SetDistributionLocations) == 0x000010, "Wrong alignment on WBP_Paldex_Map_C_SetDistributionLocations");
static_assert(sizeof(WBP_Paldex_Map_C_SetDistributionLocations) == 0x000160, "Wrong size on WBP_Paldex_Map_C_SetDistributionLocations");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, DayTimeLocationStruct) == 0x000000, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::DayTimeLocationStruct' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, NightTimeLocationStruct) == 0x000018, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::NightTimeLocationStruct' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, TimeType) == 0x000030, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::TimeType' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, IsNoDistribution) == 0x000031, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::IsNoDistribution' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, CreatedWidget) == 0x000038, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::CreatedWidget' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, Temp_int_Array_Index_Variable) == 0x000048, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, Temp_int_Array_Index_Variable_1) == 0x00004C, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000050, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000058, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, CallFunc_GetLocalPlayerState_ReturnValue) == 0x000060, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, CallFunc_Create_ReturnValue) == 0x000068, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, CallFunc_GetPlayerInfoForMap_ReturnValue) == 0x000070, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::CallFunc_GetPlayerInfoForMap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, CallFunc_GetLocationPosition_LocationPosition) == 0x0000E0, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::CallFunc_GetLocationPosition_LocationPosition' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, CallFunc_Array_Length_ReturnValue) == 0x0000F8, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, CallFunc_Array_Length_ReturnValue_1) == 0x0000FC, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000100, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000101, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, CallFunc_BooleanAND_ReturnValue) == 0x000102, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, CallFunc_Array_Get_Item) == 0x000108, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, CallFunc_Array_Get_Item_1) == 0x000120, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, CallFunc_Array_Length_ReturnValue_2) == 0x000138, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, CallFunc_Array_Length_ReturnValue_3) == 0x00013C, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, CallFunc_Less_IntInt_ReturnValue) == 0x000140, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, Temp_int_Loop_Counter_Variable_1) == 0x000144, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, K2Node_SwitchEnum_CmpSuccess) == 0x000148, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, CallFunc_Less_IntInt_ReturnValue_1) == 0x000149, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, CallFunc_Add_IntInt_ReturnValue_1) == 0x00014C, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, CallFunc_SetupCircleWidget_realSpawnSize_ImplicitCast) == 0x000150, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::CallFunc_SetupCircleWidget_realSpawnSize_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetDistributionLocations, CallFunc_SetupCircleWidget_realSpawnSize_ImplicitCast_1) == 0x000158, "Member 'WBP_Paldex_Map_C_SetDistributionLocations::CallFunc_SetupCircleWidget_realSpawnSize_ImplicitCast_1' has a wrong offset!");

// Function WBP_Paldex_Map.WBP_Paldex_Map_C.SetupCircleWidget
// 0x0090 (0x0090 - 0x0000)
struct WBP_Paldex_Map_C_SetupCircleWidget final
{
public:
	class UClass*                                 Param_Class;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WorldLocation;                                     // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RealSpawnSize;                                     // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511E[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511F[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DVector2D_ReturnValue;      // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Paldex_Map_C_SetupCircleWidget) == 0x000008, "Wrong alignment on WBP_Paldex_Map_C_SetupCircleWidget");
static_assert(sizeof(WBP_Paldex_Map_C_SetupCircleWidget) == 0x000090, "Wrong size on WBP_Paldex_Map_C_SetupCircleWidget");
static_assert(offsetof(WBP_Paldex_Map_C_SetupCircleWidget, Param_Class) == 0x000000, "Member 'WBP_Paldex_Map_C_SetupCircleWidget::Param_Class' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetupCircleWidget, WorldLocation) == 0x000008, "Member 'WBP_Paldex_Map_C_SetupCircleWidget::WorldLocation' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetupCircleWidget, RealSpawnSize) == 0x000020, "Member 'WBP_Paldex_Map_C_SetupCircleWidget::RealSpawnSize' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetupCircleWidget, CallFunc_Create_ReturnValue) == 0x000028, "Member 'WBP_Paldex_Map_C_SetupCircleWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetupCircleWidget, CallFunc_MakeVector2D_ReturnValue) == 0x000030, "Member 'WBP_Paldex_Map_C_SetupCircleWidget::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetupCircleWidget, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000040, "Member 'WBP_Paldex_Map_C_SetupCircleWidget::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetupCircleWidget, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'WBP_Paldex_Map_C_SetupCircleWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetupCircleWidget, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000050, "Member 'WBP_Paldex_Map_C_SetupCircleWidget::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetupCircleWidget, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'WBP_Paldex_Map_C_SetupCircleWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetupCircleWidget, CallFunc_GetSize_ReturnValue) == 0x000060, "Member 'WBP_Paldex_Map_C_SetupCircleWidget::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetupCircleWidget, CallFunc_Divide_Vector2DVector2D_ReturnValue) == 0x000070, "Member 'WBP_Paldex_Map_C_SetupCircleWidget::CallFunc_Divide_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetupCircleWidget, CallFunc_Multiply_Vector2DVector2D_ReturnValue) == 0x000080, "Member 'WBP_Paldex_Map_C_SetupCircleWidget::CallFunc_Multiply_Vector2DVector2D_ReturnValue' has a wrong offset!");

// Function WBP_Paldex_Map.WBP_Paldex_Map_C.SetVisibilityMap
// 0x0005 (0x0005 - 0x0000)
struct WBP_Paldex_Map_C_SetVisibilityMap final
{
public:
	bool                                          Param_IsVisible;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Paldex_Map_C_SetVisibilityMap) == 0x000001, "Wrong alignment on WBP_Paldex_Map_C_SetVisibilityMap");
static_assert(sizeof(WBP_Paldex_Map_C_SetVisibilityMap) == 0x000005, "Wrong size on WBP_Paldex_Map_C_SetVisibilityMap");
static_assert(offsetof(WBP_Paldex_Map_C_SetVisibilityMap, Param_IsVisible) == 0x000000, "Member 'WBP_Paldex_Map_C_SetVisibilityMap::Param_IsVisible' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetVisibilityMap, Temp_bool_Variable) == 0x000001, "Member 'WBP_Paldex_Map_C_SetVisibilityMap::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetVisibilityMap, Temp_byte_Variable) == 0x000002, "Member 'WBP_Paldex_Map_C_SetVisibilityMap::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetVisibilityMap, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_Paldex_Map_C_SetVisibilityMap::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetVisibilityMap, K2Node_Select_Default) == 0x000004, "Member 'WBP_Paldex_Map_C_SetVisibilityMap::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Paldex_Map.WBP_Paldex_Map_C.SetZoomRate
// 0x0068 (0x0068 - 0x0000)
struct WBP_Paldex_Map_C_SetZoomRate final
{
public:
	double                                        Rate;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Paldex_Map_C_SetZoomRate) == 0x000008, "Wrong alignment on WBP_Paldex_Map_C_SetZoomRate");
static_assert(sizeof(WBP_Paldex_Map_C_SetZoomRate) == 0x000068, "Wrong size on WBP_Paldex_Map_C_SetZoomRate");
static_assert(offsetof(WBP_Paldex_Map_C_SetZoomRate, Rate) == 0x000000, "Member 'WBP_Paldex_Map_C_SetZoomRate::Rate' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetZoomRate, CallFunc_FMin_ReturnValue) == 0x000008, "Member 'WBP_Paldex_Map_C_SetZoomRate::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_Map_C_SetZoomRate, CallFunc_FMax_ReturnValue) == 0x000010, "Member 'WBP_Paldex_Map_C_SetZoomRate::CallFunc_FMax_ReturnValue' has a wrong offset!");
