#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InventoryEquipment_StatusPointButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Pal_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InventoryEquipment_StatusPointButton.WBP_InventoryEquipment_StatusPointButton_C
// 0x0150 (0x0558 - 0x0408)
class UWBP_InventoryEquipment_StatusPointButton_C final : public UPalUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0408(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_PalRichTextBlock_C*                 BP_PalRichTextBlock_BonusPoint;                    // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_DecrementButton;                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_IncrementButton;                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ParamArrow;                                  // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Arrow;                                     // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_Main;                                         // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_Param;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalInvisibleButton_C*              WBP_PalInvisibleButton;                            // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalInvisibleButton_C*              WBP_PalInvisibleButton_Decrement;                  // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalInvisibleButton_C*              WBP_PalInvisibleButton_Increment;                  // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class FName, struct FDataTableRowHandle> MagIDMap;                                          // 0x0468(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, class UTexture2D*>          TextureMap;                                        // 0x04B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   BindStatusPointName;                               // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnClickedIncrement;                                // 0x0510(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         CachedPoint;                                       // 0x0520(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AdditionalPointForSimulate;                        // 0x0524(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnClickedDecrement;                                // 0x0528(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnHovered;                                         // 0x0538(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnUnhovered;                                       // 0x0548(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void AddSimulatePoint(int32 SimulatePoint);
	void BndEvt__WBP_InventoryEquipment_StatusPointButton_WBP_PalInvisibleButton_Decrement_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_InventoryEquipment_StatusPointButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_InventoryEquipment_StatusPointButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_InventoryEquipment_StatusPointButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Construct();
	void ExecuteUbergraph_WBP_InventoryEquipment_StatusPointButton(int32 EntryPoint);
	void Get_Base_Parameter(bool ShowBaseValue, double* Parameter);
	void GetBonusRate(int32 Point, double* Bonus);
	void OnClickedDecrement__DelegateSignature(class UWBP_InventoryEquipment_StatusPointButton_C* Button);
	void OnClickedIncrement__DelegateSignature(class UWBP_InventoryEquipment_StatusPointButton_C* Button);
	void OnHovered__DelegateSignature(class UWBP_InventoryEquipment_StatusPointButton_C* Button);
	void OnInitialized();
	void OnUnhovered__DelegateSignature(class UWBP_InventoryEquipment_StatusPointButton_C* Button);
	void ResetSimulate();
	void Set_Enable_Simulate_Button(bool IsEnable);
	void Update_Binded_Status_Detail(bool ShowBaseValue);
	void UpdateDecrementButtonDetail();
	void UpdateStatusBuffState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_InventoryEquipment_StatusPointButton_C">();
	}
	static class UWBP_InventoryEquipment_StatusPointButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InventoryEquipment_StatusPointButton_C>();
	}
};
static_assert(alignof(UWBP_InventoryEquipment_StatusPointButton_C) == 0x000008, "Wrong alignment on UWBP_InventoryEquipment_StatusPointButton_C");
static_assert(sizeof(UWBP_InventoryEquipment_StatusPointButton_C) == 0x000558, "Wrong size on UWBP_InventoryEquipment_StatusPointButton_C");
static_assert(offsetof(UWBP_InventoryEquipment_StatusPointButton_C, UberGraphFrame) == 0x000408, "Member 'UWBP_InventoryEquipment_StatusPointButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_StatusPointButton_C, BP_PalRichTextBlock_BonusPoint) == 0x000410, "Member 'UWBP_InventoryEquipment_StatusPointButton_C::BP_PalRichTextBlock_BonusPoint' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_StatusPointButton_C, CanvasPanel_DecrementButton) == 0x000418, "Member 'UWBP_InventoryEquipment_StatusPointButton_C::CanvasPanel_DecrementButton' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_StatusPointButton_C, CanvasPanel_IncrementButton) == 0x000420, "Member 'UWBP_InventoryEquipment_StatusPointButton_C::CanvasPanel_IncrementButton' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_StatusPointButton_C, Icon) == 0x000428, "Member 'UWBP_InventoryEquipment_StatusPointButton_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_StatusPointButton_C, Image_ParamArrow) == 0x000430, "Member 'UWBP_InventoryEquipment_StatusPointButton_C::Image_ParamArrow' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_StatusPointButton_C, SizeBox_Arrow) == 0x000438, "Member 'UWBP_InventoryEquipment_StatusPointButton_C::SizeBox_Arrow' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_StatusPointButton_C, Text_Main) == 0x000440, "Member 'UWBP_InventoryEquipment_StatusPointButton_C::Text_Main' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_StatusPointButton_C, Text_Param) == 0x000448, "Member 'UWBP_InventoryEquipment_StatusPointButton_C::Text_Param' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_StatusPointButton_C, WBP_PalInvisibleButton) == 0x000450, "Member 'UWBP_InventoryEquipment_StatusPointButton_C::WBP_PalInvisibleButton' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_StatusPointButton_C, WBP_PalInvisibleButton_Decrement) == 0x000458, "Member 'UWBP_InventoryEquipment_StatusPointButton_C::WBP_PalInvisibleButton_Decrement' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_StatusPointButton_C, WBP_PalInvisibleButton_Increment) == 0x000460, "Member 'UWBP_InventoryEquipment_StatusPointButton_C::WBP_PalInvisibleButton_Increment' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_StatusPointButton_C, MagIDMap) == 0x000468, "Member 'UWBP_InventoryEquipment_StatusPointButton_C::MagIDMap' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_StatusPointButton_C, TextureMap) == 0x0004B8, "Member 'UWBP_InventoryEquipment_StatusPointButton_C::TextureMap' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_StatusPointButton_C, BindStatusPointName) == 0x000508, "Member 'UWBP_InventoryEquipment_StatusPointButton_C::BindStatusPointName' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_StatusPointButton_C, OnClickedIncrement) == 0x000510, "Member 'UWBP_InventoryEquipment_StatusPointButton_C::OnClickedIncrement' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_StatusPointButton_C, CachedPoint) == 0x000520, "Member 'UWBP_InventoryEquipment_StatusPointButton_C::CachedPoint' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_StatusPointButton_C, AdditionalPointForSimulate) == 0x000524, "Member 'UWBP_InventoryEquipment_StatusPointButton_C::AdditionalPointForSimulate' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_StatusPointButton_C, OnClickedDecrement) == 0x000528, "Member 'UWBP_InventoryEquipment_StatusPointButton_C::OnClickedDecrement' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_StatusPointButton_C, OnHovered) == 0x000538, "Member 'UWBP_InventoryEquipment_StatusPointButton_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_StatusPointButton_C, OnUnhovered) == 0x000548, "Member 'UWBP_InventoryEquipment_StatusPointButton_C::OnUnhovered' has a wrong offset!");

}

