#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Paldex_TaskIcon

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Paldex_TaskIcon.WBP_Paldex_TaskIcon_C.ExecuteUbergraph_WBP_Paldex_TaskIcon
// 0x0020 (0x0020 - 0x0000)
struct WBP_Paldex_TaskIcon_C_ExecuteUbergraph_WBP_Paldex_TaskIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Paldex_TaskIcon_C_ExecuteUbergraph_WBP_Paldex_TaskIcon) == 0x000008, "Wrong alignment on WBP_Paldex_TaskIcon_C_ExecuteUbergraph_WBP_Paldex_TaskIcon");
static_assert(sizeof(WBP_Paldex_TaskIcon_C_ExecuteUbergraph_WBP_Paldex_TaskIcon) == 0x000020, "Wrong size on WBP_Paldex_TaskIcon_C_ExecuteUbergraph_WBP_Paldex_TaskIcon");
static_assert(offsetof(WBP_Paldex_TaskIcon_C_ExecuteUbergraph_WBP_Paldex_TaskIcon, EntryPoint) == 0x000000, "Member 'WBP_Paldex_TaskIcon_C_ExecuteUbergraph_WBP_Paldex_TaskIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_TaskIcon_C_ExecuteUbergraph_WBP_Paldex_TaskIcon, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_Paldex_TaskIcon_C_ExecuteUbergraph_WBP_Paldex_TaskIcon::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_TaskIcon_C_ExecuteUbergraph_WBP_Paldex_TaskIcon, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_Paldex_TaskIcon_C_ExecuteUbergraph_WBP_Paldex_TaskIcon::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_TaskIcon_C_ExecuteUbergraph_WBP_Paldex_TaskIcon, CallFunc_PlayAnimation_ReturnValue_2) == 0x000018, "Member 'WBP_Paldex_TaskIcon_C_ExecuteUbergraph_WBP_Paldex_TaskIcon::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");

}

