#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PalStatusPopup

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_PalStatusPopup.WBP_PalStatusPopup_C.ExecuteUbergraph_WBP_PalStatusPopup
// 0x0050 (0x0050 - 0x0000)
struct WBP_PalStatusPopup_C_ExecuteUbergraph_WBP_PalStatusPopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A7C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDDispatchParameterBase*           CallFunc_GetParam_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A7D[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDDispatchParameter_MonsterDetail* K2Node_DynamicCast_AsPal_HUDDispatch_Parameter_Monster_Detail; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A7E[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A7F[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLocalizedText_ReturnValue;             // 0x0038(0x0018)()
};
static_assert(alignof(WBP_PalStatusPopup_C_ExecuteUbergraph_WBP_PalStatusPopup) == 0x000008, "Wrong alignment on WBP_PalStatusPopup_C_ExecuteUbergraph_WBP_PalStatusPopup");
static_assert(sizeof(WBP_PalStatusPopup_C_ExecuteUbergraph_WBP_PalStatusPopup) == 0x000050, "Wrong size on WBP_PalStatusPopup_C_ExecuteUbergraph_WBP_PalStatusPopup");
static_assert(offsetof(WBP_PalStatusPopup_C_ExecuteUbergraph_WBP_PalStatusPopup, EntryPoint) == 0x000000, "Member 'WBP_PalStatusPopup_C_ExecuteUbergraph_WBP_PalStatusPopup::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PalStatusPopup_C_ExecuteUbergraph_WBP_PalStatusPopup, CallFunc_GetParam_ReturnValue) == 0x000008, "Member 'WBP_PalStatusPopup_C_ExecuteUbergraph_WBP_PalStatusPopup::CallFunc_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatusPopup_C_ExecuteUbergraph_WBP_PalStatusPopup, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_PalStatusPopup_C_ExecuteUbergraph_WBP_PalStatusPopup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatusPopup_C_ExecuteUbergraph_WBP_PalStatusPopup, K2Node_DynamicCast_AsPal_HUDDispatch_Parameter_Monster_Detail) == 0x000018, "Member 'WBP_PalStatusPopup_C_ExecuteUbergraph_WBP_PalStatusPopup::K2Node_DynamicCast_AsPal_HUDDispatch_Parameter_Monster_Detail' has a wrong offset!");
static_assert(offsetof(WBP_PalStatusPopup_C_ExecuteUbergraph_WBP_PalStatusPopup, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_PalStatusPopup_C_ExecuteUbergraph_WBP_PalStatusPopup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PalStatusPopup_C_ExecuteUbergraph_WBP_PalStatusPopup, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'WBP_PalStatusPopup_C_ExecuteUbergraph_WBP_PalStatusPopup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PalStatusPopup_C_ExecuteUbergraph_WBP_PalStatusPopup, CallFunc_GetLocalizedText_ReturnValue) == 0x000038, "Member 'WBP_PalStatusPopup_C_ExecuteUbergraph_WBP_PalStatusPopup::CallFunc_GetLocalizedText_ReturnValue' has a wrong offset!");

// Function WBP_PalStatusPopup.WBP_PalStatusPopup_C.OnCancelAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_PalStatusPopup_C_OnCancelAction final
{
public:
	bool                                          CallFunc_Is_Editing_Nick_Name_isEditing;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStatusPopup_C_OnCancelAction) == 0x000001, "Wrong alignment on WBP_PalStatusPopup_C_OnCancelAction");
static_assert(sizeof(WBP_PalStatusPopup_C_OnCancelAction) == 0x000001, "Wrong size on WBP_PalStatusPopup_C_OnCancelAction");
static_assert(offsetof(WBP_PalStatusPopup_C_OnCancelAction, CallFunc_Is_Editing_Nick_Name_isEditing) == 0x000000, "Member 'WBP_PalStatusPopup_C_OnCancelAction::CallFunc_Is_Editing_Nick_Name_isEditing' has a wrong offset!");

// Function WBP_PalStatusPopup.WBP_PalStatusPopup_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_PalStatusPopup_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStatusPopup_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_PalStatusPopup_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_PalStatusPopup_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_PalStatusPopup_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_PalStatusPopup_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_PalStatusPopup_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

