#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IngameConstruction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_IngameConstruction.WBP_IngameConstruction_C
// 0x0138 (0x03B0 - 0x0278)
class UWBP_IngameConstruction_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anm_Caution;                                       // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     BP_PalTextBlock_C_1;                               // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     BP_PalTextBlock_C_39;                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     BP_PalTextBlock_C_100;                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     BP_PalTextBlock_CautionTitle;                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Caution;                               // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Warning;                               // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_CautionTitleBase;                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Ingameconstruction_KeyGuide_C*     WBP_Ingameconstruction_KeyGuide;                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Ingameconstruction_KeyGuide_C*     WBP_Ingameconstruction_KeyGuide_1;                 // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Ingameconstruction_KeyGuide_C*     WBP_Ingameconstruction_KeyGuide_2;                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Ingameconstruction_KeyGuide_C*     WBP_Ingameconstruction_KeyGuide_3;                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Ingameconstruction_KeyGuide_C*     WBP_Ingameconstruction_KeyGuide_4;                 // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Ingameconstruction_KeyGuide_C*     WBP_Ingameconstruction_KeyGuide_5;                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameConstruction_Num_C*          WBP_IngameConstruction_Num_0;                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameConstruction_Num_C*          WBP_IngameConstruction_Num_1;                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameConstruction_Num_C*          WBP_IngameConstruction_Num_2;                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameConstruction_Num_C*          WBP_IngameConstruction_Num_3;                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalCommonItemIcon_C*               WBP_PalCommonItemIcon;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalCommonItemIcon_C*               WBP_PalCommonItemIcon_1;                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalCommonItemIcon_C*               WBP_PalCommonItemIcon_2;                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalCommonItemIcon_C*               WBP_PalCommonItemIcon_3;                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_IngameConstruction_Num_C*>  ItemNums;                                          // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FDataTableRowHandle                    KeyGuideMsgHandle_Reserve;                         // 0x0340(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    KeyGuideMsgHandle_ReserveContinue;                 // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    KeyGuideMsgHandle_Cancel;                          // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    KeyGuideMsgHandle_Close;                           // 0x0370(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TArray<class UWBP_PalCommonItemIcon_C*>       ItemIconArray;                                     // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FDataTableRowHandle                    KeyGuideMsgHandle_RotateRight;                     // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    KeyGuideMsgHandle_RotateLeft;                      // 0x03A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void UpdateDisplayContent(class UPalUIBuildingModel* Model);
	void SetWarningText(const class FText& InText);
	void SetVisibilityOutSideBaseCampWarning(ESlateVisibility NewVisibility);
	void SetupKeyGuide(class UPalUIBuildingModel* Model);
	void Setup(const struct FPalBuildObjectData& InBuildObjectData);
	void SetMaterial(int32 Param_Index, class FName StaticItemId, int32 ItemCount);
	void SetEnableWarning(bool IsEnable);
	void SetBuildObjectName(const class FText& InName);
	void ResetAllUI(class UPalUIBuildingModel* Model);
	void OnInitialized();
	void ExecuteUbergraph_WBP_IngameConstruction(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_IngameConstruction_C">();
	}
	static class UWBP_IngameConstruction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_IngameConstruction_C>();
	}
};
static_assert(alignof(UWBP_IngameConstruction_C) == 0x000008, "Wrong alignment on UWBP_IngameConstruction_C");
static_assert(sizeof(UWBP_IngameConstruction_C) == 0x0003B0, "Wrong size on UWBP_IngameConstruction_C");
static_assert(offsetof(UWBP_IngameConstruction_C, UberGraphFrame) == 0x000278, "Member 'UWBP_IngameConstruction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_C, Anm_Caution) == 0x000280, "Member 'UWBP_IngameConstruction_C::Anm_Caution' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_C, BP_PalTextBlock_C_1) == 0x000288, "Member 'UWBP_IngameConstruction_C::BP_PalTextBlock_C_1' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_C, BP_PalTextBlock_C_39) == 0x000290, "Member 'UWBP_IngameConstruction_C::BP_PalTextBlock_C_39' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_C, BP_PalTextBlock_C_100) == 0x000298, "Member 'UWBP_IngameConstruction_C::BP_PalTextBlock_C_100' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_C, BP_PalTextBlock_CautionTitle) == 0x0002A0, "Member 'UWBP_IngameConstruction_C::BP_PalTextBlock_CautionTitle' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_C, CanvasPanel_Caution) == 0x0002A8, "Member 'UWBP_IngameConstruction_C::CanvasPanel_Caution' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_C, CanvasPanel_Warning) == 0x0002B0, "Member 'UWBP_IngameConstruction_C::CanvasPanel_Warning' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_C, Image_CautionTitleBase) == 0x0002B8, "Member 'UWBP_IngameConstruction_C::Image_CautionTitleBase' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_C, WBP_Ingameconstruction_KeyGuide) == 0x0002C0, "Member 'UWBP_IngameConstruction_C::WBP_Ingameconstruction_KeyGuide' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_C, WBP_Ingameconstruction_KeyGuide_1) == 0x0002C8, "Member 'UWBP_IngameConstruction_C::WBP_Ingameconstruction_KeyGuide_1' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_C, WBP_Ingameconstruction_KeyGuide_2) == 0x0002D0, "Member 'UWBP_IngameConstruction_C::WBP_Ingameconstruction_KeyGuide_2' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_C, WBP_Ingameconstruction_KeyGuide_3) == 0x0002D8, "Member 'UWBP_IngameConstruction_C::WBP_Ingameconstruction_KeyGuide_3' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_C, WBP_Ingameconstruction_KeyGuide_4) == 0x0002E0, "Member 'UWBP_IngameConstruction_C::WBP_Ingameconstruction_KeyGuide_4' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_C, WBP_Ingameconstruction_KeyGuide_5) == 0x0002E8, "Member 'UWBP_IngameConstruction_C::WBP_Ingameconstruction_KeyGuide_5' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_C, WBP_IngameConstruction_Num_0) == 0x0002F0, "Member 'UWBP_IngameConstruction_C::WBP_IngameConstruction_Num_0' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_C, WBP_IngameConstruction_Num_1) == 0x0002F8, "Member 'UWBP_IngameConstruction_C::WBP_IngameConstruction_Num_1' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_C, WBP_IngameConstruction_Num_2) == 0x000300, "Member 'UWBP_IngameConstruction_C::WBP_IngameConstruction_Num_2' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_C, WBP_IngameConstruction_Num_3) == 0x000308, "Member 'UWBP_IngameConstruction_C::WBP_IngameConstruction_Num_3' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_C, WBP_PalCommonItemIcon) == 0x000310, "Member 'UWBP_IngameConstruction_C::WBP_PalCommonItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_C, WBP_PalCommonItemIcon_1) == 0x000318, "Member 'UWBP_IngameConstruction_C::WBP_PalCommonItemIcon_1' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_C, WBP_PalCommonItemIcon_2) == 0x000320, "Member 'UWBP_IngameConstruction_C::WBP_PalCommonItemIcon_2' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_C, WBP_PalCommonItemIcon_3) == 0x000328, "Member 'UWBP_IngameConstruction_C::WBP_PalCommonItemIcon_3' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_C, ItemNums) == 0x000330, "Member 'UWBP_IngameConstruction_C::ItemNums' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_C, KeyGuideMsgHandle_Reserve) == 0x000340, "Member 'UWBP_IngameConstruction_C::KeyGuideMsgHandle_Reserve' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_C, KeyGuideMsgHandle_ReserveContinue) == 0x000350, "Member 'UWBP_IngameConstruction_C::KeyGuideMsgHandle_ReserveContinue' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_C, KeyGuideMsgHandle_Cancel) == 0x000360, "Member 'UWBP_IngameConstruction_C::KeyGuideMsgHandle_Cancel' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_C, KeyGuideMsgHandle_Close) == 0x000370, "Member 'UWBP_IngameConstruction_C::KeyGuideMsgHandle_Close' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_C, ItemIconArray) == 0x000380, "Member 'UWBP_IngameConstruction_C::ItemIconArray' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_C, KeyGuideMsgHandle_RotateRight) == 0x000390, "Member 'UWBP_IngameConstruction_C::KeyGuideMsgHandle_RotateRight' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_C, KeyGuideMsgHandle_RotateLeft) == 0x0003A0, "Member 'UWBP_IngameConstruction_C::KeyGuideMsgHandle_RotateLeft' has a wrong offset!");

}

