#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IngameMenu_Monitoring_WorkButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_IngameMenu_Monitoring_WorkButton.WBP_IngameMenu_Monitoring_WorkButton_C
// 0x0088 (0x0300 - 0x0278)
class UWBP_IngameMenu_Monitoring_WorkButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 FocusBase;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocusFrame;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Select;                                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_Select;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_Work;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalInvisibleButton_C*              WBP_PalInvisibleButton;                            // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         WorkHardLevel;                                     // 0x02B8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57B2[0x4];                                     // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDataTableRowHandle>            WorkHardMsgIds;                                    // 0x02C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnChangeHardWorkLevel;                             // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnHover;                                           // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnUnhover;                                         // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ActiveSelect(bool Active);
	void BndEvt__WBP_IngameMenu_Monitoring_WorkButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_IngameMenu_Monitoring_WorkButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_IngameMenu_Monitoring_WorkButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton(int32 EntryPoint);
	void OnChangeHardWorkLevel__DelegateSignature(int32 WorkLevel);
	void OnHover__DelegateSignature(int32 Param_WorkHardLevel);
	void OnUnhover__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_IngameMenu_Monitoring_WorkButton_C">();
	}
	static class UWBP_IngameMenu_Monitoring_WorkButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_IngameMenu_Monitoring_WorkButton_C>();
	}
};
static_assert(alignof(UWBP_IngameMenu_Monitoring_WorkButton_C) == 0x000008, "Wrong alignment on UWBP_IngameMenu_Monitoring_WorkButton_C");
static_assert(sizeof(UWBP_IngameMenu_Monitoring_WorkButton_C) == 0x000300, "Wrong size on UWBP_IngameMenu_Monitoring_WorkButton_C");
static_assert(offsetof(UWBP_IngameMenu_Monitoring_WorkButton_C, UberGraphFrame) == 0x000278, "Member 'UWBP_IngameMenu_Monitoring_WorkButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Monitoring_WorkButton_C, FocusBase) == 0x000280, "Member 'UWBP_IngameMenu_Monitoring_WorkButton_C::FocusBase' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Monitoring_WorkButton_C, FocusFrame) == 0x000288, "Member 'UWBP_IngameMenu_Monitoring_WorkButton_C::FocusFrame' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Monitoring_WorkButton_C, Icon) == 0x000290, "Member 'UWBP_IngameMenu_Monitoring_WorkButton_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Monitoring_WorkButton_C, Select) == 0x000298, "Member 'UWBP_IngameMenu_Monitoring_WorkButton_C::Select' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Monitoring_WorkButton_C, Text_Select) == 0x0002A0, "Member 'UWBP_IngameMenu_Monitoring_WorkButton_C::Text_Select' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Monitoring_WorkButton_C, Text_Work) == 0x0002A8, "Member 'UWBP_IngameMenu_Monitoring_WorkButton_C::Text_Work' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Monitoring_WorkButton_C, WBP_PalInvisibleButton) == 0x0002B0, "Member 'UWBP_IngameMenu_Monitoring_WorkButton_C::WBP_PalInvisibleButton' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Monitoring_WorkButton_C, WorkHardLevel) == 0x0002B8, "Member 'UWBP_IngameMenu_Monitoring_WorkButton_C::WorkHardLevel' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Monitoring_WorkButton_C, WorkHardMsgIds) == 0x0002C0, "Member 'UWBP_IngameMenu_Monitoring_WorkButton_C::WorkHardMsgIds' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Monitoring_WorkButton_C, OnChangeHardWorkLevel) == 0x0002D0, "Member 'UWBP_IngameMenu_Monitoring_WorkButton_C::OnChangeHardWorkLevel' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Monitoring_WorkButton_C, OnHover) == 0x0002E0, "Member 'UWBP_IngameMenu_Monitoring_WorkButton_C::OnHover' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Monitoring_WorkButton_C, OnUnhover) == 0x0002F0, "Member 'UWBP_IngameMenu_Monitoring_WorkButton_C::OnUnhover' has a wrong offset!");

}

