#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BattleEntry_Wait

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Pal_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BattleEntry_Wait.WBP_BattleEntry_Wait_C
// 0x0050 (0x0470 - 0x0420)
class UWBP_BattleEntry_Wait_C final : public UPalBossEntryWaitInfoHUD
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_PalTextBlock_C*                     BP_PalTextBlock_Info;                              // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_BaseCampName;                                 // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_LevelValue;                                   // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BossBattle_Timer_C*                WBP_BossBattle_Timer;                              // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           CurrentTimer;                                      // 0x0448(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    WaitingMsgId;                                      // 0x0450(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    EnterMsgId;                                        // 0x0460(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void Count_Down();
	void ExecuteUbergraph_WBP_BattleEntry_Wait(int32 EntryPoint);
	void OnRequestRemove();
	void OnSetup();
	void UpdateCountDown();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BattleEntry_Wait_C">();
	}
	static class UWBP_BattleEntry_Wait_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BattleEntry_Wait_C>();
	}
};
static_assert(alignof(UWBP_BattleEntry_Wait_C) == 0x000008, "Wrong alignment on UWBP_BattleEntry_Wait_C");
static_assert(sizeof(UWBP_BattleEntry_Wait_C) == 0x000470, "Wrong size on UWBP_BattleEntry_Wait_C");
static_assert(offsetof(UWBP_BattleEntry_Wait_C, UberGraphFrame) == 0x000420, "Member 'UWBP_BattleEntry_Wait_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_BattleEntry_Wait_C, BP_PalTextBlock_Info) == 0x000428, "Member 'UWBP_BattleEntry_Wait_C::BP_PalTextBlock_Info' has a wrong offset!");
static_assert(offsetof(UWBP_BattleEntry_Wait_C, Text_BaseCampName) == 0x000430, "Member 'UWBP_BattleEntry_Wait_C::Text_BaseCampName' has a wrong offset!");
static_assert(offsetof(UWBP_BattleEntry_Wait_C, Text_LevelValue) == 0x000438, "Member 'UWBP_BattleEntry_Wait_C::Text_LevelValue' has a wrong offset!");
static_assert(offsetof(UWBP_BattleEntry_Wait_C, WBP_BossBattle_Timer) == 0x000440, "Member 'UWBP_BattleEntry_Wait_C::WBP_BossBattle_Timer' has a wrong offset!");
static_assert(offsetof(UWBP_BattleEntry_Wait_C, CurrentTimer) == 0x000448, "Member 'UWBP_BattleEntry_Wait_C::CurrentTimer' has a wrong offset!");
static_assert(offsetof(UWBP_BattleEntry_Wait_C, WaitingMsgId) == 0x000450, "Member 'UWBP_BattleEntry_Wait_C::WaitingMsgId' has a wrong offset!");
static_assert(offsetof(UWBP_BattleEntry_Wait_C, EnterMsgId) == 0x000460, "Member 'UWBP_BattleEntry_Wait_C::EnterMsgId' has a wrong offset!");

}

