#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Ingame_Chat

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Pal_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Ingame_Chat.WBP_Ingame_Chat_C.BndEvt__WBP_Ingame_Chat_EditableText_ChatInput_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Ingame_Chat_C_BndEvt__WBP_Ingame_Chat_EditableText_ChatInput_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Ingame_Chat_C_BndEvt__WBP_Ingame_Chat_EditableText_ChatInput_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Ingame_Chat_C_BndEvt__WBP_Ingame_Chat_EditableText_ChatInput_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_Ingame_Chat_C_BndEvt__WBP_Ingame_Chat_EditableText_ChatInput_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on WBP_Ingame_Chat_C_BndEvt__WBP_Ingame_Chat_EditableText_ChatInput_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_Ingame_Chat_C_BndEvt__WBP_Ingame_Chat_EditableText_ChatInput_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_Ingame_Chat_C_BndEvt__WBP_Ingame_Chat_EditableText_ChatInput_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_BndEvt__WBP_Ingame_Chat_EditableText_ChatInput_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'WBP_Ingame_Chat_C_BndEvt__WBP_Ingame_Chat_EditableText_ChatInput_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_Ingame_Chat.WBP_Ingame_Chat_C.CanChat
// 0x0028 (0x0028 - 0x0000)
struct WBP_Ingame_Chat_C_CanChat final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUGCFilter_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59C3[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalOptionSubsystem*                    CallFunc_GetOptionSubsystem_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalOptionKeyboardSettings             CallFunc_GetKeyboardSettings_ReturnValue;          // 0x0010(0x0014)(ConstParm, NoDestructor)
};
static_assert(alignof(WBP_Ingame_Chat_C_CanChat) == 0x000008, "Wrong alignment on WBP_Ingame_Chat_C_CanChat");
static_assert(sizeof(WBP_Ingame_Chat_C_CanChat) == 0x000028, "Wrong size on WBP_Ingame_Chat_C_CanChat");
static_assert(offsetof(WBP_Ingame_Chat_C_CanChat, Result) == 0x000000, "Member 'WBP_Ingame_Chat_C_CanChat::Result' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_CanChat, CallFunc_IsUGCFilter_ReturnValue) == 0x000001, "Member 'WBP_Ingame_Chat_C_CanChat::CallFunc_IsUGCFilter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_CanChat, CallFunc_GetOptionSubsystem_ReturnValue) == 0x000008, "Member 'WBP_Ingame_Chat_C_CanChat::CallFunc_GetOptionSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_CanChat, CallFunc_GetKeyboardSettings_ReturnValue) == 0x000010, "Member 'WBP_Ingame_Chat_C_CanChat::CallFunc_GetKeyboardSettings_ReturnValue' has a wrong offset!");

// Function WBP_Ingame_Chat.WBP_Ingame_Chat_C.ChangeCategory
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_Ingame_Chat_C_ChangeCategory final
{
public:
	struct FLinearColor                           NewLocalVar;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0020(0x0014)()
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_2;                   // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59C4[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0068(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0080(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0018)()
};
static_assert(alignof(WBP_Ingame_Chat_C_ChangeCategory) == 0x000008, "Wrong alignment on WBP_Ingame_Chat_C_ChangeCategory");
static_assert(sizeof(WBP_Ingame_Chat_C_ChangeCategory) == 0x0000F8, "Wrong size on WBP_Ingame_Chat_C_ChangeCategory");
static_assert(offsetof(WBP_Ingame_Chat_C_ChangeCategory, NewLocalVar) == 0x000000, "Member 'WBP_Ingame_Chat_C_ChangeCategory::NewLocalVar' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_ChangeCategory, K2Node_MakeStruct_LinearColor) == 0x000010, "Member 'WBP_Ingame_Chat_C_ChangeCategory::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_ChangeCategory, K2Node_MakeStruct_SlateColor) == 0x000020, "Member 'WBP_Ingame_Chat_C_ChangeCategory::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_ChangeCategory, K2Node_MakeStruct_LinearColor_1) == 0x000034, "Member 'WBP_Ingame_Chat_C_ChangeCategory::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_ChangeCategory, K2Node_MakeStruct_LinearColor_2) == 0x000044, "Member 'WBP_Ingame_Chat_C_ChangeCategory::K2Node_MakeStruct_LinearColor_2' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_ChangeCategory, K2Node_SwitchEnum_CmpSuccess) == 0x000054, "Member 'WBP_Ingame_Chat_C_ChangeCategory::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_ChangeCategory, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000058, "Member 'WBP_Ingame_Chat_C_ChangeCategory::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_ChangeCategory, CallFunc_Conv_StringToText_ReturnValue) == 0x000068, "Member 'WBP_Ingame_Chat_C_ChangeCategory::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_ChangeCategory, K2Node_MakeStruct_FormatArgumentData) == 0x000080, "Member 'WBP_Ingame_Chat_C_ChangeCategory::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_ChangeCategory, K2Node_MakeArray_Array) == 0x0000D0, "Member 'WBP_Ingame_Chat_C_ChangeCategory::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_ChangeCategory, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'WBP_Ingame_Chat_C_ChangeCategory::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_Ingame_Chat.WBP_Ingame_Chat_C.ExecuteUbergraph_WBP_Ingame_Chat
// 0x0080 (0x0080 - 0x0000)
struct WBP_Ingame_Chat_C_ExecuteUbergraph_WBP_Ingame_Chat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59C5[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0008(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59C6[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalPlayerState*                        CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EnterChat_ReturnValue;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59C7[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FPalChatMessage& Message)> K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59C8[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanChat_Result;                           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanChat_Result_1;                         // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanChat_Result_2;                         // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59C9[0x5];                                     // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text;          // 0x0068(0x0018)()
};
static_assert(alignof(WBP_Ingame_Chat_C_ExecuteUbergraph_WBP_Ingame_Chat) == 0x000008, "Wrong alignment on WBP_Ingame_Chat_C_ExecuteUbergraph_WBP_Ingame_Chat");
static_assert(sizeof(WBP_Ingame_Chat_C_ExecuteUbergraph_WBP_Ingame_Chat) == 0x000080, "Wrong size on WBP_Ingame_Chat_C_ExecuteUbergraph_WBP_Ingame_Chat");
static_assert(offsetof(WBP_Ingame_Chat_C_ExecuteUbergraph_WBP_Ingame_Chat, EntryPoint) == 0x000000, "Member 'WBP_Ingame_Chat_C_ExecuteUbergraph_WBP_Ingame_Chat::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_ExecuteUbergraph_WBP_Ingame_Chat, K2Node_ComponentBoundEvent_Text) == 0x000008, "Member 'WBP_Ingame_Chat_C_ExecuteUbergraph_WBP_Ingame_Chat::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_ExecuteUbergraph_WBP_Ingame_Chat, K2Node_ComponentBoundEvent_CommitMethod) == 0x000020, "Member 'WBP_Ingame_Chat_C_ExecuteUbergraph_WBP_Ingame_Chat::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_ExecuteUbergraph_WBP_Ingame_Chat, CallFunc_GetLocalPlayerState_ReturnValue) == 0x000028, "Member 'WBP_Ingame_Chat_C_ExecuteUbergraph_WBP_Ingame_Chat::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_ExecuteUbergraph_WBP_Ingame_Chat, CallFunc_EnterChat_ReturnValue) == 0x000030, "Member 'WBP_Ingame_Chat_C_ExecuteUbergraph_WBP_Ingame_Chat::CallFunc_EnterChat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_ExecuteUbergraph_WBP_Ingame_Chat, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'WBP_Ingame_Chat_C_ExecuteUbergraph_WBP_Ingame_Chat::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_ExecuteUbergraph_WBP_Ingame_Chat, K2Node_CreateDelegate_OutputDelegate_1) == 0x000044, "Member 'WBP_Ingame_Chat_C_ExecuteUbergraph_WBP_Ingame_Chat::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_ExecuteUbergraph_WBP_Ingame_Chat, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000058, "Member 'WBP_Ingame_Chat_C_ExecuteUbergraph_WBP_Ingame_Chat::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_ExecuteUbergraph_WBP_Ingame_Chat, CallFunc_CanChat_Result) == 0x000060, "Member 'WBP_Ingame_Chat_C_ExecuteUbergraph_WBP_Ingame_Chat::CallFunc_CanChat_Result' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_ExecuteUbergraph_WBP_Ingame_Chat, CallFunc_CanChat_Result_1) == 0x000061, "Member 'WBP_Ingame_Chat_C_ExecuteUbergraph_WBP_Ingame_Chat::CallFunc_CanChat_Result_1' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_ExecuteUbergraph_WBP_Ingame_Chat, CallFunc_CanChat_Result_2) == 0x000062, "Member 'WBP_Ingame_Chat_C_ExecuteUbergraph_WBP_Ingame_Chat::CallFunc_CanChat_Result_2' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_ExecuteUbergraph_WBP_Ingame_Chat, CallFunc_GetLocalizedTextFromHandle_Text) == 0x000068, "Member 'WBP_Ingame_Chat_C_ExecuteUbergraph_WBP_Ingame_Chat::CallFunc_GetLocalizedTextFromHandle_Text' has a wrong offset!");

// Function WBP_Ingame_Chat.WBP_Ingame_Chat_C.OnRecivedChat
// 0x01F0 (0x01F0 - 0x0000)
struct WBP_Ingame_Chat_C_OnRecivedChat final
{
public:
	struct FPalChatMessage                        Message;                                           // 0x0000(0x0048)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FLinearColor                           MessageColor;                                      // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanChat_Result;                           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59CA[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0078(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0090(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00E0(0x0050)(HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59CB[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0138(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0148(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0160(0x0014)()
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0174(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0184(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_2;                   // 0x0194(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59CC[0x4];                                     // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBox*                             CallFunc_GetScrollBox_ScrollBox;                   // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Ingame_ChatListContent_C*          CallFunc_Create_ReturnValue;                       // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59CD[0x3];                                     // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01E8(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Ingame_Chat_C_OnRecivedChat) == 0x000008, "Wrong alignment on WBP_Ingame_Chat_C_OnRecivedChat");
static_assert(sizeof(WBP_Ingame_Chat_C_OnRecivedChat) == 0x0001F0, "Wrong size on WBP_Ingame_Chat_C_OnRecivedChat");
static_assert(offsetof(WBP_Ingame_Chat_C_OnRecivedChat, Message) == 0x000000, "Member 'WBP_Ingame_Chat_C_OnRecivedChat::Message' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_OnRecivedChat, MessageColor) == 0x000048, "Member 'WBP_Ingame_Chat_C_OnRecivedChat::MessageColor' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_OnRecivedChat, CallFunc_CanChat_Result) == 0x000058, "Member 'WBP_Ingame_Chat_C_OnRecivedChat::CallFunc_CanChat_Result' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_OnRecivedChat, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'WBP_Ingame_Chat_C_OnRecivedChat::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_OnRecivedChat, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000078, "Member 'WBP_Ingame_Chat_C_OnRecivedChat::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_OnRecivedChat, K2Node_MakeStruct_FormatArgumentData) == 0x000090, "Member 'WBP_Ingame_Chat_C_OnRecivedChat::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_OnRecivedChat, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000E0, "Member 'WBP_Ingame_Chat_C_OnRecivedChat::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_OnRecivedChat, K2Node_SwitchEnum_CmpSuccess) == 0x000130, "Member 'WBP_Ingame_Chat_C_OnRecivedChat::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_OnRecivedChat, K2Node_MakeArray_Array) == 0x000138, "Member 'WBP_Ingame_Chat_C_OnRecivedChat::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_OnRecivedChat, CallFunc_Format_ReturnValue) == 0x000148, "Member 'WBP_Ingame_Chat_C_OnRecivedChat::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_OnRecivedChat, K2Node_MakeStruct_SlateColor) == 0x000160, "Member 'WBP_Ingame_Chat_C_OnRecivedChat::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_OnRecivedChat, K2Node_MakeStruct_LinearColor) == 0x000174, "Member 'WBP_Ingame_Chat_C_OnRecivedChat::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_OnRecivedChat, K2Node_MakeStruct_LinearColor_1) == 0x000184, "Member 'WBP_Ingame_Chat_C_OnRecivedChat::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_OnRecivedChat, K2Node_MakeStruct_LinearColor_2) == 0x000194, "Member 'WBP_Ingame_Chat_C_OnRecivedChat::K2Node_MakeStruct_LinearColor_2' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_OnRecivedChat, CallFunc_GetScrollBox_ScrollBox) == 0x0001A8, "Member 'WBP_Ingame_Chat_C_OnRecivedChat::CallFunc_GetScrollBox_ScrollBox' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_OnRecivedChat, CallFunc_GetLocalPlayerController_ReturnValue) == 0x0001B0, "Member 'WBP_Ingame_Chat_C_OnRecivedChat::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_OnRecivedChat, CallFunc_GetChildAt_ReturnValue) == 0x0001B8, "Member 'WBP_Ingame_Chat_C_OnRecivedChat::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_OnRecivedChat, CallFunc_Create_ReturnValue) == 0x0001C0, "Member 'WBP_Ingame_Chat_C_OnRecivedChat::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_OnRecivedChat, CallFunc_AddChild_ReturnValue) == 0x0001C8, "Member 'WBP_Ingame_Chat_C_OnRecivedChat::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_OnRecivedChat, CallFunc_GetChildrenCount_ReturnValue) == 0x0001D0, "Member 'WBP_Ingame_Chat_C_OnRecivedChat::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_OnRecivedChat, CallFunc_Greater_IntInt_ReturnValue) == 0x0001D4, "Member 'WBP_Ingame_Chat_C_OnRecivedChat::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_OnRecivedChat, K2Node_CreateDelegate_OutputDelegate) == 0x0001D8, "Member 'WBP_Ingame_Chat_C_OnRecivedChat::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_Chat_C_OnRecivedChat, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001E8, "Member 'WBP_Ingame_Chat_C_OnRecivedChat::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

}

