#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Buildup_Pal_Status

#include "Basic.hpp"

#include "Pal_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Buildup_Pal_Status.WBP_Buildup_Pal_Status_C.ConfirmDialog
// 0x0001 (0x0001 - 0x0000)
struct WBP_Buildup_Pal_Status_C_ConfirmDialog final
{
public:
	bool                                          Confirmed;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Buildup_Pal_Status_C_ConfirmDialog) == 0x000001, "Wrong alignment on WBP_Buildup_Pal_Status_C_ConfirmDialog");
static_assert(sizeof(WBP_Buildup_Pal_Status_C_ConfirmDialog) == 0x000001, "Wrong size on WBP_Buildup_Pal_Status_C_ConfirmDialog");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ConfirmDialog, Confirmed) == 0x000000, "Member 'WBP_Buildup_Pal_Status_C_ConfirmDialog::Confirmed' has a wrong offset!");

// Function WBP_Buildup_Pal_Status.WBP_Buildup_Pal_Status_C.EmptyEvent
// 0x0001 (0x0001 - 0x0000)
struct WBP_Buildup_Pal_Status_C_EmptyEvent final
{
public:
	bool                                          bResult;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Buildup_Pal_Status_C_EmptyEvent) == 0x000001, "Wrong alignment on WBP_Buildup_Pal_Status_C_EmptyEvent");
static_assert(sizeof(WBP_Buildup_Pal_Status_C_EmptyEvent) == 0x000001, "Wrong size on WBP_Buildup_Pal_Status_C_EmptyEvent");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_EmptyEvent, bResult) == 0x000000, "Member 'WBP_Buildup_Pal_Status_C_EmptyEvent::bResult' has a wrong offset!");

// Function WBP_Buildup_Pal_Status.WBP_Buildup_Pal_Status_C.ExecuteUbergraph_WBP_Buildup_Pal_Status
// 0x02F0 (0x02F0 - 0x0000)
struct WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bResult)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_578F[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsUpgrade;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5790[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_Buildup_Pal_StatusContent_C*> K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_Buildup_Pal_StatusContent_C*       CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalCharacterStatusOperationName              CallFunc_Array_Get_Item_1;                         // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5791[0x2];                                     // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPalCharacterStatusOperationName Status, int32 TargetRank)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bResult)>                 K2Node_CreateDelegate_OutputDelegate_2;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Confirmed;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5792[0x1];                                     // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Buildup_Pal_StatusContent_C*       CallFunc_Array_Get_Item_2;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5793[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5794[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text;          // 0x0098(0x0018)()
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_1;        // 0x00B0(0x0018)()
	class FText                                   CallFunc_SelectText_ReturnValue;                   // 0x00C8(0x0018)()
	struct FDataTableRowHandle                    K2Node_Select_Default;                             // 0x00E0(0x0010)(NoDestructor)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_2;        // 0x00F0(0x0018)()
	TArray<class UWBP_Buildup_Pal_Item_C*>        K2Node_MakeArray_Array_1;                          // 0x0108(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_Buildup_Pal_Item_C*                CallFunc_Array_Get_Item_3;                         // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5795[0x3];                                     // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int64 NowMoney)>               K2Node_CreateDelegate_OutputDelegate_3;            // 0x0128(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalMoneyData*                          CallFunc_GetLocalMoneyData_ReturnValue;            // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetFocusTarget_Widget;                    // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5796[0x3];                                     // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5797[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Buildup_Pal_StatusContent_C*       CallFunc_Array_Get_Item_4;                         // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5798[0x3];                                     // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemAndNum_ItemIndex;                  // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemAndNum_Num;                        // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_5;                         // 0x016C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5799[0x4];                                     // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetItemName_outName;                      // 0x0178(0x0018)()
	class FName                                   CallFunc_StaticItemID_Money_ReturnValue;           // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579A[0x4];                                     // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetItemName_outName_1;                    // 0x01A0(0x0018)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_SelectText_ReturnValue_1;                 // 0x01C0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01D8(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0228(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0278(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0288(0x0018)()
	struct FGuid                                  CallFunc_Dialog_ReturnValue;                       // 0x02A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_1;                 // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579B[0x4];                                     // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Buildup_Pal_StatusContent_C*       CallFunc_Array_Get_Item_6;                         // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bResult;                        // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579C[0x6];                                     // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_3;        // 0x02C8(0x0018)()
	struct FGuid                                  CallFunc_Dialog_ReturnValue_1;                     // 0x02E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status) == 0x000008, "Wrong alignment on WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status");
static_assert(sizeof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status) == 0x0002F0, "Wrong size on WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, EntryPoint) == 0x000000, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, Temp_bool_Variable) == 0x000020, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, Temp_int_Array_Index_Variable_1) == 0x000024, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, Temp_int_Loop_Counter_Variable_1) == 0x000028, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_Add_IntInt_ReturnValue_1) == 0x00002C, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, Temp_int_Array_Index_Variable_2) == 0x000030, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, K2Node_CustomEvent_IsUpgrade) == 0x000034, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::K2Node_CustomEvent_IsUpgrade' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, K2Node_MakeArray_Array) == 0x000038, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, Temp_byte_Variable) == 0x000054, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_Array_Get_Item_1) == 0x000055, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, K2Node_CreateDelegate_OutputDelegate_1) == 0x000058, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, K2Node_CreateDelegate_OutputDelegate_2) == 0x000068, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, K2Node_CustomEvent_Confirmed) == 0x000078, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::K2Node_CustomEvent_Confirmed' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000079, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, Temp_byte_Variable_1) == 0x00007A, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, Temp_int_Loop_Counter_Variable_2) == 0x00007C, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_Array_Get_Item_2) == 0x000080, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_Add_IntInt_ReturnValue_2) == 0x00008C, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_Array_Length_ReturnValue_1) == 0x000090, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_Less_IntInt_ReturnValue_1) == 0x000094, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_GetLocalizedTextFromHandle_Text) == 0x000098, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_GetLocalizedTextFromHandle_Text' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_GetLocalizedTextFromHandle_Text_1) == 0x0000B0, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_GetLocalizedTextFromHandle_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_SelectText_ReturnValue) == 0x0000C8, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_SelectText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, K2Node_Select_Default) == 0x0000E0, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_GetLocalizedTextFromHandle_Text_2) == 0x0000F0, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_GetLocalizedTextFromHandle_Text_2' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, K2Node_MakeArray_Array_1) == 0x000108, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_Array_Get_Item_3) == 0x000118, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_Array_Length_ReturnValue_2) == 0x000120, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_Less_IntInt_ReturnValue_2) == 0x000124, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, K2Node_CreateDelegate_OutputDelegate_3) == 0x000128, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_GetLocalMoneyData_ReturnValue) == 0x000138, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_GetLocalMoneyData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_GetFocusTarget_Widget) == 0x000140, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_GetFocusTarget_Widget' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_Array_Find_ReturnValue) == 0x000148, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, Temp_bool_Variable_1) == 0x00014C, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_Max_ReturnValue) == 0x000150, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_Array_Get_Item_4) == 0x000158, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, K2Node_Select_Default_1) == 0x000160, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_GetItemAndNum_ItemIndex) == 0x000164, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_GetItemAndNum_ItemIndex' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_GetItemAndNum_Num) == 0x000168, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_GetItemAndNum_Num' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_Array_Get_Item_5) == 0x00016C, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_GetItemName_outName) == 0x000178, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_GetItemName_outName' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_StaticItemID_Money_ReturnValue) == 0x000190, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_StaticItemID_Money_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_SelectInt_ReturnValue) == 0x000198, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_GetItemName_outName_1) == 0x0001A0, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_GetItemName_outName_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0001B8, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_SelectText_ReturnValue_1) == 0x0001C0, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_SelectText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, K2Node_MakeStruct_FormatArgumentData) == 0x0001D8, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, K2Node_MakeStruct_FormatArgumentData_1) == 0x000228, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, K2Node_MakeArray_Array_2) == 0x000278, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_Format_ReturnValue) == 0x000288, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_Dialog_ReturnValue) == 0x0002A0, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_Dialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_Array_Find_ReturnValue_1) == 0x0002B0, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_Array_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_Array_Get_Item_6) == 0x0002B8, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x0002C0, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, K2Node_CustomEvent_bResult) == 0x0002C1, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::K2Node_CustomEvent_bResult' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_GetLocalizedTextFromHandle_Text_3) == 0x0002C8, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_GetLocalizedTextFromHandle_Text_3' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status, CallFunc_Dialog_ReturnValue_1) == 0x0002E0, "Member 'WBP_Buildup_Pal_Status_C_ExecuteUbergraph_WBP_Buildup_Pal_Status::CallFunc_Dialog_ReturnValue_1' has a wrong offset!");

// Function WBP_Buildup_Pal_Status.WBP_Buildup_Pal_Status_C.GetFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Buildup_Pal_Status_C_GetFocusTarget final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Buildup_Pal_Status_C_GetFocusTarget) == 0x000008, "Wrong alignment on WBP_Buildup_Pal_Status_C_GetFocusTarget");
static_assert(sizeof(WBP_Buildup_Pal_Status_C_GetFocusTarget) == 0x000008, "Wrong size on WBP_Buildup_Pal_Status_C_GetFocusTarget");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_GetFocusTarget, Widget) == 0x000000, "Member 'WBP_Buildup_Pal_Status_C_GetFocusTarget::Widget' has a wrong offset!");

// Function WBP_Buildup_Pal_Status.WBP_Buildup_Pal_Status_C.InvokeRankup__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Buildup_Pal_Status_C_InvokeRankup__DelegateSignature final
{
public:
	EPalCharacterStatusOperationName              Status;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579D[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TargetRank;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Buildup_Pal_Status_C_InvokeRankup__DelegateSignature) == 0x000004, "Wrong alignment on WBP_Buildup_Pal_Status_C_InvokeRankup__DelegateSignature");
static_assert(sizeof(WBP_Buildup_Pal_Status_C_InvokeRankup__DelegateSignature) == 0x000008, "Wrong size on WBP_Buildup_Pal_Status_C_InvokeRankup__DelegateSignature");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_InvokeRankup__DelegateSignature, Status) == 0x000000, "Member 'WBP_Buildup_Pal_Status_C_InvokeRankup__DelegateSignature::Status' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_InvokeRankup__DelegateSignature, TargetRank) == 0x000004, "Member 'WBP_Buildup_Pal_Status_C_InvokeRankup__DelegateSignature::TargetRank' has a wrong offset!");

// Function WBP_Buildup_Pal_Status.WBP_Buildup_Pal_Status_C.On Money Changed
// 0x0050 (0x0050 - 0x0000)
struct WBP_Buildup_Pal_Status_C_On_Money_Changed final
{
public:
	int64                                         NewMoney;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579E[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_Int64ToText_ReturnValue;             // 0x0010(0x0018)()
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_Int64Int64_ReturnValue;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579F[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Buildup_Pal_Status_C_On_Money_Changed) == 0x000008, "Wrong alignment on WBP_Buildup_Pal_Status_C_On_Money_Changed");
static_assert(sizeof(WBP_Buildup_Pal_Status_C_On_Money_Changed) == 0x000050, "Wrong size on WBP_Buildup_Pal_Status_C_On_Money_Changed");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_On_Money_Changed, NewMoney) == 0x000000, "Member 'WBP_Buildup_Pal_Status_C_On_Money_Changed::NewMoney' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_On_Money_Changed, Temp_bool_Variable) == 0x000008, "Member 'WBP_Buildup_Pal_Status_C_On_Money_Changed::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_On_Money_Changed, CallFunc_Conv_Int64ToText_ReturnValue) == 0x000010, "Member 'WBP_Buildup_Pal_Status_C_On_Money_Changed::CallFunc_Conv_Int64ToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_On_Money_Changed, Temp_object_Variable) == 0x000028, "Member 'WBP_Buildup_Pal_Status_C_On_Money_Changed::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_On_Money_Changed, Temp_object_Variable_1) == 0x000030, "Member 'WBP_Buildup_Pal_Status_C_On_Money_Changed::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_On_Money_Changed, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000038, "Member 'WBP_Buildup_Pal_Status_C_On_Money_Changed::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_On_Money_Changed, CallFunc_Less_Int64Int64_ReturnValue) == 0x000040, "Member 'WBP_Buildup_Pal_Status_C_On_Money_Changed::CallFunc_Less_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_On_Money_Changed, K2Node_Select_Default) == 0x000048, "Member 'WBP_Buildup_Pal_Status_C_On_Money_Changed::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Buildup_Pal_Status.WBP_Buildup_Pal_Status_C.Predict Status
// 0x0030 (0x0030 - 0x0000)
struct WBP_Buildup_Pal_Status_C_Predict_Status final
{
public:
	EPalCharacterStatusOperationName              Status;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57A0[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TargetRank;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57A1[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_2;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57A2[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Buildup_Pal_StatusContent_C*       CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57A3[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Buildup_Pal_StatusContent_C*       CallFunc_Array_Get_Item_1;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Buildup_Pal_Status_C_Predict_Status) == 0x000008, "Wrong alignment on WBP_Buildup_Pal_Status_C_Predict_Status");
static_assert(sizeof(WBP_Buildup_Pal_Status_C_Predict_Status) == 0x000030, "Wrong size on WBP_Buildup_Pal_Status_C_Predict_Status");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Predict_Status, Status) == 0x000000, "Member 'WBP_Buildup_Pal_Status_C_Predict_Status::Status' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Predict_Status, TargetRank) == 0x000004, "Member 'WBP_Buildup_Pal_Status_C_Predict_Status::TargetRank' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Predict_Status, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000008, "Member 'WBP_Buildup_Pal_Status_C_Predict_Status::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Predict_Status, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000009, "Member 'WBP_Buildup_Pal_Status_C_Predict_Status::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Predict_Status, CallFunc_Array_Find_ReturnValue) == 0x00000C, "Member 'WBP_Buildup_Pal_Status_C_Predict_Status::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Predict_Status, CallFunc_NotEqual_ByteByte_ReturnValue_2) == 0x000010, "Member 'WBP_Buildup_Pal_Status_C_Predict_Status::CallFunc_NotEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Predict_Status, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_Buildup_Pal_Status_C_Predict_Status::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Predict_Status, CallFunc_Array_Find_ReturnValue_1) == 0x000020, "Member 'WBP_Buildup_Pal_Status_C_Predict_Status::CallFunc_Array_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Predict_Status, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'WBP_Buildup_Pal_Status_C_Predict_Status::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function WBP_Buildup_Pal_Status.WBP_Buildup_Pal_Status_C.Setup
// 0x0190 (0x0190 - 0x0000)
struct WBP_Buildup_Pal_Status_C_Setup final
{
public:
	class UPalIndividualCharacterHandle*          Handle;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           ItemIds;                                           // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57A4[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterParameter*       CallFunc_TryGetIndividualParameter_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, int32>                      CallFunc_GetReturnItemsForResetCharacterStatusAll_ReturnValue; // 0x0028(0x0050)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0078(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57A5[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalMoneyData*                          CallFunc_GetLocalMoneyData_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57A6[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_GetNowMoney_ReturnValue;                  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_Int64Int64_ReturnValue;              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57A7[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x00DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57A8[0x4];                                     // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_Int64ToText_ReturnValue;             // 0x00E8(0x0018)()
	int32                                         CallFunc_Map_Find_Value;                           // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57A9[0x3];                                     // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Buildup_Pal_Item_C*                CallFunc_Array_Get_Item_1;                         // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57AA[0x3];                                     // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRequiredMoneyCountForResetCharacterStatusAll_ReturnValue; // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57AB[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Buildup_Pal_StatusContent_C*       CallFunc_Array_Get_Item_2;                         // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPalCharacterStatusOperationName              CallFunc_Get_Status_Status;                        // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57AC[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentStatusRank_ReturnValue;         // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetRequiredItemCountForCharacterStatus_OutStaticItemId; // 0x013C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRequiredItemCountForCharacterStatus_OutItemNum; // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57AD[0x4];                                     // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0150(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57AE[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPalStaticItemIdAndNum>         CallFunc_CollectLocalPlayerControllableItemInfos_OutItemInfos; // 0x0168(0x0010)(ReferenceParm)
	struct FPalStaticItemIdAndNum                 CallFunc_Array_Get_Item_3;                         // 0x0178(0x000C)(NoDestructor)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Buildup_Pal_Status_C_Setup) == 0x000008, "Wrong alignment on WBP_Buildup_Pal_Status_C_Setup");
static_assert(sizeof(WBP_Buildup_Pal_Status_C_Setup) == 0x000190, "Wrong size on WBP_Buildup_Pal_Status_C_Setup");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, Handle) == 0x000000, "Member 'WBP_Buildup_Pal_Status_C_Setup::Handle' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, ItemIds) == 0x000008, "Member 'WBP_Buildup_Pal_Status_C_Setup::ItemIds' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_Buildup_Pal_Status_C_Setup::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, CallFunc_TryGetIndividualParameter_ReturnValue) == 0x000020, "Member 'WBP_Buildup_Pal_Status_C_Setup::CallFunc_TryGetIndividualParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, CallFunc_GetReturnItemsForResetCharacterStatusAll_ReturnValue) == 0x000028, "Member 'WBP_Buildup_Pal_Status_C_Setup::CallFunc_GetReturnItemsForResetCharacterStatusAll_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, CallFunc_Conv_IntToText_ReturnValue) == 0x000078, "Member 'WBP_Buildup_Pal_Status_C_Setup::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'WBP_Buildup_Pal_Status_C_Setup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, Temp_int_Loop_Counter_Variable) == 0x000094, "Member 'WBP_Buildup_Pal_Status_C_Setup::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, CallFunc_Add_IntInt_ReturnValue) == 0x000098, "Member 'WBP_Buildup_Pal_Status_C_Setup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, Temp_int_Array_Index_Variable_1) == 0x00009C, "Member 'WBP_Buildup_Pal_Status_C_Setup::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, Temp_int_Loop_Counter_Variable_1) == 0x0000A0, "Member 'WBP_Buildup_Pal_Status_C_Setup::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000A4, "Member 'WBP_Buildup_Pal_Status_C_Setup::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, Temp_object_Variable) == 0x0000A8, "Member 'WBP_Buildup_Pal_Status_C_Setup::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0000B0, "Member 'WBP_Buildup_Pal_Status_C_Setup::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, CallFunc_GetLocalMoneyData_ReturnValue) == 0x0000B8, "Member 'WBP_Buildup_Pal_Status_C_Setup::CallFunc_GetLocalMoneyData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, Temp_object_Variable_1) == 0x0000C0, "Member 'WBP_Buildup_Pal_Status_C_Setup::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, CallFunc_IsValid_ReturnValue_1) == 0x0000C8, "Member 'WBP_Buildup_Pal_Status_C_Setup::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, CallFunc_GetNowMoney_ReturnValue) == 0x0000D0, "Member 'WBP_Buildup_Pal_Status_C_Setup::CallFunc_GetNowMoney_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, CallFunc_Less_Int64Int64_ReturnValue) == 0x0000D8, "Member 'WBP_Buildup_Pal_Status_C_Setup::CallFunc_Less_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, CallFunc_Array_Get_Item) == 0x0000DC, "Member 'WBP_Buildup_Pal_Status_C_Setup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, CallFunc_Conv_Int64ToText_ReturnValue) == 0x0000E8, "Member 'WBP_Buildup_Pal_Status_C_Setup::CallFunc_Conv_Int64ToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, CallFunc_Map_Find_Value) == 0x000100, "Member 'WBP_Buildup_Pal_Status_C_Setup::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, CallFunc_Map_Find_ReturnValue) == 0x000104, "Member 'WBP_Buildup_Pal_Status_C_Setup::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, CallFunc_Array_Get_Item_1) == 0x000108, "Member 'WBP_Buildup_Pal_Status_C_Setup::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, CallFunc_Array_Length_ReturnValue) == 0x000110, "Member 'WBP_Buildup_Pal_Status_C_Setup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, CallFunc_Less_IntInt_ReturnValue) == 0x000114, "Member 'WBP_Buildup_Pal_Status_C_Setup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, CallFunc_GetRequiredMoneyCountForResetCharacterStatusAll_ReturnValue) == 0x000118, "Member 'WBP_Buildup_Pal_Status_C_Setup::CallFunc_GetRequiredMoneyCountForResetCharacterStatusAll_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, Temp_bool_Variable) == 0x00011C, "Member 'WBP_Buildup_Pal_Status_C_Setup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, CallFunc_Array_Get_Item_2) == 0x000120, "Member 'WBP_Buildup_Pal_Status_C_Setup::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, CallFunc_Get_Status_Status) == 0x000128, "Member 'WBP_Buildup_Pal_Status_C_Setup::CallFunc_Get_Status_Status' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, K2Node_Select_Default) == 0x000130, "Member 'WBP_Buildup_Pal_Status_C_Setup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, CallFunc_GetCurrentStatusRank_ReturnValue) == 0x000138, "Member 'WBP_Buildup_Pal_Status_C_Setup::CallFunc_GetCurrentStatusRank_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, CallFunc_GetRequiredItemCountForCharacterStatus_OutStaticItemId) == 0x00013C, "Member 'WBP_Buildup_Pal_Status_C_Setup::CallFunc_GetRequiredItemCountForCharacterStatus_OutStaticItemId' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Status_C_Setup, CallFunc_GetRequiredItemCountForCharacterStatus_OutItemNum) == 0x000144, "Member 'WBP_Buildup_Pal_Status_C_Setup::CallFunc_GetRequiredItemCountForCharacterStatus_OutItemNum' has a wrong offset!");
