#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_CharacterHungerGauge

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_IndividualParameterBindWidget_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_CharacterHungerGauge.WBP_Menu_CharacterHungerGauge_C
// 0x0040 (0x05E0 - 0x05A0)
class UWBP_Menu_CharacterHungerGauge_C : public UWBP_IndividualParameterBindWidget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_Menu_CharacterHungerGauge_C;    // 0x05A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           Canvas_Hunger;                                     // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_96;                                          // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Line;                                        // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_HungerGauge;                           // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_MaxHunger;                                    // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_NowHunger;                                    // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     TextHunger;                                        // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_Menu_CharacterHungerGauge(int32 EntryPoint);
	void OnInitialized();
	void UpdateHunger(double NowHunger, double NowMaxHunger);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_CharacterHungerGauge_C">();
	}
	static class UWBP_Menu_CharacterHungerGauge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_CharacterHungerGauge_C>();
	}
};
static_assert(alignof(UWBP_Menu_CharacterHungerGauge_C) == 0x000008, "Wrong alignment on UWBP_Menu_CharacterHungerGauge_C");
static_assert(sizeof(UWBP_Menu_CharacterHungerGauge_C) == 0x0005E0, "Wrong size on UWBP_Menu_CharacterHungerGauge_C");
static_assert(offsetof(UWBP_Menu_CharacterHungerGauge_C, UberGraphFrame_WBP_Menu_CharacterHungerGauge_C) == 0x0005A0, "Member 'UWBP_Menu_CharacterHungerGauge_C::UberGraphFrame_WBP_Menu_CharacterHungerGauge_C' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_CharacterHungerGauge_C, Canvas_Hunger) == 0x0005A8, "Member 'UWBP_Menu_CharacterHungerGauge_C::Canvas_Hunger' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_CharacterHungerGauge_C, Image_96) == 0x0005B0, "Member 'UWBP_Menu_CharacterHungerGauge_C::Image_96' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_CharacterHungerGauge_C, Image_Line) == 0x0005B8, "Member 'UWBP_Menu_CharacterHungerGauge_C::Image_Line' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_CharacterHungerGauge_C, ProgressBar_HungerGauge) == 0x0005C0, "Member 'UWBP_Menu_CharacterHungerGauge_C::ProgressBar_HungerGauge' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_CharacterHungerGauge_C, Text_MaxHunger) == 0x0005C8, "Member 'UWBP_Menu_CharacterHungerGauge_C::Text_MaxHunger' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_CharacterHungerGauge_C, Text_NowHunger) == 0x0005D0, "Member 'UWBP_Menu_CharacterHungerGauge_C::Text_NowHunger' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_CharacterHungerGauge_C, TextHunger) == 0x0005D8, "Member 'UWBP_Menu_CharacterHungerGauge_C::TextHunger' has a wrong offset!");

}

