#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CommonRadialMenuBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Pal_structs.hpp"
#include "Pal_classes.hpp"
#include "CommonInput_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CommonRadialMenuBase.WBP_CommonRadialMenuBase_C
// 0x0158 (0x05A8 - 0x0450)
class UWBP_CommonRadialMenuBase_C : public UPalUIRadialMenuWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CursorLoop;                                        // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_In;                                        // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur;                                    // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Inner;                                 // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Cursor;                                      // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_radialBase;                                  // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RadialMenu_base_C*                 WBP_RadialMenu_base;                               // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectedMenuImage;                                 // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 SelectedMenuInnerImage;                            // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnSelectedIndex_forBP;                             // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        MenuOffSetLength;                                  // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnDecideIndex_forBP;                               // 0x04B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        AdditionalWidgetOffsetLength;                      // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnableCheck;                                     // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5987[0x7];                                     // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 SelectedMenuLeftBorderImage;                       // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 SelectedMenuRightBorderImage;                      // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDIsplayOnly;                                     // 0x04E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5988[0x7];                                     // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     SelectedPlateMaterial;                             // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     SelectedBorderMaterial;                            // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     BackGroundPlateMaterial;                           // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUseLocalControllerInput;                         // 0x0508(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5989[0x7];                                     // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MouseDetectDelta;                                  // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CenterWidget;                                      // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   DecideActionHandle;                                // 0x0520(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FPalUIActionBindData                   DummyPressedActionHandle;                          // 0x0524(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UPalUserWidget*                         InputParentWidget;                                 // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMap<int32, class UWidget*>                   AdditionalWidget;                                  // 0x0530(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FVector2D                              CenterOffset;                                      // 0x0580(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MenuScale;                                         // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          HoveredSound;                                      // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          ClickedSound;                                      // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void BuildRadialMenuWidget();
	void Calc_Image_Angle(int32 Param_Index, double* OutAngle);
	void CalcAdditionalWidgetPosition(int32 Param_Index, struct FVector2D* Offset);
	void CalcOffsetPosition(int32 Param_Index, struct FVector2D* Offset);
	void CheckMouse_LocalController();
	void ClearAdditionalWidgets();
	void ClearCenterWidget();
	void Close();
	void Construct();
	void CreateBgPlateImage();
	void CreateSelectedMenuImage();
	void Destruct();
	void ExecuteUbergraph_WBP_CommonRadialMenuBase(int32 EntryPoint);
	void GetCenterPosition(struct FVector2D* Position);
	void OnChangedIndex(int32 NewIndex, int32 PrevIndex);
	void OnChangedInputMethod(ECommonInputType bNewInputType);
	void OnDecided();
	void OnDecideIndex_forBP__DelegateSignature(int32 Param_Index);
	void OnInitialized();
	struct FEventReply OnMouseMove(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnPressed_Dummy();
	struct FEventReply OnPreviewMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnSelectedIndex_forBP__DelegateSignature(int32 NewIndex, int32 LastIndex);
	void Open(class UPalUserWidget* ParentWidget, const struct FPalDataTableRowName_UIInputAction& DecideAction);
	void PreConstruct(bool IsDesignTime);
	void RecalcMenuNum(int32 NewMenuNum);
	void Set_Additional_Widget(int32 Param_Index, class UUserWidget* AddWidget, class UCanvasPanelSlot** Canvas);
	void Set_Center_Widget(class UWidget* Widget, const struct FVector2D& CanvasSize, const struct FVector2D& Offset);
	void SetArrowVisibility(bool Param_IsVisible);
	void SetMouseCursorPositionCenter();
	void SetSelectedImageAngle(double InAngle);
	void SetSelectedImageVisibility(bool Param_IsVisible);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CommonRadialMenuBase_C">();
	}
	static class UWBP_CommonRadialMenuBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CommonRadialMenuBase_C>();
	}
};
static_assert(alignof(UWBP_CommonRadialMenuBase_C) == 0x000008, "Wrong alignment on UWBP_CommonRadialMenuBase_C");
static_assert(sizeof(UWBP_CommonRadialMenuBase_C) == 0x0005A8, "Wrong size on UWBP_CommonRadialMenuBase_C");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, UberGraphFrame) == 0x000450, "Member 'UWBP_CommonRadialMenuBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, CursorLoop) == 0x000458, "Member 'UWBP_CommonRadialMenuBase_C::CursorLoop' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, Default_In) == 0x000460, "Member 'UWBP_CommonRadialMenuBase_C::Default_In' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, BackgroundBlur) == 0x000468, "Member 'UWBP_CommonRadialMenuBase_C::BackgroundBlur' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, CanvasPanel_Inner) == 0x000470, "Member 'UWBP_CommonRadialMenuBase_C::CanvasPanel_Inner' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, Image_Cursor) == 0x000478, "Member 'UWBP_CommonRadialMenuBase_C::Image_Cursor' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, Image_radialBase) == 0x000480, "Member 'UWBP_CommonRadialMenuBase_C::Image_radialBase' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, WBP_RadialMenu_base) == 0x000488, "Member 'UWBP_CommonRadialMenuBase_C::WBP_RadialMenu_base' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, SelectedMenuImage) == 0x000490, "Member 'UWBP_CommonRadialMenuBase_C::SelectedMenuImage' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, SelectedMenuInnerImage) == 0x000498, "Member 'UWBP_CommonRadialMenuBase_C::SelectedMenuInnerImage' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, OnSelectedIndex_forBP) == 0x0004A0, "Member 'UWBP_CommonRadialMenuBase_C::OnSelectedIndex_forBP' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, MenuOffSetLength) == 0x0004B0, "Member 'UWBP_CommonRadialMenuBase_C::MenuOffSetLength' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, OnDecideIndex_forBP) == 0x0004B8, "Member 'UWBP_CommonRadialMenuBase_C::OnDecideIndex_forBP' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, AdditionalWidgetOffsetLength) == 0x0004C8, "Member 'UWBP_CommonRadialMenuBase_C::AdditionalWidgetOffsetLength' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, IsEnableCheck) == 0x0004D0, "Member 'UWBP_CommonRadialMenuBase_C::IsEnableCheck' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, SelectedMenuLeftBorderImage) == 0x0004D8, "Member 'UWBP_CommonRadialMenuBase_C::SelectedMenuLeftBorderImage' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, SelectedMenuRightBorderImage) == 0x0004E0, "Member 'UWBP_CommonRadialMenuBase_C::SelectedMenuRightBorderImage' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, IsDIsplayOnly) == 0x0004E8, "Member 'UWBP_CommonRadialMenuBase_C::IsDIsplayOnly' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, SelectedPlateMaterial) == 0x0004F0, "Member 'UWBP_CommonRadialMenuBase_C::SelectedPlateMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, SelectedBorderMaterial) == 0x0004F8, "Member 'UWBP_CommonRadialMenuBase_C::SelectedBorderMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, BackGroundPlateMaterial) == 0x000500, "Member 'UWBP_CommonRadialMenuBase_C::BackGroundPlateMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, IsUseLocalControllerInput) == 0x000508, "Member 'UWBP_CommonRadialMenuBase_C::IsUseLocalControllerInput' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, MouseDetectDelta) == 0x000510, "Member 'UWBP_CommonRadialMenuBase_C::MouseDetectDelta' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, CenterWidget) == 0x000518, "Member 'UWBP_CommonRadialMenuBase_C::CenterWidget' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, DecideActionHandle) == 0x000520, "Member 'UWBP_CommonRadialMenuBase_C::DecideActionHandle' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, DummyPressedActionHandle) == 0x000524, "Member 'UWBP_CommonRadialMenuBase_C::DummyPressedActionHandle' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, InputParentWidget) == 0x000528, "Member 'UWBP_CommonRadialMenuBase_C::InputParentWidget' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, AdditionalWidget) == 0x000530, "Member 'UWBP_CommonRadialMenuBase_C::AdditionalWidget' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, CenterOffset) == 0x000580, "Member 'UWBP_CommonRadialMenuBase_C::CenterOffset' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, MenuScale) == 0x000590, "Member 'UWBP_CommonRadialMenuBase_C::MenuScale' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, HoveredSound) == 0x000598, "Member 'UWBP_CommonRadialMenuBase_C::HoveredSound' has a wrong offset!");
static_assert(offsetof(UWBP_CommonRadialMenuBase_C, ClickedSound) == 0x0005A0, "Member 'UWBP_CommonRadialMenuBase_C::ClickedSound' has a wrong offset!");

}

