#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InventoryEquipment_ForDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Pal_structs.hpp"
#include "Pal_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InventoryEquipment_ForDisplay.WBP_InventoryEquipment_ForDisplay_C
// 0x0030 (0x0488 - 0x0458)
class UWBP_InventoryEquipment_ForDisplay_C final : public UPalUIInventoryEquipment
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0458(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventoryEquipment_C*              WBP_InventoryEquipment;                            // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InGameMenuInventoryModel_C*         Model;                                             // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FPalDataTableRowName_UIInputAction     SimulateStatusPointInput;                          // 0x0478(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FPalDataTableRowName_UIInputAction     ConfirmStatusPointInput;                           // 0x0480(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_InventoryEquipment_ForDisplay_WBP_InventoryEquipment_K2Node_ComponentBoundEvent_0_OnClickedItemDrop__DelegateSignature();
	void BndEvt__WBP_InventoryEquipment_ForDisplay_WBP_InventoryEquipment_K2Node_ComponentBoundEvent_1_OnClickedItemDestroy__DelegateSignature();
	void BndEvt__WBP_InventoryEquipment_ForDisplay_WBP_InventoryEquipment_K2Node_ComponentBoundEvent_2_OnConfirmStatusPointEdit__DelegateSignature(const TMap<class FName, int32>& PointMap);
	void BndEvt__WBP_InventoryEquipment_ForDisplay_WBP_InventoryEquipment_K2Node_ComponentBoundEvent_3_OnRequestSwapEquipment__DelegateSignature(EPalPlayerEquipItemSlotType EquipType);
	void BndEvt__WBP_InventoryEquipment_ForDisplay_WBP_InventoryEquipment_K2Node_ComponentBoundEvent_4_OnClickedSortButton__DelegateSignature();
	void BndEvt__WBP_InventoryEquipment_ForDisplay_WBP_InventoryEquipment_K2Node_ComponentBoundEvent_5_OnClickedChangePlayerNameButton__DelegateSignature();
	void CancelSimulateStatusPoint();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_InventoryEquipment_ForDisplay(int32 EntryPoint);
	void OnCloseChangePlayerNameWindow(class UPalHUDDispatchParameterBase* Param_Param);
	void OnEndGlide();
	void OnStartGlide();
	void OnUpdateInventoryWeight(float NowWeight);
	void OpenNameEditWindow();
	void Setup(class UBP_InGameMenuInventoryModel_C* Param_Model);
	void Setup_Static_Input_Action();
	void Try_Start_Simulate_Status_Point();

	class UWidget* BP_GetDesiredFocusTarget() const;
	void IsSimulatingStatusPoint(bool* IsSimulating) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_InventoryEquipment_ForDisplay_C">();
	}
	static class UWBP_InventoryEquipment_ForDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InventoryEquipment_ForDisplay_C>();
	}
};
static_assert(alignof(UWBP_InventoryEquipment_ForDisplay_C) == 0x000008, "Wrong alignment on UWBP_InventoryEquipment_ForDisplay_C");
static_assert(sizeof(UWBP_InventoryEquipment_ForDisplay_C) == 0x000488, "Wrong size on UWBP_InventoryEquipment_ForDisplay_C");
static_assert(offsetof(UWBP_InventoryEquipment_ForDisplay_C, UberGraphFrame) == 0x000458, "Member 'UWBP_InventoryEquipment_ForDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_ForDisplay_C, InvalidationBox_0) == 0x000460, "Member 'UWBP_InventoryEquipment_ForDisplay_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_ForDisplay_C, WBP_InventoryEquipment) == 0x000468, "Member 'UWBP_InventoryEquipment_ForDisplay_C::WBP_InventoryEquipment' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_ForDisplay_C, Model) == 0x000470, "Member 'UWBP_InventoryEquipment_ForDisplay_C::Model' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_ForDisplay_C, SimulateStatusPointInput) == 0x000478, "Member 'UWBP_InventoryEquipment_ForDisplay_C::SimulateStatusPointInput' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_ForDisplay_C, ConfirmStatusPointInput) == 0x000480, "Member 'UWBP_InventoryEquipment_ForDisplay_C::ConfirmStatusPointInput' has a wrong offset!");

}

