#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenu_Technology_Content

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Pal_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_MainMenu_Technology_Content.WBP_MainMenu_Technology_Content_C.BndEvt__WBP_MainMenu_Technology_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MainMenu_Technology_Content_C_BndEvt__WBP_MainMenu_Technology_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_Content_C_BndEvt__WBP_MainMenu_Technology_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_Content_C_BndEvt__WBP_MainMenu_Technology_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_MainMenu_Technology_Content_C_BndEvt__WBP_MainMenu_Technology_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_MainMenu_Technology_Content_C_BndEvt__WBP_MainMenu_Technology_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_BndEvt__WBP_MainMenu_Technology_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_MainMenu_Technology_Content_C_BndEvt__WBP_MainMenu_Technology_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MainMenu_Technology_Content.WBP_MainMenu_Technology_Content_C.BndEvt__WBP_MainMenu_Technology_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MainMenu_Technology_Content_C_BndEvt__WBP_MainMenu_Technology_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_Content_C_BndEvt__WBP_MainMenu_Technology_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_Content_C_BndEvt__WBP_MainMenu_Technology_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_MainMenu_Technology_Content_C_BndEvt__WBP_MainMenu_Technology_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_MainMenu_Technology_Content_C_BndEvt__WBP_MainMenu_Technology_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_BndEvt__WBP_MainMenu_Technology_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_MainMenu_Technology_Content_C_BndEvt__WBP_MainMenu_Technology_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MainMenu_Technology_Content.WBP_MainMenu_Technology_Content_C.BndEvt__WBP_MainMenu_Technology_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MainMenu_Technology_Content_C_BndEvt__WBP_MainMenu_Technology_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_Content_C_BndEvt__WBP_MainMenu_Technology_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_Content_C_BndEvt__WBP_MainMenu_Technology_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_MainMenu_Technology_Content_C_BndEvt__WBP_MainMenu_Technology_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_MainMenu_Technology_Content_C_BndEvt__WBP_MainMenu_Technology_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_BndEvt__WBP_MainMenu_Technology_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_MainMenu_Technology_Content_C_BndEvt__WBP_MainMenu_Technology_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MainMenu_Technology_Content.WBP_MainMenu_Technology_Content_C.ExecuteUbergraph_WBP_MainMenu_Technology_Content
// 0x0080 (0x0080 - 0x0000)
struct WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUnlockable_isUnlockable;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUnlocked_isUnlocked;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUnlockable_isUnlockable_1;              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3527[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3528[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_1;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3529[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_2;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content");
static_assert(sizeof(WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content) == 0x000080, "Wrong size on WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content, EntryPoint) == 0x000000, "Member 'WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content, CallFunc_IsUnlockable_isUnlockable) == 0x000004, "Member 'WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content::CallFunc_IsUnlockable_isUnlockable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content, Temp_bool_Variable) == 0x000005, "Member 'WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content, Temp_bool_Variable_1) == 0x000006, "Member 'WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content, Temp_bool_Variable_2) == 0x000007, "Member 'WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content, CallFunc_IsUnlocked_isUnlocked) == 0x000018, "Member 'WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content::CallFunc_IsUnlocked_isUnlocked' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content, CallFunc_IsUnlockable_isUnlockable_1) == 0x000019, "Member 'WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content::CallFunc_IsUnlockable_isUnlockable_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content, CallFunc_PlayAnimation_ReturnValue_2) == 0x000020, "Member 'WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000028, "Member 'WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content, K2Node_Select_Default) == 0x000030, "Member 'WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content, CallFunc_PlayAnimation_ReturnValue_3) == 0x000038, "Member 'WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content, K2Node_Select_Default_1) == 0x000040, "Member 'WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content, CallFunc_PlayAnimation_ReturnValue_4) == 0x000048, "Member 'WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content, K2Node_Event_IsDesignTime) == 0x000050, "Member 'WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content, K2Node_Select_Default_2) == 0x000058, "Member 'WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content, CallFunc_PlayAnimation_ReturnValue_5) == 0x000060, "Member 'WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content, K2Node_ComponentBoundEvent_Button_2) == 0x000068, "Member 'WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content, K2Node_ComponentBoundEvent_Button_1) == 0x000070, "Member 'WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content, K2Node_ComponentBoundEvent_Button) == 0x000078, "Member 'WBP_MainMenu_Technology_Content_C_ExecuteUbergraph_WBP_MainMenu_Technology_Content::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function WBP_MainMenu_Technology_Content.WBP_MainMenu_Technology_Content_C.GetBindedTechnologyName
// 0x0008 (0x0008 - 0x0000)
struct WBP_MainMenu_Technology_Content_C_GetBindedTechnologyName final
{
public:
	class FName                                   TechnologyName;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_Content_C_GetBindedTechnologyName) == 0x000004, "Wrong alignment on WBP_MainMenu_Technology_Content_C_GetBindedTechnologyName");
static_assert(sizeof(WBP_MainMenu_Technology_Content_C_GetBindedTechnologyName) == 0x000008, "Wrong size on WBP_MainMenu_Technology_Content_C_GetBindedTechnologyName");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_GetBindedTechnologyName, TechnologyName) == 0x000000, "Member 'WBP_MainMenu_Technology_Content_C_GetBindedTechnologyName::TechnologyName' has a wrong offset!");

// Function WBP_MainMenu_Technology_Content.WBP_MainMenu_Technology_Content_C.isUnlockable
// 0x0020 (0x0020 - 0x0000)
struct WBP_MainMenu_Technology_Content_C_IsUnlockable final
{
public:
	bool                                          Param_IsUnlockable;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352A[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetBindedTechnologyName_technologyName;   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352B[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalTechnologyData*                     CallFunc_GetLocalTechnologyData_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUnlockableRecipeTechnology_ReturnValue; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_Content_C_IsUnlockable) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_Content_C_IsUnlockable");
static_assert(sizeof(WBP_MainMenu_Technology_Content_C_IsUnlockable) == 0x000020, "Wrong size on WBP_MainMenu_Technology_Content_C_IsUnlockable");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_IsUnlockable, Param_IsUnlockable) == 0x000000, "Member 'WBP_MainMenu_Technology_Content_C_IsUnlockable::Param_IsUnlockable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_IsUnlockable, CallFunc_GetBindedTechnologyName_technologyName) == 0x000004, "Member 'WBP_MainMenu_Technology_Content_C_IsUnlockable::CallFunc_GetBindedTechnologyName_technologyName' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_IsUnlockable, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'WBP_MainMenu_Technology_Content_C_IsUnlockable::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_IsUnlockable, CallFunc_GetLocalTechnologyData_ReturnValue) == 0x000010, "Member 'WBP_MainMenu_Technology_Content_C_IsUnlockable::CallFunc_GetLocalTechnologyData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_IsUnlockable, CallFunc_IsUnlockableRecipeTechnology_ReturnValue) == 0x000018, "Member 'WBP_MainMenu_Technology_Content_C_IsUnlockable::CallFunc_IsUnlockableRecipeTechnology_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_IsUnlockable, CallFunc_BooleanAND_ReturnValue) == 0x000019, "Member 'WBP_MainMenu_Technology_Content_C_IsUnlockable::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_MainMenu_Technology_Content.WBP_MainMenu_Technology_Content_C.IsUnlocked
// 0x0020 (0x0020 - 0x0000)
struct WBP_MainMenu_Technology_Content_C_IsUnlocked final
{
public:
	bool                                          Param_IsUnlocked;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352C[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetBindedTechnologyName_technologyName;   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352D[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalTechnologyData*                     CallFunc_GetLocalTechnologyData_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUnlockRecipeTechnology_ReturnValue;     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_Content_C_IsUnlocked) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_Content_C_IsUnlocked");
static_assert(sizeof(WBP_MainMenu_Technology_Content_C_IsUnlocked) == 0x000020, "Wrong size on WBP_MainMenu_Technology_Content_C_IsUnlocked");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_IsUnlocked, Param_IsUnlocked) == 0x000000, "Member 'WBP_MainMenu_Technology_Content_C_IsUnlocked::Param_IsUnlocked' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_IsUnlocked, CallFunc_GetBindedTechnologyName_technologyName) == 0x000004, "Member 'WBP_MainMenu_Technology_Content_C_IsUnlocked::CallFunc_GetBindedTechnologyName_technologyName' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_IsUnlocked, CallFunc_GetLocalTechnologyData_ReturnValue) == 0x000010, "Member 'WBP_MainMenu_Technology_Content_C_IsUnlocked::CallFunc_GetLocalTechnologyData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_IsUnlocked, CallFunc_IsUnlockRecipeTechnology_ReturnValue) == 0x000018, "Member 'WBP_MainMenu_Technology_Content_C_IsUnlocked::CallFunc_IsUnlockRecipeTechnology_ReturnValue' has a wrong offset!");

// Function WBP_MainMenu_Technology_Content.WBP_MainMenu_Technology_Content_C.OnClickedButton__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MainMenu_Technology_Content_C_OnClickedButton__DelegateSignature final
{
public:
	class UWBP_MainMenu_Technology_Content_C*     Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_Content_C_OnClickedButton__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_Content_C_OnClickedButton__DelegateSignature");
static_assert(sizeof(WBP_MainMenu_Technology_Content_C_OnClickedButton__DelegateSignature) == 0x000008, "Wrong size on WBP_MainMenu_Technology_Content_C_OnClickedButton__DelegateSignature");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_OnClickedButton__DelegateSignature, Widget) == 0x000000, "Member 'WBP_MainMenu_Technology_Content_C_OnClickedButton__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_MainMenu_Technology_Content.WBP_MainMenu_Technology_Content_C.OnHoveredButton__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MainMenu_Technology_Content_C_OnHoveredButton__DelegateSignature final
{
public:
	class UWBP_MainMenu_Technology_Content_C*     Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_Content_C_OnHoveredButton__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_Content_C_OnHoveredButton__DelegateSignature");
static_assert(sizeof(WBP_MainMenu_Technology_Content_C_OnHoveredButton__DelegateSignature) == 0x000008, "Wrong size on WBP_MainMenu_Technology_Content_C_OnHoveredButton__DelegateSignature");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_OnHoveredButton__DelegateSignature, Widget) == 0x000000, "Member 'WBP_MainMenu_Technology_Content_C_OnHoveredButton__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_MainMenu_Technology_Content.WBP_MainMenu_Technology_Content_C.OnUnhoveredButton__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MainMenu_Technology_Content_C_OnUnhoveredButton__DelegateSignature final
{
public:
	class UWBP_MainMenu_Technology_Content_C*     Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_Content_C_OnUnhoveredButton__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_Content_C_OnUnhoveredButton__DelegateSignature");
static_assert(sizeof(WBP_MainMenu_Technology_Content_C_OnUnhoveredButton__DelegateSignature) == 0x000008, "Wrong size on WBP_MainMenu_Technology_Content_C_OnUnhoveredButton__DelegateSignature");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_OnUnhoveredButton__DelegateSignature, Widget) == 0x000000, "Member 'WBP_MainMenu_Technology_Content_C_OnUnhoveredButton__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_MainMenu_Technology_Content.WBP_MainMenu_Technology_Content_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_MainMenu_Technology_Content_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_Content_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_MainMenu_Technology_Content_C_PreConstruct");
static_assert(sizeof(WBP_MainMenu_Technology_Content_C_PreConstruct) == 0x000001, "Wrong size on WBP_MainMenu_Technology_Content_C_PreConstruct");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_MainMenu_Technology_Content_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_MainMenu_Technology_Content.WBP_MainMenu_Technology_Content_C.SetShouldMaskSkillUnlock
// 0x0090 (0x0090 - 0x0000)
struct WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock final
{
public:
	TArray<class FName>                           ItemRecipes;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class FName>                           NewLocalVar;                                       // 0x0010(0x0010)(Edit, BlueprintVisible)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352E[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352F[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalDebugSetting*                       CallFunc_GetPalDebugSetting_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalTribeID                                   CallFunc_GetTribeIDFromCharacterID_ReturnValue;    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3530[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalPlayerRecordData*                   CallFunc_GetLocalRecordData_ReturnValue;           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRecordData_TribeIdCount_ReturnValue;   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock");
static_assert(sizeof(WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock) == 0x000090, "Wrong size on WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock, ItemRecipes) == 0x000000, "Member 'WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock::ItemRecipes' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock, NewLocalVar) == 0x000010, "Member 'WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock::NewLocalVar' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock, CallFunc_Array_IsEmpty_ReturnValue) == 0x000028, "Member 'WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock, CallFunc_Conv_NameToString_ReturnValue) == 0x000030, "Member 'WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock, CallFunc_Split_LeftS) == 0x000040, "Member 'WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock, CallFunc_Split_RightS) == 0x000050, "Member 'WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock, CallFunc_Split_ReturnValue) == 0x000060, "Member 'WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock, CallFunc_GetPalDebugSetting_ReturnValue) == 0x000068, "Member 'WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock::CallFunc_GetPalDebugSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock, CallFunc_Conv_StringToName_ReturnValue) == 0x000070, "Member 'WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock, CallFunc_GetTribeIDFromCharacterID_ReturnValue) == 0x000079, "Member 'WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock::CallFunc_GetTribeIDFromCharacterID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00007A, "Member 'WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x00007B, "Member 'WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock, CallFunc_GetLocalRecordData_ReturnValue) == 0x000080, "Member 'WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock::CallFunc_GetLocalRecordData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock, CallFunc_GetRecordData_TribeIdCount_ReturnValue) == 0x000088, "Member 'WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock::CallFunc_GetRecordData_TribeIdCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00008C, "Member 'WBP_MainMenu_Technology_Content_C_SetShouldMaskSkillUnlock::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_MainMenu_Technology_Content.WBP_MainMenu_Technology_Content_C.Setup
// 0x0300 (0x0300 - 0x0000)
struct WBP_MainMenu_Technology_Content_C_Setup final
{
public:
	class FName                                   TechnologyName;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           TempRecipes;                                       // 0x0008(0x0010)(Edit, BlueprintVisible)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3531[0x5];                                     // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable;                          // 0x0020(0x0030)(UObjectWrapper, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0060(0x0014)()
	uint8                                         Pad_3532[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text;          // 0x0078(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3533[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalPlayerRecordData*                   CallFunc_GetLocalRecordData_ReturnValue;           // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3534[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetBindedOriginalText_ReturnValue;        // 0x00B0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00C8(0x0050)(HasGetValueTypeHash)
	class UPalTechnologyData*                     CallFunc_GetLocalTechnologyData_ReturnValue;       // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalTechnologyRecipeUnlockDataTableRow CallFunc_GetRecipeTechlonogy_ReturnValue;          // 0x0120(0x0060)(ConstParm)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3535[0x7];                                     // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0188(0x0018)()
	struct FDataTableRowHandle                    K2Node_Select_Default;                             // 0x01A0(0x0010)(NoDestructor)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_1;        // 0x01B0(0x0018)()
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUnlockRecipeTechnology_ReturnValue;     // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3536[0x6];                                     // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3537[0x7];                                     // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01E0(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3538[0x7];                                     // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0238(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0248(0x0018)()
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3539[0x6];                                     // 0x0262(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetTechnologyIcon_SoftIconTexture;        // 0x0268(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_353A[0x7];                                     // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default_2;                           // 0x02A0(0x0030)(UObjectWrapper, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizedText_ReturnValue;             // 0x02D0(0x0018)()
	class FText                                   CallFunc_SelectText_ReturnValue;                   // 0x02E8(0x0018)()
};
static_assert(alignof(WBP_MainMenu_Technology_Content_C_Setup) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_Content_C_Setup");
static_assert(sizeof(WBP_MainMenu_Technology_Content_C_Setup) == 0x000300, "Wrong size on WBP_MainMenu_Technology_Content_C_Setup");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, TechnologyName) == 0x000000, "Member 'WBP_MainMenu_Technology_Content_C_Setup::TechnologyName' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, TempRecipes) == 0x000008, "Member 'WBP_MainMenu_Technology_Content_C_Setup::TempRecipes' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, Temp_byte_Variable) == 0x000018, "Member 'WBP_MainMenu_Technology_Content_C_Setup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, Temp_byte_Variable_1) == 0x000019, "Member 'WBP_MainMenu_Technology_Content_C_Setup::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, Temp_bool_Variable) == 0x00001A, "Member 'WBP_MainMenu_Technology_Content_C_Setup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, Temp_softobject_Variable) == 0x000020, "Member 'WBP_MainMenu_Technology_Content_C_Setup::Temp_softobject_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, CallFunc_SelectColor_ReturnValue) == 0x000050, "Member 'WBP_MainMenu_Technology_Content_C_Setup::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, K2Node_MakeStruct_SlateColor) == 0x000060, "Member 'WBP_MainMenu_Technology_Content_C_Setup::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, CallFunc_GetLocalizedTextFromHandle_Text) == 0x000078, "Member 'WBP_MainMenu_Technology_Content_C_Setup::CallFunc_GetLocalizedTextFromHandle_Text' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, Temp_bool_Variable_1) == 0x000090, "Member 'WBP_MainMenu_Technology_Content_C_Setup::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, CallFunc_GetLocalRecordData_ReturnValue) == 0x000098, "Member 'WBP_MainMenu_Technology_Content_C_Setup::CallFunc_GetLocalRecordData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, Temp_bool_Variable_2) == 0x0000A0, "Member 'WBP_MainMenu_Technology_Content_C_Setup::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0000A8, "Member 'WBP_MainMenu_Technology_Content_C_Setup::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, CallFunc_GetBindedOriginalText_ReturnValue) == 0x0000B0, "Member 'WBP_MainMenu_Technology_Content_C_Setup::CallFunc_GetBindedOriginalText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, K2Node_MakeStruct_FormatArgumentData) == 0x0000C8, "Member 'WBP_MainMenu_Technology_Content_C_Setup::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, CallFunc_GetLocalTechnologyData_ReturnValue) == 0x000118, "Member 'WBP_MainMenu_Technology_Content_C_Setup::CallFunc_GetLocalTechnologyData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, CallFunc_GetRecipeTechlonogy_ReturnValue) == 0x000120, "Member 'WBP_MainMenu_Technology_Content_C_Setup::CallFunc_GetRecipeTechlonogy_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, CallFunc_Array_IsEmpty_ReturnValue) == 0x000180, "Member 'WBP_MainMenu_Technology_Content_C_Setup::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, CallFunc_Conv_IntToText_ReturnValue) == 0x000188, "Member 'WBP_MainMenu_Technology_Content_C_Setup::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, K2Node_Select_Default) == 0x0001A0, "Member 'WBP_MainMenu_Technology_Content_C_Setup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, CallFunc_GetLocalizedTextFromHandle_Text_1) == 0x0001B0, "Member 'WBP_MainMenu_Technology_Content_C_Setup::CallFunc_GetLocalizedTextFromHandle_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, CallFunc_NotEqual_NameName_ReturnValue) == 0x0001C8, "Member 'WBP_MainMenu_Technology_Content_C_Setup::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, CallFunc_IsUnlockRecipeTechnology_ReturnValue) == 0x0001C9, "Member 'WBP_MainMenu_Technology_Content_C_Setup::CallFunc_IsUnlockRecipeTechnology_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0001D0, "Member 'WBP_MainMenu_Technology_Content_C_Setup::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, CallFunc_Not_PreBool_ReturnValue) == 0x0001D8, "Member 'WBP_MainMenu_Technology_Content_C_Setup::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001E0, "Member 'WBP_MainMenu_Technology_Content_C_Setup::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, CallFunc_BooleanAND_ReturnValue) == 0x000230, "Member 'WBP_MainMenu_Technology_Content_C_Setup::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, K2Node_MakeArray_Array) == 0x000238, "Member 'WBP_MainMenu_Technology_Content_C_Setup::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, CallFunc_Format_ReturnValue) == 0x000248, "Member 'WBP_MainMenu_Technology_Content_C_Setup::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, K2Node_Select_Default_1) == 0x000260, "Member 'WBP_MainMenu_Technology_Content_C_Setup::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000261, "Member 'WBP_MainMenu_Technology_Content_C_Setup::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, CallFunc_GetTechnologyIcon_SoftIconTexture) == 0x000268, "Member 'WBP_MainMenu_Technology_Content_C_Setup::CallFunc_GetTechnologyIcon_SoftIconTexture' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000298, "Member 'WBP_MainMenu_Technology_Content_C_Setup::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, K2Node_Select_Default_2) == 0x0002A0, "Member 'WBP_MainMenu_Technology_Content_C_Setup::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, CallFunc_GetLocalizedText_ReturnValue) == 0x0002D0, "Member 'WBP_MainMenu_Technology_Content_C_Setup::CallFunc_GetLocalizedText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_Setup, CallFunc_SelectText_ReturnValue) == 0x0002E8, "Member 'WBP_MainMenu_Technology_Content_C_Setup::CallFunc_SelectText_ReturnValue' has a wrong offset!");

// Function WBP_MainMenu_Technology_Content.WBP_MainMenu_Technology_Content_C.UpdateButtonDetail
// 0x0080 (0x0080 - 0x0000)
struct WBP_MainMenu_Technology_Content_C_UpdateButtonDetail final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_353B[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetBindedTechnologyName_technologyName;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalTechnologyData*                     CallFunc_GetLocalTechnologyData_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalTechnologyRecipeUnlockDataTableRow CallFunc_GetRecipeTechlonogy_ReturnValue;          // 0x0018(0x0060)(ConstParm)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_1;          // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUnlockRecipeTechnology_ReturnValue;     // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNewUnlockedTechnology_ReturnValue;      // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x007F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_Content_C_UpdateButtonDetail) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_Content_C_UpdateButtonDetail");
static_assert(sizeof(WBP_MainMenu_Technology_Content_C_UpdateButtonDetail) == 0x000080, "Wrong size on WBP_MainMenu_Technology_Content_C_UpdateButtonDetail");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_UpdateButtonDetail, Temp_byte_Variable) == 0x000000, "Member 'WBP_MainMenu_Technology_Content_C_UpdateButtonDetail::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Content_C_UpdateButtonDetail, Temp_byte_Variable_1) == 0x000001, "Member 'WBP_MainMenu_Technology_Content_C_UpdateButtonDetail::Temp_byte_Variable_1' has a wrong offset!");
