#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PalStatus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Pal_structs.hpp"


namespace SDK::Params
{

// Function WBP_PalStatus.WBP_PalStatus_C.BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_0_OnClickedAnyPalPanel__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_0_OnClickedAnyPalPanel__DelegateSignature final
{
public:
	class UPalIndividualCharacterHandle*          Handle;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_0_OnClickedAnyPalPanel__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_0_OnClickedAnyPalPanel__DelegateSignature");
static_assert(sizeof(WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_0_OnClickedAnyPalPanel__DelegateSignature) == 0x000008, "Wrong size on WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_0_OnClickedAnyPalPanel__DelegateSignature");
static_assert(offsetof(WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_0_OnClickedAnyPalPanel__DelegateSignature, Handle) == 0x000000, "Member 'WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_0_OnClickedAnyPalPanel__DelegateSignature::Handle' has a wrong offset!");

// Function WBP_PalStatus.WBP_PalStatus_C.BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_1_OnHoveredAnyPalPanel__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_1_OnHoveredAnyPalPanel__DelegateSignature final
{
public:
	class UPalIndividualCharacterHandle*          Handle;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_1_OnHoveredAnyPalPanel__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_1_OnHoveredAnyPalPanel__DelegateSignature");
static_assert(sizeof(WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_1_OnHoveredAnyPalPanel__DelegateSignature) == 0x000008, "Wrong size on WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_1_OnHoveredAnyPalPanel__DelegateSignature");
static_assert(offsetof(WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_1_OnHoveredAnyPalPanel__DelegateSignature, Handle) == 0x000000, "Member 'WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_1_OnHoveredAnyPalPanel__DelegateSignature::Handle' has a wrong offset!");

// Function WBP_PalStatus.WBP_PalStatus_C.BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_3_OnCommitedNickName__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_3_OnCommitedNickName__DelegateSignature final
{
public:
	class FText                                   NewNickName;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_3_OnCommitedNickName__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_3_OnCommitedNickName__DelegateSignature");
static_assert(sizeof(WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_3_OnCommitedNickName__DelegateSignature) == 0x000018, "Wrong size on WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_3_OnCommitedNickName__DelegateSignature");
static_assert(offsetof(WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_3_OnCommitedNickName__DelegateSignature, NewNickName) == 0x000000, "Member 'WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_3_OnCommitedNickName__DelegateSignature::NewNickName' has a wrong offset!");

// Function WBP_PalStatus.WBP_PalStatus_C.BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_4_OnRequestedRemoveWaza__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_4_OnRequestedRemoveWaza__DelegateSignature final
{
public:
	EPalWazaID                                    WazaID;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58EE[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterHandle*          TargetHandle;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_4_OnRequestedRemoveWaza__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_4_OnRequestedRemoveWaza__DelegateSignature");
static_assert(sizeof(WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_4_OnRequestedRemoveWaza__DelegateSignature) == 0x000010, "Wrong size on WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_4_OnRequestedRemoveWaza__DelegateSignature");
static_assert(offsetof(WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_4_OnRequestedRemoveWaza__DelegateSignature, WazaID) == 0x000000, "Member 'WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_4_OnRequestedRemoveWaza__DelegateSignature::WazaID' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_4_OnRequestedRemoveWaza__DelegateSignature, TargetHandle) == 0x000008, "Member 'WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_4_OnRequestedRemoveWaza__DelegateSignature::TargetHandle' has a wrong offset!");

// Function WBP_PalStatus.WBP_PalStatus_C.BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_5_OnSelectedChangeActiveSkill__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_5_OnSelectedChangeActiveSkill__DelegateSignature final
{
public:
	class UPalIndividualCharacterHandle*          TargetHandle;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPalWazaID                                    ChangeWazaID;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalWazaID                                    NewWazaID;                                         // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_5_OnSelectedChangeActiveSkill__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_5_OnSelectedChangeActiveSkill__DelegateSignature");
static_assert(sizeof(WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_5_OnSelectedChangeActiveSkill__DelegateSignature) == 0x000010, "Wrong size on WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_5_OnSelectedChangeActiveSkill__DelegateSignature");
static_assert(offsetof(WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_5_OnSelectedChangeActiveSkill__DelegateSignature, TargetHandle) == 0x000000, "Member 'WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_5_OnSelectedChangeActiveSkill__DelegateSignature::TargetHandle' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_5_OnSelectedChangeActiveSkill__DelegateSignature, ChangeWazaID) == 0x000008, "Member 'WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_5_OnSelectedChangeActiveSkill__DelegateSignature::ChangeWazaID' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_5_OnSelectedChangeActiveSkill__DelegateSignature, NewWazaID) == 0x000009, "Member 'WBP_PalStatus_C_BndEvt__WBP_PalStatus_WBP_MainMenu_Pal_00_K2Node_ComponentBoundEvent_5_OnSelectedChangeActiveSkill__DelegateSignature::NewWazaID' has a wrong offset!");

// Function WBP_PalStatus.WBP_PalStatus_C.ClampInputNickName
// 0x0080 (0x0080 - 0x0000)
struct WBP_PalStatus_C_ClampInputNickName final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   ClampedNickName;                                   // 0x0018(0x0018)(Parm, OutParm)
	class UPalGameSetting*                        CallFunc_GetGameSetting_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58EF[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Left_ReturnValue;                         // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58F0[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0068(0x0018)()
};
static_assert(alignof(WBP_PalStatus_C_ClampInputNickName) == 0x000008, "Wrong alignment on WBP_PalStatus_C_ClampInputNickName");
static_assert(sizeof(WBP_PalStatus_C_ClampInputNickName) == 0x000080, "Wrong size on WBP_PalStatus_C_ClampInputNickName");
static_assert(offsetof(WBP_PalStatus_C_ClampInputNickName, InText) == 0x000000, "Member 'WBP_PalStatus_C_ClampInputNickName::InText' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_ClampInputNickName, ClampedNickName) == 0x000018, "Member 'WBP_PalStatus_C_ClampInputNickName::ClampedNickName' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_ClampInputNickName, CallFunc_GetGameSetting_ReturnValue) == 0x000030, "Member 'WBP_PalStatus_C_ClampInputNickName::CallFunc_GetGameSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_ClampInputNickName, CallFunc_Conv_TextToString_ReturnValue) == 0x000038, "Member 'WBP_PalStatus_C_ClampInputNickName::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_ClampInputNickName, CallFunc_Len_ReturnValue) == 0x000048, "Member 'WBP_PalStatus_C_ClampInputNickName::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_ClampInputNickName, CallFunc_Left_ReturnValue) == 0x000050, "Member 'WBP_PalStatus_C_ClampInputNickName::CallFunc_Left_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_ClampInputNickName, CallFunc_Greater_IntInt_ReturnValue) == 0x000060, "Member 'WBP_PalStatus_C_ClampInputNickName::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_ClampInputNickName, CallFunc_Conv_StringToText_ReturnValue) == 0x000068, "Member 'WBP_PalStatus_C_ClampInputNickName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_PalStatus.WBP_PalStatus_C.ExecuteUbergraph_WBP_PalStatus
// 0x0098 (0x0098 - 0x0000)
struct WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58F1[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterHandle*          K2Node_ComponentBoundEvent_handle;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PalMonsterCaptureSet_C*             CallFunc_GetCaptureCameraActor_cameraActor;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58F2[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterHandle*          K2Node_ComponentBoundEvent_handle_1;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Get_Panel_Index_from_Handle_index;        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Panel_Index_from_Handle_isValid;      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58F3[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_newNickName;            // 0x0038(0x0018)()
	class FText                                   CallFunc_NickNameFinalCheck_finalNickName;         // 0x0050(0x0018)()
	class UPalIndividualCharacterHandle*          CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterHandle*          K2Node_ComponentBoundEvent_TargetHandle_1;         // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPalWazaID                                    K2Node_ComponentBoundEvent_ChangeWazaID;           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalWazaID                                    K2Node_ComponentBoundEvent_NewWazaID;              // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalWazaID                                    K2Node_ComponentBoundEvent_WazaID;                 // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58F4[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterHandle*          K2Node_ComponentBoundEvent_TargetHandle;           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus) == 0x000008, "Wrong alignment on WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus");
static_assert(sizeof(WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus) == 0x000098, "Wrong size on WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus");
static_assert(offsetof(WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus, EntryPoint) == 0x000000, "Member 'WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus, K2Node_ComponentBoundEvent_handle) == 0x000008, "Member 'WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus::K2Node_ComponentBoundEvent_handle' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus, CallFunc_GetCaptureCameraActor_cameraActor) == 0x000010, "Member 'WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus::CallFunc_GetCaptureCameraActor_cameraActor' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus, K2Node_ComponentBoundEvent_handle_1) == 0x000028, "Member 'WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus::K2Node_ComponentBoundEvent_handle_1' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus, CallFunc_Get_Panel_Index_from_Handle_index) == 0x000030, "Member 'WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus::CallFunc_Get_Panel_Index_from_Handle_index' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus, CallFunc_Get_Panel_Index_from_Handle_isValid) == 0x000034, "Member 'WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus::CallFunc_Get_Panel_Index_from_Handle_isValid' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus, K2Node_ComponentBoundEvent_newNickName) == 0x000038, "Member 'WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus::K2Node_ComponentBoundEvent_newNickName' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus, CallFunc_NickNameFinalCheck_finalNickName) == 0x000050, "Member 'WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus::CallFunc_NickNameFinalCheck_finalNickName' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus, CallFunc_Array_Get_Item) == 0x000068, "Member 'WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus, K2Node_ComponentBoundEvent_TargetHandle_1) == 0x000070, "Member 'WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus::K2Node_ComponentBoundEvent_TargetHandle_1' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus, K2Node_ComponentBoundEvent_ChangeWazaID) == 0x000078, "Member 'WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus::K2Node_ComponentBoundEvent_ChangeWazaID' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus, K2Node_ComponentBoundEvent_NewWazaID) == 0x000079, "Member 'WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus::K2Node_ComponentBoundEvent_NewWazaID' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00007A, "Member 'WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus, K2Node_ComponentBoundEvent_WazaID) == 0x00007B, "Member 'WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus::K2Node_ComponentBoundEvent_WazaID' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus, K2Node_ComponentBoundEvent_TargetHandle) == 0x000080, "Member 'WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus::K2Node_ComponentBoundEvent_TargetHandle' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus, K2Node_CreateDelegate_OutputDelegate) == 0x000088, "Member 'WBP_PalStatus_C_ExecuteUbergraph_WBP_PalStatus::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_PalStatus.WBP_PalStatus_C.Get Panel Index from Handle
// 0x0030 (0x0030 - 0x0000)
struct WBP_PalStatus_C_Get_Panel_Index_from_Handle final
{
public:
	class UPalIndividualCharacterHandle*          Handle;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsValid;                                           // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58F5[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterHandle*          CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStatus_C_Get_Panel_Index_from_Handle) == 0x000008, "Wrong alignment on WBP_PalStatus_C_Get_Panel_Index_from_Handle");
static_assert(sizeof(WBP_PalStatus_C_Get_Panel_Index_from_Handle) == 0x000030, "Wrong size on WBP_PalStatus_C_Get_Panel_Index_from_Handle");
static_assert(offsetof(WBP_PalStatus_C_Get_Panel_Index_from_Handle, Handle) == 0x000000, "Member 'WBP_PalStatus_C_Get_Panel_Index_from_Handle::Handle' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_Get_Panel_Index_from_Handle, Param_Index) == 0x000008, "Member 'WBP_PalStatus_C_Get_Panel_Index_from_Handle::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_Get_Panel_Index_from_Handle, IsValid) == 0x00000C, "Member 'WBP_PalStatus_C_Get_Panel_Index_from_Handle::IsValid' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_Get_Panel_Index_from_Handle, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_PalStatus_C_Get_Panel_Index_from_Handle::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_Get_Panel_Index_from_Handle, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_PalStatus_C_Get_Panel_Index_from_Handle::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_Get_Panel_Index_from_Handle, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_PalStatus_C_Get_Panel_Index_from_Handle::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_Get_Panel_Index_from_Handle, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'WBP_PalStatus_C_Get_Panel_Index_from_Handle::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_Get_Panel_Index_from_Handle, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_PalStatus_C_Get_Panel_Index_from_Handle::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_Get_Panel_Index_from_Handle, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'WBP_PalStatus_C_Get_Panel_Index_from_Handle::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_Get_Panel_Index_from_Handle, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000029, "Member 'WBP_PalStatus_C_Get_Panel_Index_from_Handle::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_PalStatus.WBP_PalStatus_C.HoveredAnyPalPanel_Internal
// 0x0048 (0x0048 - 0x0000)
struct WBP_PalStatus_C_HoveredAnyPalPanel_Internal final
{
public:
	class UPalIndividualCharacterHandle*          Handle;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Get_Panel_Index_from_Handle_index;        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Panel_Index_from_Handle_isValid;      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58F6[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterParameter*       CallFunc_TryGetIndividualParameter_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58F7[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCharacterID_ReturnValue;               // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58F8[0x2];                                     // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue;        // 0x0038(0x0004)(NoDestructor)
	bool                                          CallFunc_IsShowingStatusWithList_isShowing;        // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58F9[0x2];                                     // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PalMonsterCaptureSet_C*             CallFunc_GetCaptureCameraActor_cameraActor;        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStatus_C_HoveredAnyPalPanel_Internal) == 0x000008, "Wrong alignment on WBP_PalStatus_C_HoveredAnyPalPanel_Internal");
static_assert(sizeof(WBP_PalStatus_C_HoveredAnyPalPanel_Internal) == 0x000048, "Wrong size on WBP_PalStatus_C_HoveredAnyPalPanel_Internal");
static_assert(offsetof(WBP_PalStatus_C_HoveredAnyPalPanel_Internal, Handle) == 0x000000, "Member 'WBP_PalStatus_C_HoveredAnyPalPanel_Internal::Handle' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_HoveredAnyPalPanel_Internal, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_PalStatus_C_HoveredAnyPalPanel_Internal::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_HoveredAnyPalPanel_Internal, CallFunc_Get_Panel_Index_from_Handle_index) == 0x000018, "Member 'WBP_PalStatus_C_HoveredAnyPalPanel_Internal::CallFunc_Get_Panel_Index_from_Handle_index' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_HoveredAnyPalPanel_Internal, CallFunc_Get_Panel_Index_from_Handle_isValid) == 0x00001C, "Member 'WBP_PalStatus_C_HoveredAnyPalPanel_Internal::CallFunc_Get_Panel_Index_from_Handle_isValid' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_HoveredAnyPalPanel_Internal, CallFunc_TryGetIndividualParameter_ReturnValue) == 0x000020, "Member 'WBP_PalStatus_C_HoveredAnyPalPanel_Internal::CallFunc_TryGetIndividualParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_HoveredAnyPalPanel_Internal, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WBP_PalStatus_C_HoveredAnyPalPanel_Internal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_HoveredAnyPalPanel_Internal, CallFunc_GetCharacterID_ReturnValue) == 0x00002C, "Member 'WBP_PalStatus_C_HoveredAnyPalPanel_Internal::CallFunc_GetCharacterID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_HoveredAnyPalPanel_Internal, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000034, "Member 'WBP_PalStatus_C_HoveredAnyPalPanel_Internal::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_HoveredAnyPalPanel_Internal, CallFunc_IsValid_ReturnValue_1) == 0x000035, "Member 'WBP_PalStatus_C_HoveredAnyPalPanel_Internal::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_HoveredAnyPalPanel_Internal, CallFunc_RegisterActionBinding_ReturnValue) == 0x000038, "Member 'WBP_PalStatus_C_HoveredAnyPalPanel_Internal::CallFunc_RegisterActionBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_HoveredAnyPalPanel_Internal, CallFunc_IsShowingStatusWithList_isShowing) == 0x00003C, "Member 'WBP_PalStatus_C_HoveredAnyPalPanel_Internal::CallFunc_IsShowingStatusWithList_isShowing' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_HoveredAnyPalPanel_Internal, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00003D, "Member 'WBP_PalStatus_C_HoveredAnyPalPanel_Internal::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_HoveredAnyPalPanel_Internal, CallFunc_GetCaptureCameraActor_cameraActor) == 0x000040, "Member 'WBP_PalStatus_C_HoveredAnyPalPanel_Internal::CallFunc_GetCaptureCameraActor_cameraActor' has a wrong offset!");

// Function WBP_PalStatus.WBP_PalStatus_C.Is Editing Nick Name
// 0x0001 (0x0001 - 0x0000)
struct WBP_PalStatus_C_Is_Editing_Nick_Name final
{
public:
	bool                                          IsEditing;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStatus_C_Is_Editing_Nick_Name) == 0x000001, "Wrong alignment on WBP_PalStatus_C_Is_Editing_Nick_Name");
static_assert(sizeof(WBP_PalStatus_C_Is_Editing_Nick_Name) == 0x000001, "Wrong size on WBP_PalStatus_C_Is_Editing_Nick_Name");
static_assert(offsetof(WBP_PalStatus_C_Is_Editing_Nick_Name, IsEditing) == 0x000000, "Member 'WBP_PalStatus_C_Is_Editing_Nick_Name::IsEditing' has a wrong offset!");

// Function WBP_PalStatus.WBP_PalStatus_C.NickNameFinalCheck
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_PalStatus_C_NickNameFinalCheck final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	ETextCommit                                   TextCommit;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58FA[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   FinalNickName;                                     // 0x0020(0x0018)(Parm, OutParm)
	class FText                                   CallFunc_ClampInputNickName_clampedNickName;       // 0x0038(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58FB[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterHandle*          CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterParameter*       CallFunc_TryGetIndividualParameter_ReturnValue;    // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetNickName_outName;                      // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0088(0x0018)()
};
static_assert(alignof(WBP_PalStatus_C_NickNameFinalCheck) == 0x000008, "Wrong alignment on WBP_PalStatus_C_NickNameFinalCheck");
static_assert(sizeof(WBP_PalStatus_C_NickNameFinalCheck) == 0x0000A0, "Wrong size on WBP_PalStatus_C_NickNameFinalCheck");
static_assert(offsetof(WBP_PalStatus_C_NickNameFinalCheck, InText) == 0x000000, "Member 'WBP_PalStatus_C_NickNameFinalCheck::InText' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_NickNameFinalCheck, TextCommit) == 0x000018, "Member 'WBP_PalStatus_C_NickNameFinalCheck::TextCommit' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_NickNameFinalCheck, FinalNickName) == 0x000020, "Member 'WBP_PalStatus_C_NickNameFinalCheck::FinalNickName' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_NickNameFinalCheck, CallFunc_ClampInputNickName_clampedNickName) == 0x000038, "Member 'WBP_PalStatus_C_NickNameFinalCheck::CallFunc_ClampInputNickName_clampedNickName' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_NickNameFinalCheck, CallFunc_Conv_TextToString_ReturnValue) == 0x000050, "Member 'WBP_PalStatus_C_NickNameFinalCheck::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_NickNameFinalCheck, CallFunc_Len_ReturnValue) == 0x000060, "Member 'WBP_PalStatus_C_NickNameFinalCheck::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_NickNameFinalCheck, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000064, "Member 'WBP_PalStatus_C_NickNameFinalCheck::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_NickNameFinalCheck, CallFunc_Array_Get_Item) == 0x000068, "Member 'WBP_PalStatus_C_NickNameFinalCheck::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_NickNameFinalCheck, CallFunc_TryGetIndividualParameter_ReturnValue) == 0x000070, "Member 'WBP_PalStatus_C_NickNameFinalCheck::CallFunc_TryGetIndividualParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_NickNameFinalCheck, CallFunc_GetNickName_outName) == 0x000078, "Member 'WBP_PalStatus_C_NickNameFinalCheck::CallFunc_GetNickName_outName' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_NickNameFinalCheck, CallFunc_Conv_StringToText_ReturnValue) == 0x000088, "Member 'WBP_PalStatus_C_NickNameFinalCheck::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_PalStatus.WBP_PalStatus_C.OnClosedDropPalDialog
// 0x0002 (0x0002 - 0x0000)
struct WBP_PalStatus_C_OnClosedDropPalDialog final
{
public:
	bool                                          bResult;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStatus_C_OnClosedDropPalDialog) == 0x000001, "Wrong alignment on WBP_PalStatus_C_OnClosedDropPalDialog");
static_assert(sizeof(WBP_PalStatus_C_OnClosedDropPalDialog) == 0x000002, "Wrong size on WBP_PalStatus_C_OnClosedDropPalDialog");
static_assert(offsetof(WBP_PalStatus_C_OnClosedDropPalDialog, bResult) == 0x000000, "Member 'WBP_PalStatus_C_OnClosedDropPalDialog::bResult' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_OnClosedDropPalDialog, CallFunc_Array_RemoveItem_ReturnValue) == 0x000001, "Member 'WBP_PalStatus_C_OnClosedDropPalDialog::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");

// Function WBP_PalStatus.WBP_PalStatus_C.OnTriggerDropPal
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_PalStatus_C_OnTriggerDropPal final
{
public:
	TDelegate<void(bool bResult)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58FC[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text;          // 0x0018(0x0018)()
	class UPalIndividualCharacterParameter*       CallFunc_TryGetIndividualParameter_ReturnValue;    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetNickName_outName;                      // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58FD[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0068(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C8(0x0018)()
	struct FGuid                                  CallFunc_Dialog_ReturnValue;                       // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStatus_C_OnTriggerDropPal) == 0x000008, "Wrong alignment on WBP_PalStatus_C_OnTriggerDropPal");
static_assert(sizeof(WBP_PalStatus_C_OnTriggerDropPal) == 0x0000F0, "Wrong size on WBP_PalStatus_C_OnTriggerDropPal");
static_assert(offsetof(WBP_PalStatus_C_OnTriggerDropPal, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_PalStatus_C_OnTriggerDropPal::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_OnTriggerDropPal, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_PalStatus_C_OnTriggerDropPal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_OnTriggerDropPal, CallFunc_GetLocalizedTextFromHandle_Text) == 0x000018, "Member 'WBP_PalStatus_C_OnTriggerDropPal::CallFunc_GetLocalizedTextFromHandle_Text' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_OnTriggerDropPal, CallFunc_TryGetIndividualParameter_ReturnValue) == 0x000030, "Member 'WBP_PalStatus_C_OnTriggerDropPal::CallFunc_TryGetIndividualParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_OnTriggerDropPal, CallFunc_GetNickName_outName) == 0x000038, "Member 'WBP_PalStatus_C_OnTriggerDropPal::CallFunc_GetNickName_outName' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_OnTriggerDropPal, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'WBP_PalStatus_C_OnTriggerDropPal::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_OnTriggerDropPal, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'WBP_PalStatus_C_OnTriggerDropPal::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_OnTriggerDropPal, K2Node_MakeStruct_FormatArgumentData) == 0x000068, "Member 'WBP_PalStatus_C_OnTriggerDropPal::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_OnTriggerDropPal, K2Node_MakeArray_Array) == 0x0000B8, "Member 'WBP_PalStatus_C_OnTriggerDropPal::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_OnTriggerDropPal, CallFunc_Format_ReturnValue) == 0x0000C8, "Member 'WBP_PalStatus_C_OnTriggerDropPal::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_OnTriggerDropPal, CallFunc_Dialog_ReturnValue) == 0x0000E0, "Member 'WBP_PalStatus_C_OnTriggerDropPal::CallFunc_Dialog_ReturnValue' has a wrong offset!");

// Function WBP_PalStatus.WBP_PalStatus_C.Setup
// 0x0018 (0x0018 - 0x0000)
struct WBP_PalStatus_C_Setup final
{
public:
	TArray<class UPalIndividualCharacterHandle*>  Handles;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStatus_C_Setup) == 0x000008, "Wrong alignment on WBP_PalStatus_C_Setup");
static_assert(sizeof(WBP_PalStatus_C_Setup) == 0x000018, "Wrong size on WBP_PalStatus_C_Setup");
static_assert(offsetof(WBP_PalStatus_C_Setup, Handles) == 0x000000, "Member 'WBP_PalStatus_C_Setup::Handles' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_Setup, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_PalStatus_C_Setup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_Setup, CallFunc_Greater_IntInt_ReturnValue) == 0x000014, "Member 'WBP_PalStatus_C_Setup::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_Setup, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000015, "Member 'WBP_PalStatus_C_Setup::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_PalStatus.WBP_PalStatus_C.Setup One Pal
// 0x0020 (0x0020 - 0x0000)
struct WBP_PalStatus_C_Setup_One_Pal final
{
public:
	class UPalIndividualCharacterHandle*          CharacterHandle;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UPalIndividualCharacterHandle*>  K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	class UPalIndividualCharacterHandle*          CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStatus_C_Setup_One_Pal) == 0x000008, "Wrong alignment on WBP_PalStatus_C_Setup_One_Pal");
static_assert(sizeof(WBP_PalStatus_C_Setup_One_Pal) == 0x000020, "Wrong size on WBP_PalStatus_C_Setup_One_Pal");
static_assert(offsetof(WBP_PalStatus_C_Setup_One_Pal, CharacterHandle) == 0x000000, "Member 'WBP_PalStatus_C_Setup_One_Pal::CharacterHandle' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_Setup_One_Pal, K2Node_MakeArray_Array) == 0x000008, "Member 'WBP_PalStatus_C_Setup_One_Pal::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_Setup_One_Pal, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_PalStatus_C_Setup_One_Pal::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_PalStatus.WBP_PalStatus_C.Setup_MultiPal
// 0x0020 (0x0020 - 0x0000)
struct WBP_PalStatus_C_Setup_MultiPal final
{
public:
	class UPalOtomoHolderComponentBase*           CallFunc_GetOtomoHolderComponent_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterHandle*          CallFunc_GetOtomoIndividualHandle_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStatus_C_Setup_MultiPal) == 0x000008, "Wrong alignment on WBP_PalStatus_C_Setup_MultiPal");
static_assert(sizeof(WBP_PalStatus_C_Setup_MultiPal) == 0x000020, "Wrong size on WBP_PalStatus_C_Setup_MultiPal");
static_assert(offsetof(WBP_PalStatus_C_Setup_MultiPal, CallFunc_GetOtomoHolderComponent_ReturnValue) == 0x000000, "Member 'WBP_PalStatus_C_Setup_MultiPal::CallFunc_GetOtomoHolderComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_Setup_MultiPal, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'WBP_PalStatus_C_Setup_MultiPal::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_Setup_MultiPal, CallFunc_GetOtomoIndividualHandle_ReturnValue) == 0x000010, "Member 'WBP_PalStatus_C_Setup_MultiPal::CallFunc_GetOtomoIndividualHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_Setup_MultiPal, CallFunc_GetCurrentInputType_ReturnValue) == 0x000018, "Member 'WBP_PalStatus_C_Setup_MultiPal::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_Setup_MultiPal, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'WBP_PalStatus_C_Setup_MultiPal::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_PalStatus.WBP_PalStatus_C.SetupInputAction
// 0x0028 (0x0028 - 0x0000)
struct WBP_PalStatus_C_SetupInputAction final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue;        // 0x0020(0x0004)(NoDestructor)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue_1;      // 0x0024(0x0004)(NoDestructor)
};
static_assert(alignof(WBP_PalStatus_C_SetupInputAction) == 0x000004, "Wrong alignment on WBP_PalStatus_C_SetupInputAction");
static_assert(sizeof(WBP_PalStatus_C_SetupInputAction) == 0x000028, "Wrong size on WBP_PalStatus_C_SetupInputAction");
static_assert(offsetof(WBP_PalStatus_C_SetupInputAction, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_PalStatus_C_SetupInputAction::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_SetupInputAction, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'WBP_PalStatus_C_SetupInputAction::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_SetupInputAction, CallFunc_RegisterActionBinding_ReturnValue) == 0x000020, "Member 'WBP_PalStatus_C_SetupInputAction::CallFunc_RegisterActionBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_SetupInputAction, CallFunc_RegisterActionBinding_ReturnValue_1) == 0x000024, "Member 'WBP_PalStatus_C_SetupInputAction::CallFunc_RegisterActionBinding_ReturnValue_1' has a wrong offset!");

// Function WBP_PalStatus.WBP_PalStatus_C.ShouldBackList
// 0x0002 (0x0002 - 0x0000)
struct WBP_PalStatus_C_ShouldBackList final
{
public:
	bool                                          ShouldBack;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShowingStatusWithList_isShowing;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStatus_C_ShouldBackList) == 0x000001, "Wrong alignment on WBP_PalStatus_C_ShouldBackList");
static_assert(sizeof(WBP_PalStatus_C_ShouldBackList) == 0x000002, "Wrong size on WBP_PalStatus_C_ShouldBackList");
static_assert(offsetof(WBP_PalStatus_C_ShouldBackList, ShouldBack) == 0x000000, "Member 'WBP_PalStatus_C_ShouldBackList::ShouldBack' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_ShouldBackList, CallFunc_IsShowingStatusWithList_isShowing) == 0x000001, "Member 'WBP_PalStatus_C_ShouldBackList::CallFunc_IsShowingStatusWithList_isShowing' has a wrong offset!");

// Function WBP_PalStatus.WBP_PalStatus_C.BP_GetDesiredFocusTarget
// 0x0018 (0x0018 - 0x0000)
struct WBP_PalStatus_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetRestoreFocusSkillPanelTarget_TargetWidget; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShowingStatusWithList_isShowing;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStatus_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_PalStatus_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_PalStatus_C_BP_GetDesiredFocusTarget) == 0x000018, "Wrong size on WBP_PalStatus_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_PalStatus_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_PalStatus_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStatus_C_BP_GetDesiredFocusTarget, CallFunc_GetRestoreFocusSkillPanelTarget_TargetWidget) == 0x000008, "Member 'WBP_PalStatus_C_BP_GetDesiredFocusTarget::CallFunc_GetRestoreFocusSkillPanelTarget_TargetWidget' has a wrong offset!");
