#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Ingameconstruction_KeyGuide

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Ingameconstruction_KeyGuide.WBP_Ingameconstruction_KeyGuide_C.Setup
// 0x0080 (0x0080 - 0x0000)
struct WBP_Ingameconstruction_KeyGuide_C_Setup final
{
public:
	TArray<class FName>                           ActionNames;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   DisplayText;                                       // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A3C[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A3D[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_PalKeyGuideIcon_C*                 CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PalKeyGuideIcon_C*                 CallFunc_Create_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Ingameconstruction_KeyGuide_C_Setup) == 0x000008, "Wrong alignment on WBP_Ingameconstruction_KeyGuide_C_Setup");
static_assert(sizeof(WBP_Ingameconstruction_KeyGuide_C_Setup) == 0x000080, "Wrong size on WBP_Ingameconstruction_KeyGuide_C_Setup");
static_assert(offsetof(WBP_Ingameconstruction_KeyGuide_C_Setup, ActionNames) == 0x000000, "Member 'WBP_Ingameconstruction_KeyGuide_C_Setup::ActionNames' has a wrong offset!");
static_assert(offsetof(WBP_Ingameconstruction_KeyGuide_C_Setup, DisplayText) == 0x000010, "Member 'WBP_Ingameconstruction_KeyGuide_C_Setup::DisplayText' has a wrong offset!");
static_assert(offsetof(WBP_Ingameconstruction_KeyGuide_C_Setup, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_Ingameconstruction_KeyGuide_C_Setup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingameconstruction_KeyGuide_C_Setup, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'WBP_Ingameconstruction_KeyGuide_C_Setup::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Ingameconstruction_KeyGuide_C_Setup, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_Ingameconstruction_KeyGuide_C_Setup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingameconstruction_KeyGuide_C_Setup, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'WBP_Ingameconstruction_KeyGuide_C_Setup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingameconstruction_KeyGuide_C_Setup, Temp_int_Array_Index_Variable) == 0x000038, "Member 'WBP_Ingameconstruction_KeyGuide_C_Setup::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Ingameconstruction_KeyGuide_C_Setup, Temp_int_Loop_Counter_Variable_1) == 0x00003C, "Member 'WBP_Ingameconstruction_KeyGuide_C_Setup::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Ingameconstruction_KeyGuide_C_Setup, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_Ingameconstruction_KeyGuide_C_Setup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Ingameconstruction_KeyGuide_C_Setup, CallFunc_Add_IntInt_ReturnValue_1) == 0x000048, "Member 'WBP_Ingameconstruction_KeyGuide_C_Setup::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Ingameconstruction_KeyGuide_C_Setup, CallFunc_Array_Length_ReturnValue_1) == 0x00004C, "Member 'WBP_Ingameconstruction_KeyGuide_C_Setup::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Ingameconstruction_KeyGuide_C_Setup, CallFunc_Less_IntInt_ReturnValue_1) == 0x000050, "Member 'WBP_Ingameconstruction_KeyGuide_C_Setup::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Ingameconstruction_KeyGuide_C_Setup, Temp_int_Array_Index_Variable_1) == 0x000054, "Member 'WBP_Ingameconstruction_KeyGuide_C_Setup::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Ingameconstruction_KeyGuide_C_Setup, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000058, "Member 'WBP_Ingameconstruction_KeyGuide_C_Setup::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingameconstruction_KeyGuide_C_Setup, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'WBP_Ingameconstruction_KeyGuide_C_Setup::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Ingameconstruction_KeyGuide_C_Setup, CallFunc_Create_ReturnValue) == 0x000068, "Member 'WBP_Ingameconstruction_KeyGuide_C_Setup::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingameconstruction_KeyGuide_C_Setup, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000070, "Member 'WBP_Ingameconstruction_KeyGuide_C_Setup::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingameconstruction_KeyGuide_C_Setup, CallFunc_Array_Add_ReturnValue) == 0x000078, "Member 'WBP_Ingameconstruction_KeyGuide_C_Setup::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

}

