#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PalAim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Pal_structs.hpp"
#include "Pal_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PalAim.WBP_PalAim_C
// 0x0048 (0x0458 - 0x0410)
class UWBP_PalAim_C final : public UPalUIAimReticleBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           AimCanvas;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_101;                                         // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Reticle_Cancel_C*                  WBP_Reticle_Cancel;                                // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Reticle_Pal_C*                     WBP_Reticle_Pal;                                   // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        TargetScale;                                       // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NowScale;                                          // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsThrowPalMode;                                    // 0x0448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4ACC[0x7];                                     // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CurrentCampLiftingPal;                             // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void DisplayOutlineTarget(struct FHitResult& HitResult);
	void EndThrowPalMode();
	void ExecuteUbergraph_WBP_PalAim(int32 EntryPoint);
	void Get_Reticle_Hit_Result(struct FHitResult* HitResult);
	void GetNowSelectedOtomoParameter(class UPalCharacterParameterComponent** Parameter);
	void On_Dead_Detail();
	void OnChangedWeaon(class APalWeaponBase* Weapon);
	void OnEndLiftCampPal();
	void OnLiftCampPal(class APalCharacter* TargetCharacter);
	void Raycast_Reticle_Direction_Body();
	void Setup_AfterCreatedPlayer();
	void Show_Assignable_Throwing_Pal(struct FHitResult& HitResult);
	void StartThrowPalMode();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PalAim_C">();
	}
	static class UWBP_PalAim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PalAim_C>();
	}
};
static_assert(alignof(UWBP_PalAim_C) == 0x000008, "Wrong alignment on UWBP_PalAim_C");
static_assert(sizeof(UWBP_PalAim_C) == 0x000458, "Wrong size on UWBP_PalAim_C");
static_assert(offsetof(UWBP_PalAim_C, UberGraphFrame) == 0x000410, "Member 'UWBP_PalAim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PalAim_C, AimCanvas) == 0x000418, "Member 'UWBP_PalAim_C::AimCanvas' has a wrong offset!");
static_assert(offsetof(UWBP_PalAim_C, Image_101) == 0x000420, "Member 'UWBP_PalAim_C::Image_101' has a wrong offset!");
static_assert(offsetof(UWBP_PalAim_C, WBP_Reticle_Cancel) == 0x000428, "Member 'UWBP_PalAim_C::WBP_Reticle_Cancel' has a wrong offset!");
static_assert(offsetof(UWBP_PalAim_C, WBP_Reticle_Pal) == 0x000430, "Member 'UWBP_PalAim_C::WBP_Reticle_Pal' has a wrong offset!");
static_assert(offsetof(UWBP_PalAim_C, TargetScale) == 0x000438, "Member 'UWBP_PalAim_C::TargetScale' has a wrong offset!");
static_assert(offsetof(UWBP_PalAim_C, NowScale) == 0x000440, "Member 'UWBP_PalAim_C::NowScale' has a wrong offset!");
static_assert(offsetof(UWBP_PalAim_C, IsThrowPalMode) == 0x000448, "Member 'UWBP_PalAim_C::IsThrowPalMode' has a wrong offset!");
static_assert(offsetof(UWBP_PalAim_C, CurrentCampLiftingPal) == 0x000450, "Member 'UWBP_PalAim_C::CurrentCampLiftingPal' has a wrong offset!");

}

