#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PalHUD_InGame_GeneralDispatchEventReciever

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Pal_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PalHUD_InGame_GeneralDispatchEventReciever.WBP_PalHUD_InGame_GeneralDispatchEventReciever_C
// 0x0028 (0x0430 - 0x0408)
class UWBP_PalHUD_InGame_GeneralDispatchEventReciever_C final : public UPalUIInGameGeneralDispatchEventReciever
{
public:
	class UWidgetAnimation*                       Default_In;                                        // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  WidgetId_BuildingUI;                               // 0x0410(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  WidgetId_DismantlingUI;                            // 0x0420(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetDisablePlayerInputAction(bool Disable);
	void OpenDismantlingUIFromRadialMenu(const int32 LastSelectedIndex);
	void OpenDismantlingUI_Impl(int32 LastSelectedIndex, bool bFromRadialMenu);
	void OpenDismantlingUI();
	void OpenBuildingUIFromRadialMenu(const class FName BuildObjectId);
	void OpenBuildingUI_Impl(class FName BuildObjectId, bool bFromRadialMenu);
	void OpenBuildingUI(const class FName BuildObjectId);
	void CloseDismantlingUI();
	void CloseBuildingUI();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PalHUD_InGame_GeneralDispatchEventReciever_C">();
	}
	static class UWBP_PalHUD_InGame_GeneralDispatchEventReciever_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PalHUD_InGame_GeneralDispatchEventReciever_C>();
	}
};
static_assert(alignof(UWBP_PalHUD_InGame_GeneralDispatchEventReciever_C) == 0x000008, "Wrong alignment on UWBP_PalHUD_InGame_GeneralDispatchEventReciever_C");
static_assert(sizeof(UWBP_PalHUD_InGame_GeneralDispatchEventReciever_C) == 0x000430, "Wrong size on UWBP_PalHUD_InGame_GeneralDispatchEventReciever_C");
static_assert(offsetof(UWBP_PalHUD_InGame_GeneralDispatchEventReciever_C, Default_In) == 0x000408, "Member 'UWBP_PalHUD_InGame_GeneralDispatchEventReciever_C::Default_In' has a wrong offset!");
static_assert(offsetof(UWBP_PalHUD_InGame_GeneralDispatchEventReciever_C, WidgetId_BuildingUI) == 0x000410, "Member 'UWBP_PalHUD_InGame_GeneralDispatchEventReciever_C::WidgetId_BuildingUI' has a wrong offset!");
static_assert(offsetof(UWBP_PalHUD_InGame_GeneralDispatchEventReciever_C, WidgetId_DismantlingUI) == 0x000420, "Member 'UWBP_PalHUD_InGame_GeneralDispatchEventReciever_C::WidgetId_DismantlingUI' has a wrong offset!");

}

