#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PalHUD_InGame_GeneralDispatchEventReciever

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_PalHUD_InGame_GeneralDispatchEventReciever.WBP_PalHUD_InGame_GeneralDispatchEventReciever_C.SetDisablePlayerInputAction
// 0x0058 (0x0058 - 0x0000)
struct WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_SetDisablePlayerInputAction final
{
public:
	bool                                          Disable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F71[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalShooterComponent*                   Shooter;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   FlagName;                                          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerController*                   CallFunc_GetPalPlayerController_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue_1;                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalCharacterMovementComponent*         CallFunc_GetComponentByClass_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F72[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue_2;                   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalShooterComponent*                   CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_SetDisablePlayerInputAction) == 0x000008, "Wrong alignment on WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_SetDisablePlayerInputAction");
static_assert(sizeof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_SetDisablePlayerInputAction) == 0x000058, "Wrong size on WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_SetDisablePlayerInputAction");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_SetDisablePlayerInputAction, Disable) == 0x000000, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_SetDisablePlayerInputAction::Disable' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_SetDisablePlayerInputAction, Shooter) == 0x000008, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_SetDisablePlayerInputAction::Shooter' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_SetDisablePlayerInputAction, FlagName) == 0x000010, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_SetDisablePlayerInputAction::FlagName' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_SetDisablePlayerInputAction, CallFunc_GetPalmi_ReturnValue) == 0x000018, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_SetDisablePlayerInputAction::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_SetDisablePlayerInputAction, CallFunc_GetPalPlayerController_ReturnValue) == 0x000020, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_SetDisablePlayerInputAction::CallFunc_GetPalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_SetDisablePlayerInputAction, CallFunc_GetPalmi_ReturnValue_1) == 0x000028, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_SetDisablePlayerInputAction::CallFunc_GetPalmi_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_SetDisablePlayerInputAction, CallFunc_GetComponentByClass_ReturnValue) == 0x000030, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_SetDisablePlayerInputAction::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_SetDisablePlayerInputAction, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_SetDisablePlayerInputAction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_SetDisablePlayerInputAction, CallFunc_GetPalmi_ReturnValue_2) == 0x000040, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_SetDisablePlayerInputAction::CallFunc_GetPalmi_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_SetDisablePlayerInputAction, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000048, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_SetDisablePlayerInputAction::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_SetDisablePlayerInputAction, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_SetDisablePlayerInputAction::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_PalHUD_InGame_GeneralDispatchEventReciever.WBP_PalHUD_InGame_GeneralDispatchEventReciever_C.OpenDismantlingUIFromRadialMenu
// 0x0004 (0x0004 - 0x0000)
struct WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUIFromRadialMenu final
{
public:
	int32                                         LastSelectedIndex;                                 // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUIFromRadialMenu) == 0x000004, "Wrong alignment on WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUIFromRadialMenu");
static_assert(sizeof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUIFromRadialMenu) == 0x000004, "Wrong size on WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUIFromRadialMenu");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUIFromRadialMenu, LastSelectedIndex) == 0x000000, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUIFromRadialMenu::LastSelectedIndex' has a wrong offset!");

// Function WBP_PalHUD_InGame_GeneralDispatchEventReciever.WBP_PalHUD_InGame_GeneralDispatchEventReciever_C.OpenDismantlingUI_Impl
// 0x0050 (0x0050 - 0x0000)
struct WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUI_Impl final
{
public:
	int32                                         LastSelectedIndex;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromRadialMenu;                                   // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F73[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F74[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_PalHUD_InGame_InputListener_C*> CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UPalHUDService*                         CallFunc_GetHUDService_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F75[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BuildingUIParameter_C*              CallFunc_SpawnObject_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_Push_ReturnValue;                         // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUI_Impl) == 0x000008, "Wrong alignment on WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUI_Impl");
static_assert(sizeof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUI_Impl) == 0x000050, "Wrong size on WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUI_Impl");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUI_Impl, LastSelectedIndex) == 0x000000, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUI_Impl::LastSelectedIndex' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUI_Impl, bFromRadialMenu) == 0x000004, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUI_Impl::bFromRadialMenu' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUI_Impl, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUI_Impl::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUI_Impl, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUI_Impl::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUI_Impl, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUI_Impl::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUI_Impl, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000018, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUI_Impl::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUI_Impl, CallFunc_GetHUDService_ReturnValue) == 0x000028, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUI_Impl::CallFunc_GetHUDService_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUI_Impl, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUI_Impl::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUI_Impl, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUI_Impl::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUI_Impl, CallFunc_SpawnObject_ReturnValue) == 0x000038, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUI_Impl::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUI_Impl, CallFunc_Push_ReturnValue) == 0x000040, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenDismantlingUI_Impl::CallFunc_Push_ReturnValue' has a wrong offset!");

// Function WBP_PalHUD_InGame_GeneralDispatchEventReciever.WBP_PalHUD_InGame_GeneralDispatchEventReciever_C.OpenBuildingUIFromRadialMenu
// 0x0008 (0x0008 - 0x0000)
struct WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUIFromRadialMenu final
{
public:
	class FName                                   BuildObjectId;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUIFromRadialMenu) == 0x000004, "Wrong alignment on WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUIFromRadialMenu");
static_assert(sizeof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUIFromRadialMenu) == 0x000008, "Wrong size on WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUIFromRadialMenu");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUIFromRadialMenu, BuildObjectId) == 0x000000, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUIFromRadialMenu::BuildObjectId' has a wrong offset!");

// Function WBP_PalHUD_InGame_GeneralDispatchEventReciever.WBP_PalHUD_InGame_GeneralDispatchEventReciever_C.OpenBuildingUI_Impl
// 0x0050 (0x0050 - 0x0000)
struct WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI_Impl final
{
public:
	class FName                                   BuildObjectId;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromRadialMenu;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F76[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_PalHUD_InGame_InputListener_C*> CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UPalHUDService*                         CallFunc_GetHUDService_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F77[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BuildingUIParameter_C*              CallFunc_SpawnObject_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_Push_ReturnValue;                         // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI_Impl) == 0x000008, "Wrong alignment on WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI_Impl");
static_assert(sizeof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI_Impl) == 0x000050, "Wrong size on WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI_Impl");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI_Impl, BuildObjectId) == 0x000000, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI_Impl::BuildObjectId' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI_Impl, bFromRadialMenu) == 0x000008, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI_Impl::bFromRadialMenu' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI_Impl, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI_Impl::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI_Impl, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI_Impl::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI_Impl, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI_Impl::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI_Impl, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000018, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI_Impl::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI_Impl, CallFunc_GetHUDService_ReturnValue) == 0x000028, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI_Impl::CallFunc_GetHUDService_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI_Impl, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI_Impl::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI_Impl, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI_Impl::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI_Impl, CallFunc_SpawnObject_ReturnValue) == 0x000038, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI_Impl::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI_Impl, CallFunc_Push_ReturnValue) == 0x000040, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI_Impl::CallFunc_Push_ReturnValue' has a wrong offset!");

// Function WBP_PalHUD_InGame_GeneralDispatchEventReciever.WBP_PalHUD_InGame_GeneralDispatchEventReciever_C.OpenBuildingUI
// 0x0008 (0x0008 - 0x0000)
struct WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI final
{
public:
	class FName                                   BuildObjectId;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI) == 0x000004, "Wrong alignment on WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI");
static_assert(sizeof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI) == 0x000008, "Wrong size on WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI, BuildObjectId) == 0x000000, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_OpenBuildingUI::BuildObjectId' has a wrong offset!");

// Function WBP_PalHUD_InGame_GeneralDispatchEventReciever.WBP_PalHUD_InGame_GeneralDispatchEventReciever_C.CloseDismantlingUI
// 0x0038 (0x0038 - 0x0000)
struct WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_CloseDismantlingUI final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F78[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_PalHUD_InGame_InputListener_C*> CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_Guid_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F79[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F7A[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDService*                         CallFunc_GetHUDService_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_CloseDismantlingUI) == 0x000008, "Wrong alignment on WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_CloseDismantlingUI");
static_assert(sizeof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_CloseDismantlingUI) == 0x000038, "Wrong size on WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_CloseDismantlingUI");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_CloseDismantlingUI, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_CloseDismantlingUI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_CloseDismantlingUI, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_CloseDismantlingUI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_CloseDismantlingUI, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_CloseDismantlingUI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_CloseDismantlingUI, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000010, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_CloseDismantlingUI::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_CloseDismantlingUI, CallFunc_IsValid_Guid_ReturnValue) == 0x000020, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_CloseDismantlingUI::CallFunc_IsValid_Guid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_CloseDismantlingUI, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_CloseDismantlingUI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_CloseDismantlingUI, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_CloseDismantlingUI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_CloseDismantlingUI, CallFunc_GetHUDService_ReturnValue) == 0x000030, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_CloseDismantlingUI::CallFunc_GetHUDService_ReturnValue' has a wrong offset!");

// Function WBP_PalHUD_InGame_GeneralDispatchEventReciever.WBP_PalHUD_InGame_GeneralDispatchEventReciever_C.CloseBuildingUI
// 0x0030 (0x0030 - 0x0000)
struct WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_CloseBuildingUI final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F7B[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_PalHUD_InGame_InputListener_C*> CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UPalHUDService*                         CallFunc_GetHUDService_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_Guid_ReturnValue;                 // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_CloseBuildingUI) == 0x000008, "Wrong alignment on WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_CloseBuildingUI");
static_assert(sizeof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_CloseBuildingUI) == 0x000030, "Wrong size on WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_CloseBuildingUI");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_CloseBuildingUI, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_CloseBuildingUI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_CloseBuildingUI, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_PalHUD_InGame_GeneralDispatchEventReciever_C_CloseBuildingUI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
