#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PalInteractiveObjectIndicatorCanvas

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Pal_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_PalInteractiveObjectIndicatorCanvas.WBP_PalInteractiveObjectIndicatorCanvas_C.CanDisplayCoop
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop final
{
public:
	bool                                          CanDisplay;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B0C[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalOtomoHolderComponentBase*           CallFunc_GetOtomoHolderComponent_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPalOtomoHolderComponentBase*           CallFunc_GetOtomoHolderComponent_ReturnValue_1;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterHandle*          CallFunc_TryGetSpawnedOtomoHandle_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_TryGetSpawnedOtomo_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterParameter*       CallFunc_TryGetIndividualParameter_ReturnValue;    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B0D[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalOtomoHolderComponentBase*           CallFunc_GetOtomoHolderComponent_ReturnValue_2;    // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_TryGetSpawnedOtomo_ReturnValue_1;         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalPartnerSkillParameterComponent*     CallFunc_GetComponentByClass_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCoolDown_ReturnValue;                   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B0E[0x6];                                     // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalOtomoHolderComponentBase*           CallFunc_GetOtomoHolderComponent_ReturnValue_3;    // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterHandle*          CallFunc_TryGetSpawnedOtomoHandle_ReturnValue_1;   // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B0F[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VSize_ReturnValue;                        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B10[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerController*                   K2Node_DynamicCast_AsPal_Player_Controller;        // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanCooping_ReturnValue;                   // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCooping_ReturnValue;                    // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop) == 0x000008, "Wrong alignment on WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop");
static_assert(sizeof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop) == 0x0000E8, "Wrong size on WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop, CanDisplay) == 0x000000, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop::CanDisplay' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop, CallFunc_GetOtomoHolderComponent_ReturnValue) == 0x000008, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop::CallFunc_GetOtomoHolderComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop, CallFunc_GetOtomoHolderComponent_ReturnValue_1) == 0x000010, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop::CallFunc_GetOtomoHolderComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop, CallFunc_TryGetSpawnedOtomoHandle_ReturnValue) == 0x000018, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop::CallFunc_TryGetSpawnedOtomoHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop, CallFunc_TryGetSpawnedOtomo_ReturnValue) == 0x000020, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop::CallFunc_TryGetSpawnedOtomo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop, CallFunc_TryGetIndividualParameter_ReturnValue) == 0x000028, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop::CallFunc_TryGetIndividualParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop, CallFunc_IsValid_ReturnValue_1) == 0x000031, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop, CallFunc_GetOtomoHolderComponent_ReturnValue_2) == 0x000050, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop::CallFunc_GetOtomoHolderComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop, CallFunc_TryGetSpawnedOtomo_ReturnValue_1) == 0x000058, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop::CallFunc_TryGetSpawnedOtomo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop, CallFunc_GetComponentByClass_ReturnValue) == 0x000060, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop, CallFunc_IsValid_ReturnValue_2) == 0x000068, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop, CallFunc_IsCoolDown_ReturnValue) == 0x000069, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop::CallFunc_IsCoolDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop, CallFunc_GetPalmi_ReturnValue) == 0x000070, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop, CallFunc_GetOtomoHolderComponent_ReturnValue_3) == 0x000078, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop::CallFunc_GetOtomoHolderComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000080, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop, CallFunc_TryGetSpawnedOtomoHandle_ReturnValue_1) == 0x000098, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop::CallFunc_TryGetSpawnedOtomoHandle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000A0, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop, CallFunc_IsValid_ReturnValue_3) == 0x0000B8, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop, CallFunc_VSize_ReturnValue) == 0x0000C0, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0000C8, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop, CallFunc_GetLocalPlayerController_ReturnValue) == 0x0000D0, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop, K2Node_DynamicCast_AsPal_Player_Controller) == 0x0000D8, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop::K2Node_DynamicCast_AsPal_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop, CallFunc_CanCooping_ReturnValue) == 0x0000E1, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop::CallFunc_CanCooping_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop, CallFunc_IsCooping_ReturnValue) == 0x0000E2, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop::CallFunc_IsCooping_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop, CallFunc_Not_PreBool_ReturnValue) == 0x0000E3, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop, CallFunc_BooleanAND_ReturnValue) == 0x0000E4, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CanDisplayCoop::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_PalInteractiveObjectIndicatorCanvas.WBP_PalInteractiveObjectIndicatorCanvas_C.CREATEDELEGATE_PROXYFUNCTION_0
// 0x02C0 (0x02C0 - 0x0000)
struct WBP_PalInteractiveObjectIndicatorCanvas_C_CREATEDELEGATE_PROXYFUNCTION_0 final
{
public:
	struct FPalKeyConfigSettings                  PrevSettings;                                      // 0x0000(0x0160)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FPalKeyConfigSettings                  NewSettings;                                       // 0x0160(0x0160)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_PalInteractiveObjectIndicatorCanvas_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000008, "Wrong alignment on WBP_PalInteractiveObjectIndicatorCanvas_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(sizeof(WBP_PalInteractiveObjectIndicatorCanvas_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x0002C0, "Wrong size on WBP_PalInteractiveObjectIndicatorCanvas_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CREATEDELEGATE_PROXYFUNCTION_0, PrevSettings) == 0x000000, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CREATEDELEGATE_PROXYFUNCTION_0::PrevSettings' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CREATEDELEGATE_PROXYFUNCTION_0, NewSettings) == 0x000160, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CREATEDELEGATE_PROXYFUNCTION_0::NewSettings' has a wrong offset!");

// Function WBP_PalInteractiveObjectIndicatorCanvas.WBP_PalInteractiveObjectIndicatorCanvas_C.CreateIndicatorUI
// 0x0040 (0x0040 - 0x0000)
struct WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B11[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B12[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B13[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PalInteractiveObjectIndicatorUI_C* CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI) == 0x000008, "Wrong alignment on WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI");
static_assert(sizeof(WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI) == 0x000040, "Wrong size on WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI, Temp_int_Variable) == 0x000000, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI, Temp_int_Variable_1) == 0x000004, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI, CallFunc_Conv_IntToByte_ReturnValue) == 0x000008, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI, CallFunc_GetValidValue_ReturnValue) == 0x000010, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000011, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000012, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000013, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000014, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI, CallFunc_MakeLiteralInt_ReturnValue) == 0x000018, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI, CallFunc_Create_ReturnValue) == 0x000030, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI, CallFunc_AddChild_ReturnValue) == 0x000038, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_CreateIndicatorUI::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function WBP_PalInteractiveObjectIndicatorCanvas.WBP_PalInteractiveObjectIndicatorCanvas_C.ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FPalKeyConfigSettings& PrevSettings, struct FPalKeyConfigSettings& NewSettings)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bIsFocused)>              K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B14[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0028(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B15[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPalInteractiveObjectComponentInterface> K2Node_CustomEvent_InteractiveObject;              // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UPalGameSetting*                        CallFunc_GetGameSetting_ReturnValue;               // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPalInteractiveObjectActionInfoData    K2Node_MakeStruct_PalInteractiveObjectActionInfoData; // 0x0094(0x000C)(NoDestructor)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B16[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDService*                         CallFunc_GetHUDService_ReturnValue;                // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsFocused;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B17[0x6];                                     // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EPalInteractiveObjectActionType>       CallFunc_Map_Keys_Keys;                            // 0x00C0(0x0010)(ReferenceParm)
	EPalInteractiveObjectActionType               CallFunc_Array_Get_Item;                           // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B18[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_PalInteractiveObjectIndicatorUI_C* CallFunc_Map_Find_Value;                           // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B19[0x6];                                     // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalOptionSubsystem*                    CallFunc_GetOptionSubsystem_ReturnValue;           // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_otomoInteractDistance_ImplicitCast; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas) == 0x000008, "Wrong alignment on WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas");
static_assert(sizeof(WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas) == 0x0000F8, "Wrong size on WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas, EntryPoint) == 0x000000, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas, K2Node_Event_MyGeometry) == 0x000028, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas, K2Node_Event_InDeltaTime) == 0x000068, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas, K2Node_CustomEvent_InteractiveObject) == 0x000070, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas::K2Node_CustomEvent_InteractiveObject' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas, CallFunc_GetGameSetting_ReturnValue) == 0x000080, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas::CallFunc_GetGameSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas, Temp_int_Loop_Counter_Variable) == 0x000088, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas, CallFunc_Add_IntInt_ReturnValue) == 0x00008C, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas, Temp_int_Array_Index_Variable) == 0x000090, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas, K2Node_MakeStruct_PalInteractiveObjectActionInfoData) == 0x000094, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas::K2Node_MakeStruct_PalInteractiveObjectActionInfoData' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x0000A0, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas, CallFunc_GetHUDService_ReturnValue) == 0x0000B0, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas::CallFunc_GetHUDService_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas, K2Node_CustomEvent_bIsFocused) == 0x0000B8, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas::K2Node_CustomEvent_bIsFocused' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas, CallFunc_IsValid_ReturnValue_1) == 0x0000B9, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas, CallFunc_Map_Keys_Keys) == 0x0000C0, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas, CallFunc_Array_Get_Item) == 0x0000D0, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas, CallFunc_Array_Length_ReturnValue) == 0x0000D4, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas, CallFunc_Map_Find_Value) == 0x0000D8, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas, CallFunc_Map_Find_ReturnValue) == 0x0000E0, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas, CallFunc_Less_IntInt_ReturnValue) == 0x0000E1, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas, CallFunc_GetOptionSubsystem_ReturnValue) == 0x0000E8, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas::CallFunc_GetOptionSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas, K2Node_VariableSet_otomoInteractDistance_ImplicitCast) == 0x0000F0, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_ExecuteUbergraph_WBP_PalInteractiveObjectIndicatorCanvas::K2Node_VariableSet_otomoInteractDistance_ImplicitCast' has a wrong offset!");

// Function WBP_PalInteractiveObjectIndicatorCanvas.WBP_PalInteractiveObjectIndicatorCanvas_C.GetIndicatorText
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText final
{
public:
	TScriptInterface<class IPalInteractiveObjectComponentInterface> InteractiveObject;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalInteractiveObjectIndicatorType            IndicatorType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalInteractiveObjectButtonType               buttonType;                                        // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanToggle;                                         // 0x0012(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1A[0x5];                                     // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   NewParam;                                          // 0x0018(0x0018)(Parm, OutParm)
	bool                                          CallFunc_IsToggleInteract_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1B[0x5];                                     // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetIndicatorText_ReturnValue;             // 0x0038(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizedText_ReturnValue;             // 0x0060(0x0018)()
	class FText                                   CallFunc_GetIndicatorText_ReturnValue_1;           // 0x0078(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B0(0x0018)()
};
static_assert(alignof(WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText) == 0x000008, "Wrong alignment on WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText");
static_assert(sizeof(WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText) == 0x0000C8, "Wrong size on WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText, InteractiveObject) == 0x000000, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText::InteractiveObject' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText, IndicatorType) == 0x000010, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText::IndicatorType' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText, buttonType) == 0x000011, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText::buttonType' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText, CanToggle) == 0x000012, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText::CanToggle' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText, NewParam) == 0x000018, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText::NewParam' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText, CallFunc_IsToggleInteract_ReturnValue) == 0x000030, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText::CallFunc_IsToggleInteract_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText, K2Node_SwitchEnum_CmpSuccess) == 0x000031, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText, CallFunc_BooleanAND_ReturnValue) == 0x000032, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText, CallFunc_GetIndicatorText_ReturnValue) == 0x000038, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText::CallFunc_GetIndicatorText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText, CallFunc_Conv_TextToString_ReturnValue) == 0x000050, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText, CallFunc_GetLocalizedText_ReturnValue) == 0x000060, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText::CallFunc_GetLocalizedText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText, CallFunc_GetIndicatorText_ReturnValue_1) == 0x000078, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText::CallFunc_GetIndicatorText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000090, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText, CallFunc_Replace_ReturnValue) == 0x0000A0, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText, CallFunc_Conv_StringToText_ReturnValue) == 0x0000B0, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_GetIndicatorText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_PalInteractiveObjectIndicatorCanvas.WBP_PalInteractiveObjectIndicatorCanvas_C.HideIndicators
// 0x0030 (0x0030 - 0x0000)
struct WBP_PalInteractiveObjectIndicatorCanvas_C_HideIndicators final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1C[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1D[0x1];                                     // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1E[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PalInteractiveObjectIndicatorUI_C* CallFunc_Map_Find_Value;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalInteractiveObjectIndicatorCanvas_C_HideIndicators) == 0x000008, "Wrong alignment on WBP_PalInteractiveObjectIndicatorCanvas_C_HideIndicators");
static_assert(sizeof(WBP_PalInteractiveObjectIndicatorCanvas_C_HideIndicators) == 0x000030, "Wrong size on WBP_PalInteractiveObjectIndicatorCanvas_C_HideIndicators");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_HideIndicators, Temp_int_Variable) == 0x000000, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_HideIndicators::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_HideIndicators, Temp_int_Variable_1) == 0x000004, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_HideIndicators::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_HideIndicators, CallFunc_Conv_IntToByte_ReturnValue) == 0x000008, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_HideIndicators::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_HideIndicators, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_HideIndicators::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_HideIndicators, CallFunc_GetValidValue_ReturnValue) == 0x000010, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_HideIndicators::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_HideIndicators, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000011, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_HideIndicators::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_HideIndicators, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000012, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_HideIndicators::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_HideIndicators, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000014, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_HideIndicators::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_HideIndicators, CallFunc_MakeLiteralInt_ReturnValue) == 0x000018, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_HideIndicators::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_HideIndicators, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_HideIndicators::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_HideIndicators, CallFunc_Map_Find_Value) == 0x000020, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_HideIndicators::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_HideIndicators, CallFunc_Map_Find_ReturnValue) == 0x000028, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_HideIndicators::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_PalInteractiveObjectIndicatorCanvas.WBP_PalInteractiveObjectIndicatorCanvas_C.OnApplicationActivationStateChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_PalInteractiveObjectIndicatorCanvas_C_OnApplicationActivationStateChanged final
{
public:
	bool                                          bIsFocused;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalInteractiveObjectIndicatorCanvas_C_OnApplicationActivationStateChanged) == 0x000001, "Wrong alignment on WBP_PalInteractiveObjectIndicatorCanvas_C_OnApplicationActivationStateChanged");
static_assert(sizeof(WBP_PalInteractiveObjectIndicatorCanvas_C_OnApplicationActivationStateChanged) == 0x000001, "Wrong size on WBP_PalInteractiveObjectIndicatorCanvas_C_OnApplicationActivationStateChanged");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_OnApplicationActivationStateChanged, bIsFocused) == 0x000000, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_OnApplicationActivationStateChanged::bIsFocused' has a wrong offset!");

// Function WBP_PalInteractiveObjectIndicatorCanvas.WBP_PalInteractiveObjectIndicatorCanvas_C.OnKeyConfigChanged
// 0x02C0 (0x02C0 - 0x0000)
struct WBP_PalInteractiveObjectIndicatorCanvas_C_OnKeyConfigChanged final
{
public:
	struct FPalKeyConfigSettings                  PreSetting;                                        // 0x0000(0x0160)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FPalKeyConfigSettings                  NewSetting;                                        // 0x0160(0x0160)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_PalInteractiveObjectIndicatorCanvas_C_OnKeyConfigChanged) == 0x000008, "Wrong alignment on WBP_PalInteractiveObjectIndicatorCanvas_C_OnKeyConfigChanged");
static_assert(sizeof(WBP_PalInteractiveObjectIndicatorCanvas_C_OnKeyConfigChanged) == 0x0002C0, "Wrong size on WBP_PalInteractiveObjectIndicatorCanvas_C_OnKeyConfigChanged");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_OnKeyConfigChanged, PreSetting) == 0x000000, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_OnKeyConfigChanged::PreSetting' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_OnKeyConfigChanged, NewSetting) == 0x000160, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_OnKeyConfigChanged::NewSetting' has a wrong offset!");

// Function WBP_PalInteractiveObjectIndicatorCanvas.WBP_PalInteractiveObjectIndicatorCanvas_C.OnRide
// 0x0020 (0x0020 - 0x0000)
struct WBP_PalInteractiveObjectIndicatorCanvas_C_OnRide final
{
public:
	class AActor*                                 RideActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TScriptInterface<class IPalInteractiveObjectComponentInterface> InteractiveObject)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalInteractComponent*                  CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalInteractiveObjectIndicatorCanvas_C_OnRide) == 0x000008, "Wrong alignment on WBP_PalInteractiveObjectIndicatorCanvas_C_OnRide");
static_assert(sizeof(WBP_PalInteractiveObjectIndicatorCanvas_C_OnRide) == 0x000020, "Wrong size on WBP_PalInteractiveObjectIndicatorCanvas_C_OnRide");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_OnRide, RideActor) == 0x000000, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_OnRide::RideActor' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_OnRide, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_OnRide::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_OnRide, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_OnRide::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function WBP_PalInteractiveObjectIndicatorCanvas.WBP_PalInteractiveObjectIndicatorCanvas_C.OnUpdateTargetInteractiveObject
// 0x0010 (0x0010 - 0x0000)
struct WBP_PalInteractiveObjectIndicatorCanvas_C_OnUpdateTargetInteractiveObject final
{
public:
	TScriptInterface<class IPalInteractiveObjectComponentInterface> InteractiveObject;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalInteractiveObjectIndicatorCanvas_C_OnUpdateTargetInteractiveObject) == 0x000008, "Wrong alignment on WBP_PalInteractiveObjectIndicatorCanvas_C_OnUpdateTargetInteractiveObject");
static_assert(sizeof(WBP_PalInteractiveObjectIndicatorCanvas_C_OnUpdateTargetInteractiveObject) == 0x000010, "Wrong size on WBP_PalInteractiveObjectIndicatorCanvas_C_OnUpdateTargetInteractiveObject");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_OnUpdateTargetInteractiveObject, InteractiveObject) == 0x000000, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_OnUpdateTargetInteractiveObject::InteractiveObject' has a wrong offset!");

// Function WBP_PalInteractiveObjectIndicatorCanvas.WBP_PalInteractiveObjectIndicatorCanvas_C.SetupAfterCreatePlayer
// 0x0028 (0x0028 - 0x0000)
struct WBP_PalInteractiveObjectIndicatorCanvas_C_SetupAfterCreatePlayer final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalOtomoHolderComponentBase*           CallFunc_GetOtomoHolderComponent_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_OtomoPalHolderComponent_C*          K2Node_DynamicCast_AsBP_Otomo_Pal_Holder_Component; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalInteractiveObjectIndicatorCanvas_C_SetupAfterCreatePlayer) == 0x000008, "Wrong alignment on WBP_PalInteractiveObjectIndicatorCanvas_C_SetupAfterCreatePlayer");
static_assert(sizeof(WBP_PalInteractiveObjectIndicatorCanvas_C_SetupAfterCreatePlayer) == 0x000028, "Wrong size on WBP_PalInteractiveObjectIndicatorCanvas_C_SetupAfterCreatePlayer");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_SetupAfterCreatePlayer, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_SetupAfterCreatePlayer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_SetupAfterCreatePlayer, CallFunc_GetOtomoHolderComponent_ReturnValue) == 0x000010, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_SetupAfterCreatePlayer::CallFunc_GetOtomoHolderComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_SetupAfterCreatePlayer, K2Node_DynamicCast_AsBP_Otomo_Pal_Holder_Component) == 0x000018, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_SetupAfterCreatePlayer::K2Node_DynamicCast_AsBP_Otomo_Pal_Holder_Component' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_SetupAfterCreatePlayer, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_SetupAfterCreatePlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PalInteractiveObjectIndicatorCanvas_C_SetupAfterCreatePlayer, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'WBP_PalInteractiveObjectIndicatorCanvas_C_SetupAfterCreatePlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_PalInteractiveObjectIndicatorCanvas.WBP_PalInteractiveObjectIndicatorCanvas_C.SetupEvent
// 0x0038 (0x0038 - 0x0000)
struct WBP_PalInteractiveObjectIndicatorCanvas_C_SetupEvent final
{
public:
	TDelegate<void(class AActor* RideActor)>      K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
