#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PalWorkPowerPlant

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "Pal_structs.hpp"


namespace SDK::Params
{

// Function WBP_PalWorkPowerPlant.WBP_PalWorkPowerPlant_C.ExecuteUbergraph_WBP_PalWorkPowerPlant
// 0x01A8 (0x01A8 - 0x0000)
struct WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2543[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2544[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalMapObjectWorkeeModule*              CallFunc_GetWorkeeModule_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalWorkBase*                           CallFunc_GetWork_ReturnValue;                      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2545[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PalCraftInfo_Pal_C*                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2546[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2547[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2548[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalGameSetting*                        CallFunc_GetGameSetting_ReturnValue;               // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_2;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2549[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDDispatchParameterBase*           CallFunc_GetParam_ReturnValue;                     // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalUIMapObjectStatusIndicatorParameterBase* K2Node_DynamicCast_AsPal_UIMap_Object_Status_Indicator_Parameter_Base; // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254A[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalMapObjectConcreteModelBase*         CallFunc_GetConcreteModel_ReturnValue;             // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalMapObjectGenerateEnergyModel*       K2Node_DynamicCast_AsPal_Map_Object_Generate_Energy_Model; // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254B[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_PalCraftInfo_Pal_C*>        K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void(class UPalWorkBase* Work)>     K2Node_CreateDelegate_OutputDelegate_1;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetMapObjectLocation_outVector;           // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPalMapObjectGenerateEnergyModel* Model)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254C[0x6];                                     // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_PalWorkPowerPlant_Gauge_C*> K2Node_MakeArray_Array_1;                          // 0x0138(0x0010)(ReferenceParm, ContainsInstancedReference)
	EPalWorkSuitability                           CallFunc_GetWorkSuitability_ReturnValue;           // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_3;                              // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254D[0x2];                                     // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x014C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254E[0x4];                                     // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0160(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254F[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PalWorkPowerPlant_Gauge_C*         CallFunc_Array_Get_Item_1;                         // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x017D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x017E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x017F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default_1;                           // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2550[0x6];                                     // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_StartAtTime_ImplicitCast;   // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2551[0x4];                                     // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant) == 0x000008, "Wrong alignment on WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant");
static_assert(sizeof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant) == 0x0001A8, "Wrong size on WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, EntryPoint) == 0x000000, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, Temp_bool_Variable) == 0x000004, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, Temp_byte_Variable) == 0x000005, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_GetWorkeeModule_ReturnValue) == 0x000010, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_GetWorkeeModule_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_GetWork_ReturnValue) == 0x000018, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_GetWork_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, Temp_int_Array_Index_Variable_1) == 0x000028, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, Temp_int_Loop_Counter_Variable_1) == 0x00002C, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000058, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_GetEndTime_ReturnValue) == 0x000060, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000068, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_PlayAnimation_ReturnValue) == 0x000070, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_GetPalmi_ReturnValue) == 0x000078, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000088, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_GetGameSetting_ReturnValue) == 0x0000A0, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_GetGameSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, Temp_byte_Variable_2) == 0x0000A8, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_GetParam_ReturnValue) == 0x0000B0, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, K2Node_DynamicCast_AsPal_UIMap_Object_Status_Indicator_Parameter_Base) == 0x0000B8, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::K2Node_DynamicCast_AsPal_UIMap_Object_Status_Indicator_Parameter_Base' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_GetConcreteModel_ReturnValue) == 0x0000C8, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_GetConcreteModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, K2Node_DynamicCast_AsPal_Map_Object_Generate_Energy_Model) == 0x0000D0, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::K2Node_DynamicCast_AsPal_Map_Object_Generate_Energy_Model' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, K2Node_DynamicCast_bSuccess_1) == 0x0000D8, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, K2Node_MakeArray_Array) == 0x0000E0, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000F0, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_GetMapObjectLocation_outVector) == 0x000100, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_GetMapObjectLocation_outVector' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_Vector_Distance_ReturnValue) == 0x000118, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, K2Node_CreateDelegate_OutputDelegate_2) == 0x000120, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000130, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000131, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, K2Node_MakeArray_Array_1) == 0x000138, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_GetWorkSuitability_ReturnValue) == 0x000148, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_GetWorkSuitability_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, Temp_byte_Variable_3) == 0x000149, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, K2Node_CreateDelegate_OutputDelegate_3) == 0x00014C, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000160, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000168, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_Array_Get_Item_1) == 0x000170, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_Array_Length_ReturnValue_1) == 0x000178, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x00017C, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_Less_IntInt_ReturnValue_1) == 0x00017D, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, K2Node_Select_Default) == 0x00017E, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00017F, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, Temp_bool_Variable_1) == 0x000180, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, K2Node_Select_Default_1) == 0x000181, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_PlayAnimation_ReturnValue_1) == 0x000188, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000190, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_PlayAnimation_StartAtTime_ImplicitCast) == 0x000198, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_PlayAnimation_StartAtTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x0001A0, "Member 'WBP_PalWorkPowerPlant_C_ExecuteUbergraph_WBP_PalWorkPowerPlant::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function WBP_PalWorkPowerPlant.WBP_PalWorkPowerPlant_C.On Updated Worker Pal
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal final
{
public:
	class UPalWorkBase*                           Work;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          HasAssign;                                         // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2552[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPalIndividualCharacterSlot*>    CallFunc_GetAssignedCharacters_IndividualSlots;    // 0x0010(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterSlot*            CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterHandle*          CallFunc_GetHandle_ReturnValue;                    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2553[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_TryGetIndividualActor_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2554[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalCharacterParameterComponent*        CallFunc_GetCharacterParameterComponent_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2555[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalWorkAssign*                         CallFunc_GetWorkAssign_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFixed_ReturnValue;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2556[0x2];                                     // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_GetWorkId_ReturnValue;                    // 0x0074(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAssignedToAnyWork_ReturnValue;          // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2557[0x2];                                     // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PalCraftInfo_Pal_C*                CallFunc_Array_Get_Item_1;                         // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2558[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_GetWorkId_ReturnValue_1;                  // 0x0098(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GuidGuid_ReturnValue;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal) == 0x000008, "Wrong alignment on WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal");
static_assert(sizeof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal) == 0x0000B0, "Wrong size on WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal, Work) == 0x000000, "Member 'WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal::Work' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal, HasAssign) == 0x000008, "Member 'WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal::HasAssign' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal, Temp_bool_Variable) == 0x000009, "Member 'WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal, CallFunc_GetAssignedCharacters_IndividualSlots) == 0x000010, "Member 'WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal::CallFunc_GetAssignedCharacters_IndividualSlots' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal, CallFunc_GetHandle_ReturnValue) == 0x000038, "Member 'WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal::CallFunc_GetHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal, CallFunc_TryGetIndividualActor_ReturnValue) == 0x000048, "Member 'WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal::CallFunc_TryGetIndividualActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal, CallFunc_GetCharacterParameterComponent_ReturnValue) == 0x000058, "Member 'WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal::CallFunc_GetCharacterParameterComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal, CallFunc_IsValid_ReturnValue_2) == 0x000060, "Member 'WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal, CallFunc_GetWorkAssign_ReturnValue) == 0x000068, "Member 'WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal::CallFunc_GetWorkAssign_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal, CallFunc_IsValid_ReturnValue_3) == 0x000070, "Member 'WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal, CallFunc_IsFixed_ReturnValue) == 0x000071, "Member 'WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal::CallFunc_IsFixed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal, CallFunc_GetWorkId_ReturnValue) == 0x000074, "Member 'WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal::CallFunc_GetWorkId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal, CallFunc_IsAssignedToAnyWork_ReturnValue) == 0x000084, "Member 'WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal::CallFunc_IsAssignedToAnyWork_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal, Temp_byte_Variable) == 0x000085, "Member 'WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal, CallFunc_Array_Get_Item_1) == 0x000088, "Member 'WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal, CallFunc_Array_Length_ReturnValue_1) == 0x000090, "Member 'WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal, CallFunc_Less_IntInt_ReturnValue_1) == 0x000094, "Member 'WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal, CallFunc_GetWorkId_ReturnValue_1) == 0x000098, "Member 'WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal::CallFunc_GetWorkId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal, CallFunc_EqualEqual_GuidGuid_ReturnValue) == 0x0000A8, "Member 'WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal::CallFunc_EqualEqual_GuidGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal, Temp_byte_Variable_1) == 0x0000A9, "Member 'WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal, CallFunc_BooleanAND_ReturnValue) == 0x0000AA, "Member 'WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal, K2Node_Select_Default) == 0x0000AB, "Member 'WBP_PalWorkPowerPlant_C_On_Updated_Worker_Pal::K2Node_Select_Default' has a wrong offset!");

// Function WBP_PalWorkPowerPlant.WBP_PalWorkPowerPlant_C.OnUpdateEnergyStack
// 0x0090 (0x0090 - 0x0000)
struct WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack final
{
public:
	class UPalMapObjectGenerateEnergyModel*       Param_Model;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxEnergyStorage_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStoredEnergyAmount_ReturnValue;        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2559[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_255A[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_PalWorkPowerPlant_Gauge_C*         CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_255B[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_255C[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0058(0x0018)()
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_255D[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack) == 0x000008, "Wrong alignment on WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack");
static_assert(sizeof(WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack) == 0x000090, "Wrong size on WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack, Param_Model) == 0x000000, "Member 'WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack::Param_Model' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack, CallFunc_GetMaxEnergyStorage_ReturnValue) == 0x000008, "Member 'WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack::CallFunc_GetMaxEnergyStorage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack, CallFunc_GetStoredEnergyAmount_ReturnValue) == 0x00000C, "Member 'WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack::CallFunc_GetStoredEnergyAmount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000025, "Member 'WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000038, "Member 'WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack, CallFunc_Array_Length_ReturnValue_1) == 0x000040, "Member 'WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack, CallFunc_Less_IntInt_ReturnValue_1) == 0x000044, "Member 'WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000048, "Member 'WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack, CallFunc_FTrunc_ReturnValue) == 0x000050, "Member 'WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack, CallFunc_Conv_IntToText_ReturnValue) == 0x000058, "Member 'WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000070, "Member 'WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack, CallFunc_FFloor_ReturnValue) == 0x000078, "Member 'WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00007C, "Member 'WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000080, "Member 'WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000088, "Member 'WBP_PalWorkPowerPlant_C_OnUpdateEnergyStack::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_PalWorkPowerPlant.WBP_PalWorkPowerPlant_C.SetArrow
// 0x0028 (0x0028 - 0x0000)
struct WBP_PalWorkPowerPlant_C_SetArrow final
{
public:
	bool                                          IsIncrease;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_255E[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_255F[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderTransformAngle_Angle_ImplicitCast; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalWorkPowerPlant_C_SetArrow) == 0x000008, "Wrong alignment on WBP_PalWorkPowerPlant_C_SetArrow");
static_assert(sizeof(WBP_PalWorkPowerPlant_C_SetArrow) == 0x000028, "Wrong size on WBP_PalWorkPowerPlant_C_SetArrow");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_SetArrow, IsIncrease) == 0x000000, "Member 'WBP_PalWorkPowerPlant_C_SetArrow::IsIncrease' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_SetArrow, CallFunc_SelectColor_ReturnValue) == 0x000004, "Member 'WBP_PalWorkPowerPlant_C_SetArrow::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWorkPowerPlant_C_SetArrow, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'WBP_PalWorkPowerPlant_C_SetArrow::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
