#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IngameMenuConstruction_info

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_IngameMenuConstruction_info.WBP_IngameMenuConstruction_info_C
// 0x0090 (0x0308 - 0x0278)
class UWBP_IngameMenuConstruction_info_C final : public UUserWidget
{
public:
	class UBP_PalTextBlock_C*                     BP_PalTextBlock_C;                                 // 0x0278(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dot_0;                                             // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dot_1;                                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dot_4;                                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dot_5;                                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_28;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_278;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalRichTextBlock_C*                 RichText_BuildObjectDesc;                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_ManMonth_Value;                               // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenuConstruction_InfoItem_C* WBP_IngameMenuConstruction_InfoItem;               // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenuConstruction_InfoItem_C* WBP_IngameMenuConstruction_InfoItem_1;             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenuConstruction_InfoItem_C* WBP_IngameMenuConstruction_InfoItem_2;             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenuConstruction_InfoItem_C* WBP_IngameMenuConstruction_InfoItem_3;             // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Set_Build_Object_Data(const struct FPalBuildObjectData& BuildObjectData);
	void SetMaterialInfo(class UWBP_IngameMenuConstruction_InfoItem_C* Widget, class FName ID, int32 NeedNum);

	void Get_Useable_Material_Item_Num(class FName ItemId, int32* Num) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_IngameMenuConstruction_info_C">();
	}
	static class UWBP_IngameMenuConstruction_info_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_IngameMenuConstruction_info_C>();
	}
};
static_assert(alignof(UWBP_IngameMenuConstruction_info_C) == 0x000008, "Wrong alignment on UWBP_IngameMenuConstruction_info_C");
static_assert(sizeof(UWBP_IngameMenuConstruction_info_C) == 0x000308, "Wrong size on UWBP_IngameMenuConstruction_info_C");
static_assert(offsetof(UWBP_IngameMenuConstruction_info_C, BP_PalTextBlock_C) == 0x000278, "Member 'UWBP_IngameMenuConstruction_info_C::BP_PalTextBlock_C' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_info_C, Dot_0) == 0x000280, "Member 'UWBP_IngameMenuConstruction_info_C::Dot_0' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_info_C, Dot_1) == 0x000288, "Member 'UWBP_IngameMenuConstruction_info_C::Dot_1' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_info_C, Dot_4) == 0x000290, "Member 'UWBP_IngameMenuConstruction_info_C::Dot_4' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_info_C, Dot_5) == 0x000298, "Member 'UWBP_IngameMenuConstruction_info_C::Dot_5' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_info_C, Image) == 0x0002A0, "Member 'UWBP_IngameMenuConstruction_info_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_info_C, Image_1) == 0x0002A8, "Member 'UWBP_IngameMenuConstruction_info_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_info_C, Image_2) == 0x0002B0, "Member 'UWBP_IngameMenuConstruction_info_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_info_C, Image_3) == 0x0002B8, "Member 'UWBP_IngameMenuConstruction_info_C::Image_3' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_info_C, Image_4) == 0x0002C0, "Member 'UWBP_IngameMenuConstruction_info_C::Image_4' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_info_C, Image_28) == 0x0002C8, "Member 'UWBP_IngameMenuConstruction_info_C::Image_28' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_info_C, Image_278) == 0x0002D0, "Member 'UWBP_IngameMenuConstruction_info_C::Image_278' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_info_C, RichText_BuildObjectDesc) == 0x0002D8, "Member 'UWBP_IngameMenuConstruction_info_C::RichText_BuildObjectDesc' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_info_C, Text_ManMonth_Value) == 0x0002E0, "Member 'UWBP_IngameMenuConstruction_info_C::Text_ManMonth_Value' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_info_C, WBP_IngameMenuConstruction_InfoItem) == 0x0002E8, "Member 'UWBP_IngameMenuConstruction_info_C::WBP_IngameMenuConstruction_InfoItem' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_info_C, WBP_IngameMenuConstruction_InfoItem_1) == 0x0002F0, "Member 'UWBP_IngameMenuConstruction_info_C::WBP_IngameMenuConstruction_InfoItem_1' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_info_C, WBP_IngameMenuConstruction_InfoItem_2) == 0x0002F8, "Member 'UWBP_IngameMenuConstruction_info_C::WBP_IngameMenuConstruction_InfoItem_2' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_info_C, WBP_IngameMenuConstruction_InfoItem_3) == 0x000300, "Member 'UWBP_IngameMenuConstruction_info_C::WBP_IngameMenuConstruction_InfoItem_3' has a wrong offset!");

}

