#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CommonCircularGauge

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Pal_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CommonCircularGauge.WBP_CommonCircularGauge_C
// 0x0020 (0x0298 - 0x0278)
class UWBP_CommonCircularGauge_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_81;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FPalGaugeInterpolationCalculator       GaugeInterpolationCalculator;                      // 0x0288(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void Construct();
	void ExecuteUbergraph_WBP_CommonCircularGauge(int32 EntryPoint);
	void ReflectRateToImage();
	void SetTargetValue(double Value);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CommonCircularGauge_C">();
	}
	static class UWBP_CommonCircularGauge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CommonCircularGauge_C>();
	}
};
static_assert(alignof(UWBP_CommonCircularGauge_C) == 0x000008, "Wrong alignment on UWBP_CommonCircularGauge_C");
static_assert(sizeof(UWBP_CommonCircularGauge_C) == 0x000298, "Wrong size on UWBP_CommonCircularGauge_C");
static_assert(offsetof(UWBP_CommonCircularGauge_C, UberGraphFrame) == 0x000278, "Member 'UWBP_CommonCircularGauge_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CommonCircularGauge_C, Image_81) == 0x000280, "Member 'UWBP_CommonCircularGauge_C::Image_81' has a wrong offset!");
static_assert(offsetof(UWBP_CommonCircularGauge_C, GaugeInterpolationCalculator) == 0x000288, "Member 'UWBP_CommonCircularGauge_C::GaugeInterpolationCalculator' has a wrong offset!");

}

