#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenu

#include "Basic.hpp"

#include "EPalUIInGameMainMenuTabType_structs.hpp"


namespace SDK::Params
{

// Function WBP_MainMenu.WBP_MainMenu_C.Anm_Focus
// 0x0001 (0x0001 - 0x0000)
struct WBP_MainMenu_C_Anm_Focus final
{
public:
	EPalUIInGameMainMenuTabType                   Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_C_Anm_Focus) == 0x000001, "Wrong alignment on WBP_MainMenu_C_Anm_Focus");
static_assert(sizeof(WBP_MainMenu_C_Anm_Focus) == 0x000001, "Wrong size on WBP_MainMenu_C_Anm_Focus");
static_assert(offsetof(WBP_MainMenu_C_Anm_Focus, Type) == 0x000000, "Member 'WBP_MainMenu_C_Anm_Focus::Type' has a wrong offset!");

// Function WBP_MainMenu.WBP_MainMenu_C.Anm_FocusToNormal
// 0x0001 (0x0001 - 0x0000)
struct WBP_MainMenu_C_Anm_FocusToNormal final
{
public:
	EPalUIInGameMainMenuTabType                   Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_C_Anm_FocusToNormal) == 0x000001, "Wrong alignment on WBP_MainMenu_C_Anm_FocusToNormal");
static_assert(sizeof(WBP_MainMenu_C_Anm_FocusToNormal) == 0x000001, "Wrong size on WBP_MainMenu_C_Anm_FocusToNormal");
static_assert(offsetof(WBP_MainMenu_C_Anm_FocusToNormal, Type) == 0x000000, "Member 'WBP_MainMenu_C_Anm_FocusToNormal::Type' has a wrong offset!");

// Function WBP_MainMenu.WBP_MainMenu_C.ExecuteUbergraph_WBP_MainMenu
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalUIInGameMainMenuTabType                   K2Node_CustomEvent_type_1;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalUIInGameMainMenuTabType                   K2Node_CustomEvent_type;                           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_591B[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MainMenu_Tab_C*                    CallFunc_Map_Find_Value;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_591C[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MainMenu_Tab_C*                    CallFunc_Map_Find_Value_1;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_591D[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<EPalUIInGameMainMenuTabType>           CallFunc_Map_Keys_Keys;                            // 0x0040(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_591E[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 OldIndex, int32 NewIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 OldIndex, int32 NewIndex)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 OldIndex, int32 NewIndex, class UWidget* FocusTargetWidget)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPanelChildren_IsValidPanel;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_591F[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetPanelChildren_Children;                // 0x0098(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5920[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MainMenu_Tab_C*                    K2Node_DynamicCast_AsWBP_Main_Menu_Tab;            // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5921[0x2];                                     // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_MainMenu_Tab_C* SelfWidget)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPalUIInGameMainMenuTabType                   CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5922[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MainMenu_Tab_C*                    CallFunc_Map_Find_Value_2;                         // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu) == 0x000008, "Wrong alignment on WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu");
static_assert(sizeof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu) == 0x0000F0, "Wrong size on WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, EntryPoint) == 0x000000, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, K2Node_CustomEvent_type_1) == 0x000010, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::K2Node_CustomEvent_type_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, K2Node_CustomEvent_type) == 0x000011, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::K2Node_CustomEvent_type' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, CallFunc_Map_Find_Value) == 0x000018, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, CallFunc_Map_Find_ReturnValue) == 0x000020, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, CallFunc_Map_Find_Value_1) == 0x000028, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, CallFunc_Map_Find_ReturnValue_1) == 0x000030, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, CallFunc_Map_Keys_Keys) == 0x000040, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, Temp_int_Loop_Counter_Variable_1) == 0x000050, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, CallFunc_Add_IntInt_ReturnValue_1) == 0x000058, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000070, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x000080, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, CallFunc_GetPanelChildren_IsValidPanel) == 0x000090, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::CallFunc_GetPanelChildren_IsValidPanel' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, CallFunc_GetPanelChildren_Children) == 0x000098, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::CallFunc_GetPanelChildren_Children' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, CallFunc_Array_Length_ReturnValue_1) == 0x0000B0, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, K2Node_DynamicCast_AsWBP_Main_Menu_Tab) == 0x0000B8, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::K2Node_DynamicCast_AsWBP_Main_Menu_Tab' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000C1, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, Temp_int_Array_Index_Variable_1) == 0x0000C4, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000C8, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, CallFunc_Map_Find_Value_2) == 0x0000E0, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu, CallFunc_Map_Find_ReturnValue_2) == 0x0000E8, "Member 'WBP_MainMenu_C_ExecuteUbergraph_WBP_MainMenu::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");

// Function WBP_MainMenu.WBP_MainMenu_C.GetTabWidgetByMenuType
// 0x0020 (0x0020 - 0x0000)
struct WBP_MainMenu_C_GetTabWidgetByMenuType final
{
public:
	EPalUIInGameMainMenuTabType                   MenuType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5923[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MainMenu_Tab_C*                    TabWidget;                                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MainMenu_Tab_C*                    CallFunc_Map_Find_Value;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_C_GetTabWidgetByMenuType) == 0x000008, "Wrong alignment on WBP_MainMenu_C_GetTabWidgetByMenuType");
static_assert(sizeof(WBP_MainMenu_C_GetTabWidgetByMenuType) == 0x000020, "Wrong size on WBP_MainMenu_C_GetTabWidgetByMenuType");
static_assert(offsetof(WBP_MainMenu_C_GetTabWidgetByMenuType, MenuType) == 0x000000, "Member 'WBP_MainMenu_C_GetTabWidgetByMenuType::MenuType' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_GetTabWidgetByMenuType, TabWidget) == 0x000008, "Member 'WBP_MainMenu_C_GetTabWidgetByMenuType::TabWidget' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_GetTabWidgetByMenuType, CallFunc_Map_Find_Value) == 0x000010, "Member 'WBP_MainMenu_C_GetTabWidgetByMenuType::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_GetTabWidgetByMenuType, CallFunc_Map_Find_ReturnValue) == 0x000018, "Member 'WBP_MainMenu_C_GetTabWidgetByMenuType::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_MainMenu.WBP_MainMenu_C.OnChangedIndexEvent
// 0x0050 (0x0050 - 0x0000)
struct WBP_MainMenu_C_OnChangedIndexEvent final
{
public:
	int32                                         OldIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewIndex;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                FocusTargetWidget;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPanelChildren_IsValidPanel;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5924[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetPanelChildren_Children;                // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_MainMenu_Tab_C*                    K2Node_DynamicCast_AsWBP_Main_Menu_Tab;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5925[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MainMenu_Tab_C*                    K2Node_DynamicCast_AsWBP_Main_Menu_Tab_1;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidIndex_IsValid;                     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_C_OnChangedIndexEvent) == 0x000008, "Wrong alignment on WBP_MainMenu_C_OnChangedIndexEvent");
static_assert(sizeof(WBP_MainMenu_C_OnChangedIndexEvent) == 0x000050, "Wrong size on WBP_MainMenu_C_OnChangedIndexEvent");
static_assert(offsetof(WBP_MainMenu_C_OnChangedIndexEvent, OldIndex) == 0x000000, "Member 'WBP_MainMenu_C_OnChangedIndexEvent::OldIndex' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_OnChangedIndexEvent, NewIndex) == 0x000004, "Member 'WBP_MainMenu_C_OnChangedIndexEvent::NewIndex' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_OnChangedIndexEvent, FocusTargetWidget) == 0x000008, "Member 'WBP_MainMenu_C_OnChangedIndexEvent::FocusTargetWidget' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_OnChangedIndexEvent, CallFunc_GetPanelChildren_IsValidPanel) == 0x000010, "Member 'WBP_MainMenu_C_OnChangedIndexEvent::CallFunc_GetPanelChildren_IsValidPanel' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_OnChangedIndexEvent, CallFunc_GetPanelChildren_Children) == 0x000018, "Member 'WBP_MainMenu_C_OnChangedIndexEvent::CallFunc_GetPanelChildren_Children' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_OnChangedIndexEvent, K2Node_DynamicCast_AsWBP_Main_Menu_Tab) == 0x000028, "Member 'WBP_MainMenu_C_OnChangedIndexEvent::K2Node_DynamicCast_AsWBP_Main_Menu_Tab' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_OnChangedIndexEvent, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_MainMenu_C_OnChangedIndexEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_OnChangedIndexEvent, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_MainMenu_C_OnChangedIndexEvent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_OnChangedIndexEvent, K2Node_DynamicCast_AsWBP_Main_Menu_Tab_1) == 0x000040, "Member 'WBP_MainMenu_C_OnChangedIndexEvent::K2Node_DynamicCast_AsWBP_Main_Menu_Tab_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_OnChangedIndexEvent, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'WBP_MainMenu_C_OnChangedIndexEvent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_OnChangedIndexEvent, CallFunc_IsValidIndex_IsValid) == 0x000049, "Member 'WBP_MainMenu_C_OnChangedIndexEvent::CallFunc_IsValidIndex_IsValid' has a wrong offset!");

// Function WBP_MainMenu.WBP_MainMenu_C.OnClickedTabEvent
// 0x0010 (0x0010 - 0x0000)
struct WBP_MainMenu_C_OnClickedTabEvent final
{
public:
	class UWBP_MainMenu_Tab_C*                    TabWidget;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexByWidget_FindedIndex;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_C_OnClickedTabEvent) == 0x000008, "Wrong alignment on WBP_MainMenu_C_OnClickedTabEvent");
static_assert(sizeof(WBP_MainMenu_C_OnClickedTabEvent) == 0x000010, "Wrong size on WBP_MainMenu_C_OnClickedTabEvent");
static_assert(offsetof(WBP_MainMenu_C_OnClickedTabEvent, TabWidget) == 0x000000, "Member 'WBP_MainMenu_C_OnClickedTabEvent::TabWidget' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_OnClickedTabEvent, CallFunc_GetIndexByWidget_FindedIndex) == 0x000008, "Member 'WBP_MainMenu_C_OnClickedTabEvent::CallFunc_GetIndexByWidget_FindedIndex' has a wrong offset!");

// Function WBP_MainMenu.WBP_MainMenu_C.OnNextEvent
// 0x000C (0x000C - 0x0000)
struct WBP_MainMenu_C_OnNextEvent final
{
public:
	int32                                         OldIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewIndex;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_C_OnNextEvent) == 0x000004, "Wrong alignment on WBP_MainMenu_C_OnNextEvent");
static_assert(sizeof(WBP_MainMenu_C_OnNextEvent) == 0x00000C, "Wrong size on WBP_MainMenu_C_OnNextEvent");
static_assert(offsetof(WBP_MainMenu_C_OnNextEvent, OldIndex) == 0x000000, "Member 'WBP_MainMenu_C_OnNextEvent::OldIndex' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_OnNextEvent, NewIndex) == 0x000004, "Member 'WBP_MainMenu_C_OnNextEvent::NewIndex' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_OnNextEvent, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_MainMenu_C_OnNextEvent::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_MainMenu.WBP_MainMenu_C.OnPrevEvent
// 0x000C (0x000C - 0x0000)
struct WBP_MainMenu_C_OnPrevEvent final
{
public:
	int32                                         OldIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewIndex;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_C_OnPrevEvent) == 0x000004, "Wrong alignment on WBP_MainMenu_C_OnPrevEvent");
static_assert(sizeof(WBP_MainMenu_C_OnPrevEvent) == 0x00000C, "Wrong size on WBP_MainMenu_C_OnPrevEvent");
static_assert(offsetof(WBP_MainMenu_C_OnPrevEvent, OldIndex) == 0x000000, "Member 'WBP_MainMenu_C_OnPrevEvent::OldIndex' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_OnPrevEvent, NewIndex) == 0x000004, "Member 'WBP_MainMenu_C_OnPrevEvent::NewIndex' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_OnPrevEvent, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_MainMenu_C_OnPrevEvent::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_MainMenu.WBP_MainMenu_C.SelectByMainMenuType
// 0x0018 (0x0018 - 0x0000)
struct WBP_MainMenu_C_SelectByMainMenuType final
{
public:
	EPalUIInGameMainMenuTabType                   Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5926[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MainMenu_Tab_C*                    CallFunc_Map_Find_Value;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5927[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndexByWidget_FindedIndex;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_C_SelectByMainMenuType) == 0x000008, "Wrong alignment on WBP_MainMenu_C_SelectByMainMenuType");
static_assert(sizeof(WBP_MainMenu_C_SelectByMainMenuType) == 0x000018, "Wrong size on WBP_MainMenu_C_SelectByMainMenuType");
static_assert(offsetof(WBP_MainMenu_C_SelectByMainMenuType, Type) == 0x000000, "Member 'WBP_MainMenu_C_SelectByMainMenuType::Type' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_SelectByMainMenuType, CallFunc_Map_Find_Value) == 0x000008, "Member 'WBP_MainMenu_C_SelectByMainMenuType::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_SelectByMainMenuType, CallFunc_Map_Find_ReturnValue) == 0x000010, "Member 'WBP_MainMenu_C_SelectByMainMenuType::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_C_SelectByMainMenuType, CallFunc_GetIndexByWidget_FindedIndex) == 0x000014, "Member 'WBP_MainMenu_C_SelectByMainMenuType::CallFunc_GetIndexByWidget_FindedIndex' has a wrong offset!");

// Function WBP_MainMenu.WBP_MainMenu_C.RegisterPanelWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_MainMenu_C_RegisterPanelWidget final
{
public:
	class UPanelWidget*                           PanelWidget;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_C_RegisterPanelWidget) == 0x000008, "Wrong alignment on WBP_MainMenu_C_RegisterPanelWidget");
static_assert(sizeof(WBP_MainMenu_C_RegisterPanelWidget) == 0x000008, "Wrong size on WBP_MainMenu_C_RegisterPanelWidget");
static_assert(offsetof(WBP_MainMenu_C_RegisterPanelWidget, PanelWidget) == 0x000000, "Member 'WBP_MainMenu_C_RegisterPanelWidget::PanelWidget' has a wrong offset!");

}

