#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CommonSelectNum

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Pal_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CommonSelectNum.WBP_CommonSelectNum_C
// 0x0080 (0x04B0 - 0x0430)
class UWBP_CommonSelectNum_C final : public UPalUISelectNumWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_318;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_58;                                    // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       EditableTextBox_0;                                 // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_454;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                LeftButton;                                        // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                RightButton;                                       // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         NowCount;                                          // 0x0468(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxCount;                                          // 0x046C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnRightButtonClicked;                              // 0x0470(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnLeftButtonClicked;                               // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnTextCommited;                                    // 0x0490(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         MaxDigit;                                          // 0x04A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B83[0x4];                                     // 0x04A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalUISelectNumParameter*               Parameter;                                         // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_CommonSelectNum_Button_318_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_CommonSelectNum_EditableTextBox_0_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__WBP_CommonSelectNum_EditableTextBox_0_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__WBP_CommonSelectNum_LeftButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_CommonSelectNum_RightButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void Check_Numeric(const class FString& CheckString, class FString* OutString);
	void CheckMaxCount(const class FString& InString, class FString* OutString);
	void Decrement();
	void ExecuteUbergraph_WBP_CommonSelectNum(int32 EntryPoint);
	void GetNowCount(int32* Count);
	void Increment();
	void OnClickedL();
	void OnClickedR();
	void OnEscape();
	void OnLeftButtonClicked__DelegateSignature();
	void OnRightButtonClicked__DelegateSignature();
	void OnSetup();
	void OnTextChanged(const class FString& NewString);
	void OnTextCommited__DelegateSignature(const class FString& NewString);
	void Setup(int32 InMaxCount, int32 DefaultCount);
	void UpdateText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CommonSelectNum_C">();
	}
	static class UWBP_CommonSelectNum_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CommonSelectNum_C>();
	}
};
static_assert(alignof(UWBP_CommonSelectNum_C) == 0x000008, "Wrong alignment on UWBP_CommonSelectNum_C");
static_assert(sizeof(UWBP_CommonSelectNum_C) == 0x0004B0, "Wrong size on UWBP_CommonSelectNum_C");
static_assert(offsetof(UWBP_CommonSelectNum_C, UberGraphFrame) == 0x000430, "Member 'UWBP_CommonSelectNum_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CommonSelectNum_C, Button_318) == 0x000438, "Member 'UWBP_CommonSelectNum_C::Button_318' has a wrong offset!");
static_assert(offsetof(UWBP_CommonSelectNum_C, CanvasPanel_58) == 0x000440, "Member 'UWBP_CommonSelectNum_C::CanvasPanel_58' has a wrong offset!");
static_assert(offsetof(UWBP_CommonSelectNum_C, EditableTextBox_0) == 0x000448, "Member 'UWBP_CommonSelectNum_C::EditableTextBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_CommonSelectNum_C, Image_454) == 0x000450, "Member 'UWBP_CommonSelectNum_C::Image_454' has a wrong offset!");
static_assert(offsetof(UWBP_CommonSelectNum_C, LeftButton) == 0x000458, "Member 'UWBP_CommonSelectNum_C::LeftButton' has a wrong offset!");
static_assert(offsetof(UWBP_CommonSelectNum_C, RightButton) == 0x000460, "Member 'UWBP_CommonSelectNum_C::RightButton' has a wrong offset!");
static_assert(offsetof(UWBP_CommonSelectNum_C, NowCount) == 0x000468, "Member 'UWBP_CommonSelectNum_C::NowCount' has a wrong offset!");
static_assert(offsetof(UWBP_CommonSelectNum_C, MaxCount) == 0x00046C, "Member 'UWBP_CommonSelectNum_C::MaxCount' has a wrong offset!");
static_assert(offsetof(UWBP_CommonSelectNum_C, OnRightButtonClicked) == 0x000470, "Member 'UWBP_CommonSelectNum_C::OnRightButtonClicked' has a wrong offset!");
static_assert(offsetof(UWBP_CommonSelectNum_C, OnLeftButtonClicked) == 0x000480, "Member 'UWBP_CommonSelectNum_C::OnLeftButtonClicked' has a wrong offset!");
static_assert(offsetof(UWBP_CommonSelectNum_C, OnTextCommited) == 0x000490, "Member 'UWBP_CommonSelectNum_C::OnTextCommited' has a wrong offset!");
static_assert(offsetof(UWBP_CommonSelectNum_C, MaxDigit) == 0x0004A0, "Member 'UWBP_CommonSelectNum_C::MaxDigit' has a wrong offset!");
static_assert(offsetof(UWBP_CommonSelectNum_C, Parameter) == 0x0004A8, "Member 'UWBP_CommonSelectNum_C::Parameter' has a wrong offset!");

}

