#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IngameConstruction_Dismantling

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_IngameConstruction_Dismantling.WBP_IngameConstruction_Dismantling_C
// 0x01A0 (0x0418 - 0x0278)
class UWBP_IngameConstruction_Dismantling_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anm_Caution;                                       // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     BP_PalTextBlock_C_39;                              // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     BP_PalTextBlock_C_100;                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Warning;                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dot_0;                                             // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dot_1;                                             // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dot_2;                                             // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dot_3;                                             // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dot_4;                                             // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dot_5;                                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dot_6;                                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dot_7;                                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dot_8;                                             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dot_9;                                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemBase_0;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemBase_1;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemBase_2;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemBase_3;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemNumBase_0;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemNumBase_1;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemNumBase_2;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemNumBase_3;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NameBase;                                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WarningBase;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WarningBase_Caution;                               // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WarningBase_L;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WarningBase_R;                                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Ingameconstruction_KeyGuide_C*     WBP_Ingameconstruction_KeyGuide;                   // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Ingameconstruction_KeyGuide_C*     WBP_Ingameconstruction_KeyGuide_1;                 // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Ingameconstruction_KeyGuide_C*     WBP_Ingameconstruction_KeyGuide_2;                 // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Ingameconstruction_KeyGuide_C*     WBP_Ingameconstruction_KeyGuide_3;                 // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameConstruction_Num_C*          WBP_IngameConstruction_Num_0;                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameConstruction_Num_C*          WBP_IngameConstruction_Num_1;                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameConstruction_Num_C*          WBP_IngameConstruction_Num_2;                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameConstruction_Num_C*          WBP_IngameConstruction_Num_3;                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalCommonItemIcon_C*               WBP_PalCommonItemIcon;                             // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalCommonItemIcon_C*               WBP_PalCommonItemIcon_1;                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalCommonItemIcon_C*               WBP_PalCommonItemIcon_2;                           // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalCommonItemIcon_C*               WBP_PalCommonItemIcon_3;                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_IngameConstruction_Num_C*>  ItemNums;                                          // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UWBP_PalCommonItemIcon_C*>       ItemIconArray;                                     // 0x03C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FDataTableRowHandle                    KeyGuideMsgHandle_Dismantle;                       // 0x03D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    KeyGuideMsgHandle_DismantleContinuous;             // 0x03E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    KeyGuideMsgHandle_Cancel;                          // 0x03F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    KeyGuideMsgHandle_Close;                           // 0x0408(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void SetWarningText(const class FText& InText);
	void SetupKeyGuide();
	void Setup(const struct FPalBuildObjectData& InBuildObjectData);
	void SetMaterial(int32 Param_Index, class FName StaticItemId, int32 ItemCount);
	void SetEnableWarning(bool IsEnable);
	void SetDismantleObjectName(const class FText& InName);
	void ResetAllUI();
	void OnInitialized();
	void InitUI();
	void ExecuteUbergraph_WBP_IngameConstruction_Dismantling(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_IngameConstruction_Dismantling_C">();
	}
	static class UWBP_IngameConstruction_Dismantling_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_IngameConstruction_Dismantling_C>();
	}
};
static_assert(alignof(UWBP_IngameConstruction_Dismantling_C) == 0x000008, "Wrong alignment on UWBP_IngameConstruction_Dismantling_C");
static_assert(sizeof(UWBP_IngameConstruction_Dismantling_C) == 0x000418, "Wrong size on UWBP_IngameConstruction_Dismantling_C");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, UberGraphFrame) == 0x000278, "Member 'UWBP_IngameConstruction_Dismantling_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, Anm_Caution) == 0x000280, "Member 'UWBP_IngameConstruction_Dismantling_C::Anm_Caution' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, BP_PalTextBlock_C_39) == 0x000288, "Member 'UWBP_IngameConstruction_Dismantling_C::BP_PalTextBlock_C_39' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, BP_PalTextBlock_C_100) == 0x000290, "Member 'UWBP_IngameConstruction_Dismantling_C::BP_PalTextBlock_C_100' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, CanvasPanel_Warning) == 0x000298, "Member 'UWBP_IngameConstruction_Dismantling_C::CanvasPanel_Warning' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, Dot_0) == 0x0002A0, "Member 'UWBP_IngameConstruction_Dismantling_C::Dot_0' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, Dot_1) == 0x0002A8, "Member 'UWBP_IngameConstruction_Dismantling_C::Dot_1' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, Dot_2) == 0x0002B0, "Member 'UWBP_IngameConstruction_Dismantling_C::Dot_2' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, Dot_3) == 0x0002B8, "Member 'UWBP_IngameConstruction_Dismantling_C::Dot_3' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, Dot_4) == 0x0002C0, "Member 'UWBP_IngameConstruction_Dismantling_C::Dot_4' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, Dot_5) == 0x0002C8, "Member 'UWBP_IngameConstruction_Dismantling_C::Dot_5' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, Dot_6) == 0x0002D0, "Member 'UWBP_IngameConstruction_Dismantling_C::Dot_6' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, Dot_7) == 0x0002D8, "Member 'UWBP_IngameConstruction_Dismantling_C::Dot_7' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, Dot_8) == 0x0002E0, "Member 'UWBP_IngameConstruction_Dismantling_C::Dot_8' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, Dot_9) == 0x0002E8, "Member 'UWBP_IngameConstruction_Dismantling_C::Dot_9' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, ItemBase_0) == 0x0002F0, "Member 'UWBP_IngameConstruction_Dismantling_C::ItemBase_0' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, ItemBase_1) == 0x0002F8, "Member 'UWBP_IngameConstruction_Dismantling_C::ItemBase_1' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, ItemBase_2) == 0x000300, "Member 'UWBP_IngameConstruction_Dismantling_C::ItemBase_2' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, ItemBase_3) == 0x000308, "Member 'UWBP_IngameConstruction_Dismantling_C::ItemBase_3' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, ItemNumBase_0) == 0x000310, "Member 'UWBP_IngameConstruction_Dismantling_C::ItemNumBase_0' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, ItemNumBase_1) == 0x000318, "Member 'UWBP_IngameConstruction_Dismantling_C::ItemNumBase_1' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, ItemNumBase_2) == 0x000320, "Member 'UWBP_IngameConstruction_Dismantling_C::ItemNumBase_2' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, ItemNumBase_3) == 0x000328, "Member 'UWBP_IngameConstruction_Dismantling_C::ItemNumBase_3' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, NameBase) == 0x000330, "Member 'UWBP_IngameConstruction_Dismantling_C::NameBase' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, WarningBase) == 0x000338, "Member 'UWBP_IngameConstruction_Dismantling_C::WarningBase' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, WarningBase_Caution) == 0x000340, "Member 'UWBP_IngameConstruction_Dismantling_C::WarningBase_Caution' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, WarningBase_L) == 0x000348, "Member 'UWBP_IngameConstruction_Dismantling_C::WarningBase_L' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, WarningBase_R) == 0x000350, "Member 'UWBP_IngameConstruction_Dismantling_C::WarningBase_R' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, WBP_Ingameconstruction_KeyGuide) == 0x000358, "Member 'UWBP_IngameConstruction_Dismantling_C::WBP_Ingameconstruction_KeyGuide' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, WBP_Ingameconstruction_KeyGuide_1) == 0x000360, "Member 'UWBP_IngameConstruction_Dismantling_C::WBP_Ingameconstruction_KeyGuide_1' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, WBP_Ingameconstruction_KeyGuide_2) == 0x000368, "Member 'UWBP_IngameConstruction_Dismantling_C::WBP_Ingameconstruction_KeyGuide_2' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, WBP_Ingameconstruction_KeyGuide_3) == 0x000370, "Member 'UWBP_IngameConstruction_Dismantling_C::WBP_Ingameconstruction_KeyGuide_3' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, WBP_IngameConstruction_Num_0) == 0x000378, "Member 'UWBP_IngameConstruction_Dismantling_C::WBP_IngameConstruction_Num_0' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, WBP_IngameConstruction_Num_1) == 0x000380, "Member 'UWBP_IngameConstruction_Dismantling_C::WBP_IngameConstruction_Num_1' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, WBP_IngameConstruction_Num_2) == 0x000388, "Member 'UWBP_IngameConstruction_Dismantling_C::WBP_IngameConstruction_Num_2' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, WBP_IngameConstruction_Num_3) == 0x000390, "Member 'UWBP_IngameConstruction_Dismantling_C::WBP_IngameConstruction_Num_3' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, WBP_PalCommonItemIcon) == 0x000398, "Member 'UWBP_IngameConstruction_Dismantling_C::WBP_PalCommonItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, WBP_PalCommonItemIcon_1) == 0x0003A0, "Member 'UWBP_IngameConstruction_Dismantling_C::WBP_PalCommonItemIcon_1' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, WBP_PalCommonItemIcon_2) == 0x0003A8, "Member 'UWBP_IngameConstruction_Dismantling_C::WBP_PalCommonItemIcon_2' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, WBP_PalCommonItemIcon_3) == 0x0003B0, "Member 'UWBP_IngameConstruction_Dismantling_C::WBP_PalCommonItemIcon_3' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, ItemNums) == 0x0003B8, "Member 'UWBP_IngameConstruction_Dismantling_C::ItemNums' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, ItemIconArray) == 0x0003C8, "Member 'UWBP_IngameConstruction_Dismantling_C::ItemIconArray' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, KeyGuideMsgHandle_Dismantle) == 0x0003D8, "Member 'UWBP_IngameConstruction_Dismantling_C::KeyGuideMsgHandle_Dismantle' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, KeyGuideMsgHandle_DismantleContinuous) == 0x0003E8, "Member 'UWBP_IngameConstruction_Dismantling_C::KeyGuideMsgHandle_DismantleContinuous' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, KeyGuideMsgHandle_Cancel) == 0x0003F8, "Member 'UWBP_IngameConstruction_Dismantling_C::KeyGuideMsgHandle_Cancel' has a wrong offset!");
static_assert(offsetof(UWBP_IngameConstruction_Dismantling_C, KeyGuideMsgHandle_Close) == 0x000408, "Member 'UWBP_IngameConstruction_Dismantling_C::KeyGuideMsgHandle_Close' has a wrong offset!");

}

