#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CommonWorkRequirement

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Pal_structs.hpp"


namespace SDK::Params
{

// Function WBP_CommonWorkRequirement.WBP_CommonWorkRequirement_C.ExecuteUbergraph_WBP_CommonWorkRequirement
// 0x0068 (0x0068 - 0x0000)
struct WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalWorkSuitability                           CallFunc_GetWorkSuitability_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2637[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UPalWorkBase* Work)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalHUDDispatchParameterBase*           CallFunc_GetParam_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalUIMapObjectStatusIndicatorParameterBase* K2Node_DynamicCast_AsPal_UIMap_Object_Status_Indicator_Parameter_Base; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalWorkSuitability                           CallFunc_GetWorkSuitability_ReturnValue_1;         // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2638[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalMapObjectConcreteModelBase*         CallFunc_GetConcreteModel_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalMapObjectEnergyModule*              CallFunc_GetEnergyModule_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalMapObjectWorkeeModule*              CallFunc_GetWorkeeModule_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalWorkBase*                           CallFunc_GetWork_ReturnValue;                      // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2639[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalWorkProgress*                       CallFunc_GetWorkProgress_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement) == 0x000008, "Wrong alignment on WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement");
static_assert(sizeof(WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement) == 0x000068, "Wrong size on WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement");
static_assert(offsetof(WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement, EntryPoint) == 0x000000, "Member 'WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement, CallFunc_GetWorkSuitability_ReturnValue) == 0x000004, "Member 'WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement::CallFunc_GetWorkSuitability_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement, CallFunc_GetParam_ReturnValue) == 0x000018, "Member 'WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement::CallFunc_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement, K2Node_DynamicCast_AsPal_UIMap_Object_Status_Indicator_Parameter_Base) == 0x000020, "Member 'WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement::K2Node_DynamicCast_AsPal_UIMap_Object_Status_Indicator_Parameter_Base' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement, CallFunc_GetWorkSuitability_ReturnValue_1) == 0x000029, "Member 'WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement::CallFunc_GetWorkSuitability_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement, CallFunc_GetConcreteModel_ReturnValue) == 0x000030, "Member 'WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement::CallFunc_GetConcreteModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement, CallFunc_GetEnergyModule_ReturnValue) == 0x000038, "Member 'WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement::CallFunc_GetEnergyModule_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement, CallFunc_GetWorkeeModule_ReturnValue) == 0x000040, "Member 'WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement::CallFunc_GetWorkeeModule_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement, CallFunc_GetWork_ReturnValue) == 0x000048, "Member 'WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement::CallFunc_GetWork_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement, CallFunc_GetWorkProgress_ReturnValue) == 0x000058, "Member 'WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement::CallFunc_GetWorkProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'WBP_CommonWorkRequirement_C_ExecuteUbergraph_WBP_CommonWorkRequirement::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_CommonWorkRequirement.WBP_CommonWorkRequirement_C.On Updated Worker Pal
// 0x0078 (0x0078 - 0x0000)
struct WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal final
{
public:
	class UPalWorkBase*                           Work;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          HasAssign;                                         // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_263A[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPalIndividualCharacterSlot*>    CallFunc_GetAssignedCharacters_IndividualSlots;    // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_263B[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_263C[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterSlot*            CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterHandle*          CallFunc_GetHandle_ReturnValue;                    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_263D[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_TryGetIndividualActor_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_263E[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalCharacterParameterComponent*        CallFunc_GetCharacterParameterComponent_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAssignedToAnyWork_ReturnValue;          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_263F[0x2];                                     // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2640[0x2];                                     // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal) == 0x000008, "Wrong alignment on WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal");
static_assert(sizeof(WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal) == 0x000078, "Wrong size on WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal");
static_assert(offsetof(WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal, Work) == 0x000000, "Member 'WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal::Work' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal, HasAssign) == 0x000008, "Member 'WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal::HasAssign' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal, Temp_bool_True_if_break_was_hit_Variable) == 0x000009, "Member 'WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal, CallFunc_GetAssignedCharacters_IndividualSlots) == 0x000010, "Member 'WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal::CallFunc_GetAssignedCharacters_IndividualSlots' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal, CallFunc_Not_PreBool_ReturnValue) == 0x000024, "Member 'WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal, Temp_int_Array_Index_Variable) == 0x000028, "Member 'WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal, Temp_byte_Variable) == 0x00002C, "Member 'WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal, CallFunc_GetHandle_ReturnValue) == 0x000038, "Member 'WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal::CallFunc_GetHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal, CallFunc_TryGetIndividualActor_ReturnValue) == 0x000048, "Member 'WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal::CallFunc_TryGetIndividualActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal, CallFunc_GetCharacterParameterComponent_ReturnValue) == 0x000058, "Member 'WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal::CallFunc_GetCharacterParameterComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal, CallFunc_IsValid_ReturnValue_2) == 0x000060, "Member 'WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal, CallFunc_IsAssignedToAnyWork_ReturnValue) == 0x000061, "Member 'WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal::CallFunc_IsAssignedToAnyWork_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal, Temp_int_Loop_Counter_Variable) == 0x000064, "Member 'WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal, Temp_bool_Variable) == 0x000068, "Member 'WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal, CallFunc_Less_IntInt_ReturnValue) == 0x000069, "Member 'WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal, CallFunc_BooleanAND_ReturnValue) == 0x000070, "Member 'WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal, Temp_byte_Variable_1) == 0x000071, "Member 'WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal, K2Node_Select_Default) == 0x000072, "Member 'WBP_CommonWorkRequirement_C_On_Updated_Worker_Pal::K2Node_Select_Default' has a wrong offset!");

}

