#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IngameMenu_WorkSpace

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Pal_structs.hpp"
#include "Pal_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_IngameMenu_WorkSpace.WBP_IngameMenu_WorkSpace_C
// 0x0138 (0x05C8 - 0x0490)
class UWBP_IngameMenu_WorkSpace_C final : public UPalUIPaldex
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_PalTextBlock_C*                     BP_PalTextBlock_Amount;                            // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     BP_PalTextBlock_C_77;                              // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     BP_PalTextBlock_Name;                              // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     BP_PalTextBlock_NoRecipe;                          // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     BP_PalTextBlock_Num;                               // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanelIcon;                                   // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanelMaterialText;                           // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanelSelect;                                 // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              CheckBox;                                          // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DurableFrameB;                                     // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_ProductNum;                          // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_TransportCheckBox;                   // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_97;                                          // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_FilterContent;                                // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_ItemNumTitle;                                 // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_ItemNumValue;                                 // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_ManMonth_Value;                               // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ConvertItemMenuScrollList_C*       WBP_ConvertItemMenuScrollList;                     // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenu_WorkSpace_StartButton_C* WBP_IngameMenu_StartButton;                        // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenu_WorkSpace_NumArrow_C*   WBP_IngameMenu_WorkSpace_Add;                      // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenu_WorkSpace_NumArrow_C*   WBP_IngameMenu_WorkSpace_Add10;                    // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenu_WorkSpace_NumArrow_C*   WBP_IngameMenu_WorkSpace_Sub;                      // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenu_WorkSpace_NumArrow_C*   WBP_IngameMenu_WorkSpace_Sub10;                    // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventoryEquipment_ItemInfo_Tecnology_C* WBP_InventoryEquipment_ItemInfo_Tecnology;         // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_btn_C*                        WBP_Menu_btn;                                      // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalInGameMenuItemIcon_C*           WBP_PalInGameMenuItemIcon;                         // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalInvisibleButton_C*              WBP_PalInvisibleButton;                            // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalInvisibleButton_C*              WBP_PalInvisibleButton_TransportCheck;             // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalUIConvertItemModel_C*            Convert_Item_Model;                                // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentProductAmount;                              // 0x0580(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InputActionName_Max;                               // 0x0584(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelectingProductNumFlag;                         // 0x058C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A63[0x3];                                     // 0x058D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PalConvertItemMenu_RecipeSlotButton_C* LastSelectedSlot;                                  // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   InputActionName_Start;                             // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InputActionName_Cancel;                            // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPalStaticItemIdAndNum>         TmpComtrollableBlueprintInfo;                      // 0x05A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           UpdateRecipeTimer;                                 // 0x05B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   InputActionName_CanTransportOut;                   // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_InGameMainMenu_WBP_Menu_btn_K2Node_ComponentBoundEvent_0_OnButtonClicked__DelegateSignature();
	void BndEvt__WBP_IngameMenu_WorkSpace_WBP_IngameMenu_StartButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();
	void BndEvt__WBP_IngameMenu_WorkSpace_WBP_IngameMenu_WorkSpace_Add10_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature();
	void BndEvt__WBP_IngameMenu_WorkSpace_WBP_IngameMenu_WorkSpace_NumArrow_1_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void BndEvt__WBP_IngameMenu_WorkSpace_WBP_IngameMenu_WorkSpace_Sub10_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature();
	void BndEvt__WBP_IngameMenu_WorkSpace_WBP_IngameMenu_WorkSpace_Sub_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void BndEvt__WBP_IngameMenu_WorkSpace_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_IngameMenu_WorkSpace_WBP_PalInvisibleButton_TransportCheck_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Destruct();
	void ExecuteUbergraph_WBP_IngameMenu_WorkSpace(int32 EntryPoint);
	void FilteringRecipe(TArray<class FName>& RecipeIDArray, TArray<class FName>* FilteredArray);
	void FilterSkillUnlocker(TArray<class FName>& Recipes, class FName WorkBenchId, TArray<class FName>* FilteredRecipes);
	void IsSelectingProductNum(bool* IsSelecting);
	void OnCancelInput();
	void OnClickedRecipeSlot(class UWBP_PalConvertItemMenu_RecipeSlotButton_C* Param_Slot);
	void OnHoveredRecipeSlot(class UWBP_PalConvertItemMenu_RecipeSlotButton_C* Param_Slot);
	void OnSetup();
	void OnUnhoveredRecipeSlot(class UWBP_PalConvertItemMenu_RecipeSlotButton_C* Param_Slot);
	void OnUpdateCanTransportOut(bool bOn);
	void SetMax();
	void Setup();
	void StartProduce();
	void ToggleCanTransportOut();
	void Update_Recipe_Detail();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_IngameMenu_WorkSpace_C">();
	}
	static class UWBP_IngameMenu_WorkSpace_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_IngameMenu_WorkSpace_C>();
	}
};
static_assert(alignof(UWBP_IngameMenu_WorkSpace_C) == 0x000008, "Wrong alignment on UWBP_IngameMenu_WorkSpace_C");
static_assert(sizeof(UWBP_IngameMenu_WorkSpace_C) == 0x0005C8, "Wrong size on UWBP_IngameMenu_WorkSpace_C");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, UberGraphFrame) == 0x000490, "Member 'UWBP_IngameMenu_WorkSpace_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, BP_PalTextBlock_Amount) == 0x000498, "Member 'UWBP_IngameMenu_WorkSpace_C::BP_PalTextBlock_Amount' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, BP_PalTextBlock_C_77) == 0x0004A0, "Member 'UWBP_IngameMenu_WorkSpace_C::BP_PalTextBlock_C_77' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, BP_PalTextBlock_Name) == 0x0004A8, "Member 'UWBP_IngameMenu_WorkSpace_C::BP_PalTextBlock_Name' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, BP_PalTextBlock_NoRecipe) == 0x0004B0, "Member 'UWBP_IngameMenu_WorkSpace_C::BP_PalTextBlock_NoRecipe' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, BP_PalTextBlock_Num) == 0x0004B8, "Member 'UWBP_IngameMenu_WorkSpace_C::BP_PalTextBlock_Num' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, CanvasPanelIcon) == 0x0004C0, "Member 'UWBP_IngameMenu_WorkSpace_C::CanvasPanelIcon' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, CanvasPanelMaterialText) == 0x0004C8, "Member 'UWBP_IngameMenu_WorkSpace_C::CanvasPanelMaterialText' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, CanvasPanelSelect) == 0x0004D0, "Member 'UWBP_IngameMenu_WorkSpace_C::CanvasPanelSelect' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, CheckBox) == 0x0004D8, "Member 'UWBP_IngameMenu_WorkSpace_C::CheckBox' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, DurableFrameB) == 0x0004E0, "Member 'UWBP_IngameMenu_WorkSpace_C::DurableFrameB' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, HorizontalBox_ProductNum) == 0x0004E8, "Member 'UWBP_IngameMenu_WorkSpace_C::HorizontalBox_ProductNum' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, HorizontalBox_TransportCheckBox) == 0x0004F0, "Member 'UWBP_IngameMenu_WorkSpace_C::HorizontalBox_TransportCheckBox' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, Image_97) == 0x0004F8, "Member 'UWBP_IngameMenu_WorkSpace_C::Image_97' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, Text_FilterContent) == 0x000500, "Member 'UWBP_IngameMenu_WorkSpace_C::Text_FilterContent' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, Text_ItemNumTitle) == 0x000508, "Member 'UWBP_IngameMenu_WorkSpace_C::Text_ItemNumTitle' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, Text_ItemNumValue) == 0x000510, "Member 'UWBP_IngameMenu_WorkSpace_C::Text_ItemNumValue' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, Text_ManMonth_Value) == 0x000518, "Member 'UWBP_IngameMenu_WorkSpace_C::Text_ManMonth_Value' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, WBP_ConvertItemMenuScrollList) == 0x000520, "Member 'UWBP_IngameMenu_WorkSpace_C::WBP_ConvertItemMenuScrollList' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, WBP_IngameMenu_StartButton) == 0x000528, "Member 'UWBP_IngameMenu_WorkSpace_C::WBP_IngameMenu_StartButton' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, WBP_IngameMenu_WorkSpace_Add) == 0x000530, "Member 'UWBP_IngameMenu_WorkSpace_C::WBP_IngameMenu_WorkSpace_Add' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, WBP_IngameMenu_WorkSpace_Add10) == 0x000538, "Member 'UWBP_IngameMenu_WorkSpace_C::WBP_IngameMenu_WorkSpace_Add10' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, WBP_IngameMenu_WorkSpace_Sub) == 0x000540, "Member 'UWBP_IngameMenu_WorkSpace_C::WBP_IngameMenu_WorkSpace_Sub' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, WBP_IngameMenu_WorkSpace_Sub10) == 0x000548, "Member 'UWBP_IngameMenu_WorkSpace_C::WBP_IngameMenu_WorkSpace_Sub10' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, WBP_InventoryEquipment_ItemInfo_Tecnology) == 0x000550, "Member 'UWBP_IngameMenu_WorkSpace_C::WBP_InventoryEquipment_ItemInfo_Tecnology' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, WBP_Menu_btn) == 0x000558, "Member 'UWBP_IngameMenu_WorkSpace_C::WBP_Menu_btn' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, WBP_PalInGameMenuItemIcon) == 0x000560, "Member 'UWBP_IngameMenu_WorkSpace_C::WBP_PalInGameMenuItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, WBP_PalInvisibleButton) == 0x000568, "Member 'UWBP_IngameMenu_WorkSpace_C::WBP_PalInvisibleButton' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, WBP_PalInvisibleButton_TransportCheck) == 0x000570, "Member 'UWBP_IngameMenu_WorkSpace_C::WBP_PalInvisibleButton_TransportCheck' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, Convert_Item_Model) == 0x000578, "Member 'UWBP_IngameMenu_WorkSpace_C::Convert_Item_Model' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, CurrentProductAmount) == 0x000580, "Member 'UWBP_IngameMenu_WorkSpace_C::CurrentProductAmount' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, InputActionName_Max) == 0x000584, "Member 'UWBP_IngameMenu_WorkSpace_C::InputActionName_Max' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, IsSelectingProductNumFlag) == 0x00058C, "Member 'UWBP_IngameMenu_WorkSpace_C::IsSelectingProductNumFlag' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, LastSelectedSlot) == 0x000590, "Member 'UWBP_IngameMenu_WorkSpace_C::LastSelectedSlot' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, InputActionName_Start) == 0x000598, "Member 'UWBP_IngameMenu_WorkSpace_C::InputActionName_Start' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, InputActionName_Cancel) == 0x0005A0, "Member 'UWBP_IngameMenu_WorkSpace_C::InputActionName_Cancel' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, TmpComtrollableBlueprintInfo) == 0x0005A8, "Member 'UWBP_IngameMenu_WorkSpace_C::TmpComtrollableBlueprintInfo' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, UpdateRecipeTimer) == 0x0005B8, "Member 'UWBP_IngameMenu_WorkSpace_C::UpdateRecipeTimer' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_WorkSpace_C, InputActionName_CanTransportOut) == 0x0005C0, "Member 'UWBP_IngameMenu_WorkSpace_C::InputActionName_CanTransportOut' has a wrong offset!");

}

