#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Buildup_Pal

#include "Basic.hpp"

#include "Pal_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Buildup_Pal.WBP_Buildup_Pal_C.CloseAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_Buildup_Pal_C_CloseAction final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Buildup_Pal_C_CloseAction) == 0x000001, "Wrong alignment on WBP_Buildup_Pal_C_CloseAction");
static_assert(sizeof(WBP_Buildup_Pal_C_CloseAction) == 0x000001, "Wrong size on WBP_Buildup_Pal_C_CloseAction");
static_assert(offsetof(WBP_Buildup_Pal_C_CloseAction, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_Buildup_Pal_C_CloseAction::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_Buildup_Pal.WBP_Buildup_Pal_C.ExecuteUbergraph_WBP_Buildup_Pal
// 0x0090 (0x0090 - 0x0000)
struct WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49B4[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_Menu_PalList_C*>            K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UWBP_Buildup_Pal_Item_C*>        K2Node_MakeArray_Array_1;                          // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text;          // 0x0028(0x0018)()
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_1;        // 0x0040(0x0018)()
	class UPalHUDDispatchParameterBase*           CallFunc_GetParam_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalHUDDispatchParameter_CharacterStatusOperator* K2Node_DynamicCast_AsPal_HUDDispatch_Parameter_Character_Status_Operator; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49B5[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Tab;                            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49B6[0x1];                                     // 0x0073(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPalCharacterStatusOperationResult Result)> K2Node_CreateDelegate_OutputDelegate;              // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49B7[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalNetworkCharacterStatusOperationComponent* CallFunc_NetCharacterStatusOperation_ReturnValue;  // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal) == 0x000008, "Wrong alignment on WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal");
static_assert(sizeof(WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal) == 0x000090, "Wrong size on WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal");
static_assert(offsetof(WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal, EntryPoint) == 0x000000, "Member 'WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal, K2Node_MakeArray_Array) == 0x000008, "Member 'WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal, K2Node_MakeArray_Array_1) == 0x000018, "Member 'WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal, CallFunc_GetLocalizedTextFromHandle_Text) == 0x000028, "Member 'WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal::CallFunc_GetLocalizedTextFromHandle_Text' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal, CallFunc_GetLocalizedTextFromHandle_Text_1) == 0x000040, "Member 'WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal::CallFunc_GetLocalizedTextFromHandle_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal, CallFunc_GetParam_ReturnValue) == 0x000058, "Member 'WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal::CallFunc_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal, K2Node_DynamicCast_AsPal_HUDDispatch_Parameter_Character_Status_Operator) == 0x000060, "Member 'WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal::K2Node_DynamicCast_AsPal_HUDDispatch_Parameter_Character_Status_Operator' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal, K2Node_CustomEvent_Tab) == 0x00006C, "Member 'WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal::K2Node_CustomEvent_Tab' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000070, "Member 'WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000071, "Member 'WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000072, "Member 'WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal, K2Node_CreateDelegate_OutputDelegate) == 0x000074, "Member 'WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal, CallFunc_BooleanAND_ReturnValue) == 0x000084, "Member 'WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal, CallFunc_NetCharacterStatusOperation_ReturnValue) == 0x000088, "Member 'WBP_Buildup_Pal_C_ExecuteUbergraph_WBP_Buildup_Pal::CallFunc_NetCharacterStatusOperation_ReturnValue' has a wrong offset!");

// Function WBP_Buildup_Pal.WBP_Buildup_Pal_C.InvokeRankUp
// 0x0018 (0x0018 - 0x0000)
struct WBP_Buildup_Pal_C_InvokeRankUp final
{
public:
	EPalCharacterStatusOperationName              Status;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49B8[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TargetRank;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalNetworkCharacterStatusOperationComponent* CallFunc_NetCharacterStatusOperation_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Buildup_Pal_C_InvokeRankUp) == 0x000008, "Wrong alignment on WBP_Buildup_Pal_C_InvokeRankUp");
static_assert(sizeof(WBP_Buildup_Pal_C_InvokeRankUp) == 0x000018, "Wrong size on WBP_Buildup_Pal_C_InvokeRankUp");
static_assert(offsetof(WBP_Buildup_Pal_C_InvokeRankUp, Status) == 0x000000, "Member 'WBP_Buildup_Pal_C_InvokeRankUp::Status' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_InvokeRankUp, TargetRank) == 0x000004, "Member 'WBP_Buildup_Pal_C_InvokeRankUp::TargetRank' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_InvokeRankUp, CallFunc_NetCharacterStatusOperation_ReturnValue) == 0x000008, "Member 'WBP_Buildup_Pal_C_InvokeRankUp::CallFunc_NetCharacterStatusOperation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_InvokeRankUp, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_Buildup_Pal_C_InvokeRankUp::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_Buildup_Pal.WBP_Buildup_Pal_C.InvokeReset
// 0x0010 (0x0010 - 0x0000)
struct WBP_Buildup_Pal_C_InvokeReset final
{
public:
	class UPalNetworkCharacterStatusOperationComponent* CallFunc_NetCharacterStatusOperation_ReturnValue;  // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Buildup_Pal_C_InvokeReset) == 0x000008, "Wrong alignment on WBP_Buildup_Pal_C_InvokeReset");
static_assert(sizeof(WBP_Buildup_Pal_C_InvokeReset) == 0x000010, "Wrong size on WBP_Buildup_Pal_C_InvokeReset");
static_assert(offsetof(WBP_Buildup_Pal_C_InvokeReset, CallFunc_NetCharacterStatusOperation_ReturnValue) == 0x000000, "Member 'WBP_Buildup_Pal_C_InvokeReset::CallFunc_NetCharacterStatusOperation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_InvokeReset, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_Buildup_Pal_C_InvokeReset::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_Buildup_Pal.WBP_Buildup_Pal_C.OnClickPalList
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_Buildup_Pal_C_OnClickPalList final
{
public:
	class UPalIndividualCharacterHandle*          Handle;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterParameter*       CallFunc_TryGetIndividualParameter_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49B9[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterParameter*       CallFunc_TryGetIndividualParameter_ReturnValue_1;  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49BA[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49BB[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49BC[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_PalList_C*                    CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49BD[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Menu_PalList_C*                    CallFunc_Array_Get_Item_1;                         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetFocusTarget_Widget;                    // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49BE[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterHandle*          CallFunc_GetBindedHandle_targetHandle;             // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49BF[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Buildup_Pal_C_OnClickPalList) == 0x000008, "Wrong alignment on WBP_Buildup_Pal_C_OnClickPalList");
static_assert(sizeof(WBP_Buildup_Pal_C_OnClickPalList) == 0x0000A8, "Wrong size on WBP_Buildup_Pal_C_OnClickPalList");
static_assert(offsetof(WBP_Buildup_Pal_C_OnClickPalList, Handle) == 0x000000, "Member 'WBP_Buildup_Pal_C_OnClickPalList::Handle' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_OnClickPalList, CallFunc_TryGetIndividualParameter_ReturnValue) == 0x000008, "Member 'WBP_Buildup_Pal_C_OnClickPalList::CallFunc_TryGetIndividualParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_OnClickPalList, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_Buildup_Pal_C_OnClickPalList::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_OnClickPalList, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_Buildup_Pal_C_OnClickPalList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_OnClickPalList, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Buildup_Pal_C_OnClickPalList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_OnClickPalList, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'WBP_Buildup_Pal_C_OnClickPalList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_OnClickPalList, Temp_int_Loop_Counter_Variable_1) == 0x000020, "Member 'WBP_Buildup_Pal_C_OnClickPalList::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_OnClickPalList, CallFunc_Add_IntInt_ReturnValue_1) == 0x000024, "Member 'WBP_Buildup_Pal_C_OnClickPalList::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_OnClickPalList, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'WBP_Buildup_Pal_C_OnClickPalList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_OnClickPalList, CallFunc_TryGetIndividualParameter_ReturnValue_1) == 0x000038, "Member 'WBP_Buildup_Pal_C_OnClickPalList::CallFunc_TryGetIndividualParameter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_OnClickPalList, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'WBP_Buildup_Pal_C_OnClickPalList::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_OnClickPalList, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'WBP_Buildup_Pal_C_OnClickPalList::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_OnClickPalList, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'WBP_Buildup_Pal_C_OnClickPalList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_OnClickPalList, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'WBP_Buildup_Pal_C_OnClickPalList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_OnClickPalList, Temp_int_Array_Index_Variable_1) == 0x00005C, "Member 'WBP_Buildup_Pal_C_OnClickPalList::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_OnClickPalList, CallFunc_IsValid_ReturnValue_2) == 0x000060, "Member 'WBP_Buildup_Pal_C_OnClickPalList::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_OnClickPalList, CallFunc_Array_Get_Item) == 0x000068, "Member 'WBP_Buildup_Pal_C_OnClickPalList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_OnClickPalList, CallFunc_IsVisible_ReturnValue) == 0x000070, "Member 'WBP_Buildup_Pal_C_OnClickPalList::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_OnClickPalList, CallFunc_Array_Get_Item_1) == 0x000078, "Member 'WBP_Buildup_Pal_C_OnClickPalList::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_OnClickPalList, CallFunc_GetFocusTarget_Widget) == 0x000080, "Member 'WBP_Buildup_Pal_C_OnClickPalList::CallFunc_GetFocusTarget_Widget' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_OnClickPalList, CallFunc_IsVisible_ReturnValue_1) == 0x000088, "Member 'WBP_Buildup_Pal_C_OnClickPalList::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_OnClickPalList, CallFunc_GetBindedHandle_targetHandle) == 0x000090, "Member 'WBP_Buildup_Pal_C_OnClickPalList::CallFunc_GetBindedHandle_targetHandle' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_OnClickPalList, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000098, "Member 'WBP_Buildup_Pal_C_OnClickPalList::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_OnClickPalList, CallFunc_Array_Length_ReturnValue_1) == 0x00009C, "Member 'WBP_Buildup_Pal_C_OnClickPalList::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_OnClickPalList, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A0, "Member 'WBP_Buildup_Pal_C_OnClickPalList::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_Buildup_Pal.WBP_Buildup_Pal_C.OnHoverPalList
// 0x0008 (0x0008 - 0x0000)
struct WBP_Buildup_Pal_C_OnHoverPalList final
{
public:
	class UPalIndividualCharacterHandle*          Handle;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Buildup_Pal_C_OnHoverPalList) == 0x000008, "Wrong alignment on WBP_Buildup_Pal_C_OnHoverPalList");
static_assert(sizeof(WBP_Buildup_Pal_C_OnHoverPalList) == 0x000008, "Wrong size on WBP_Buildup_Pal_C_OnHoverPalList");
static_assert(offsetof(WBP_Buildup_Pal_C_OnHoverPalList, Handle) == 0x000000, "Member 'WBP_Buildup_Pal_C_OnHoverPalList::Handle' has a wrong offset!");

// Function WBP_Buildup_Pal.WBP_Buildup_Pal_C.ReciveResult
// 0x0002 (0x0002 - 0x0000)
struct WBP_Buildup_Pal_C_ReciveResult final
{
public:
	EPalCharacterStatusOperationResult            Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Buildup_Pal_C_ReciveResult) == 0x000001, "Wrong alignment on WBP_Buildup_Pal_C_ReciveResult");
static_assert(sizeof(WBP_Buildup_Pal_C_ReciveResult) == 0x000002, "Wrong size on WBP_Buildup_Pal_C_ReciveResult");
static_assert(offsetof(WBP_Buildup_Pal_C_ReciveResult, Result) == 0x000000, "Member 'WBP_Buildup_Pal_C_ReciveResult::Result' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_ReciveResult, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'WBP_Buildup_Pal_C_ReciveResult::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_Buildup_Pal.WBP_Buildup_Pal_C.Refresh Info
// 0x0008 (0x0008 - 0x0000)
struct WBP_Buildup_Pal_C_Refresh_Info final
{
public:
	class UPalIndividualCharacterParameter*       CallFunc_TryGetIndividualParameter_ReturnValue;    // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Buildup_Pal_C_Refresh_Info) == 0x000008, "Wrong alignment on WBP_Buildup_Pal_C_Refresh_Info");
static_assert(sizeof(WBP_Buildup_Pal_C_Refresh_Info) == 0x000008, "Wrong size on WBP_Buildup_Pal_C_Refresh_Info");
static_assert(offsetof(WBP_Buildup_Pal_C_Refresh_Info, CallFunc_TryGetIndividualParameter_ReturnValue) == 0x000000, "Member 'WBP_Buildup_Pal_C_Refresh_Info::CallFunc_TryGetIndividualParameter_ReturnValue' has a wrong offset!");

// Function WBP_Buildup_Pal.WBP_Buildup_Pal_C.Setup
// 0x01F0 (0x01F0 - 0x0000)
struct WBP_Buildup_Pal_C_Setup final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49C0[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalNetworkCharacterStatusOperationComponent* CallFunc_NetCharacterStatusOperation_ReturnValue;  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPalCharacterStatusOperationResult Result)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPalCharacterStatusOperationName Status, int32 TargetRank)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue;        // 0x0080(0x0004)(NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49C1[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Index)>                  K2Node_CreateDelegate_OutputDelegate_5;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Index)>                  K2Node_CreateDelegate_OutputDelegate_6;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue_1;      // 0x00D8(0x0004)(NoDestructor)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue_2;      // 0x00DC(0x0004)(NoDestructor)
	TDelegate<void(class UPalIndividualCharacterHandle* Handle)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x00E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49C2[0x3];                                     // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x00F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49C3[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0100(0x0010)(ReferenceParm)
	class UWBP_Buildup_Pal_Item_C*                CallFunc_Array_Get_Item_1;                         // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPalStaticItemIdAndNum>         CallFunc_CollectLocalPlayerControllableItemInfos_OutItemInfos; // 0x0118(0x0010)(ReferenceParm)
	struct FPalStaticItemIdAndNum                 CallFunc_Array_Get_Item_2;                         // 0x0128(0x000C)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49C4[0x3];                                     // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49C5[0x4];                                     // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             CallFunc_GetCharacterUpgradeDataTable_ReturnValue; // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0150(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0160(0x0010)(ReferenceParm)
	TDelegate<void(class UPalIndividualCharacterHandle* Handle)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x0170(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_3;                         // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49C6[0x4];                                     // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPalCharacterUpgradeMasterData         CallFunc_GetDataTableRowFromName_OutRow;           // 0x0190(0x0020)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49C7[0x1];                                     // 0x01B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalOtomoHolderComponentBase*           CallFunc_GetOtomoHolderComponent_ReturnValue;      // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Menu_PalList_C*                    CallFunc_Array_Get_Item_4;                         // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UPalIndividualCharacterSlot*>    CallFunc_GetSlots_Slots;                           // 0x01C8(0x0010)(ReferenceParm)
	class UPalIndividualCharacterSlot*            CallFunc_Array_Get_Item_5;                         // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49C8[0x2];                                     // 0x01E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Buildup_Pal_C_Setup) == 0x000008, "Wrong alignment on WBP_Buildup_Pal_C_Setup");
static_assert(sizeof(WBP_Buildup_Pal_C_Setup) == 0x0001F0, "Wrong size on WBP_Buildup_Pal_C_Setup");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_Buildup_Pal_C_Setup::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Buildup_Pal_C_Setup::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'WBP_Buildup_Pal_C_Setup::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'WBP_Buildup_Pal_C_Setup::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, Temp_int_Array_Index_Variable_2) == 0x000018, "Member 'WBP_Buildup_Pal_C_Setup::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_NetCharacterStatusOperation_ReturnValue) == 0x000020, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_NetCharacterStatusOperation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'WBP_Buildup_Pal_C_Setup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'WBP_Buildup_Pal_C_Setup::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, K2Node_CreateDelegate_OutputDelegate_2) == 0x000050, "Member 'WBP_Buildup_Pal_C_Setup::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, K2Node_CreateDelegate_OutputDelegate_3) == 0x000060, "Member 'WBP_Buildup_Pal_C_Setup::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, K2Node_CreateDelegate_OutputDelegate_4) == 0x000070, "Member 'WBP_Buildup_Pal_C_Setup::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_RegisterActionBinding_ReturnValue) == 0x000080, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_RegisterActionBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, Temp_byte_Variable) == 0x000084, "Member 'WBP_Buildup_Pal_C_Setup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, K2Node_CreateDelegate_OutputDelegate_5) == 0x000088, "Member 'WBP_Buildup_Pal_C_Setup::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, K2Node_CreateDelegate_OutputDelegate_6) == 0x000098, "Member 'WBP_Buildup_Pal_C_Setup::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000A8, "Member 'WBP_Buildup_Pal_C_Setup::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, K2Node_CreateDelegate_OutputDelegate_8) == 0x0000B8, "Member 'WBP_Buildup_Pal_C_Setup::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_MakeLiteralName_ReturnValue) == 0x0000C8, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_MakeLiteralName_ReturnValue_1) == 0x0000D0, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_RegisterActionBinding_ReturnValue_1) == 0x0000D8, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_RegisterActionBinding_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_RegisterActionBinding_ReturnValue_2) == 0x0000DC, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_RegisterActionBinding_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, K2Node_CreateDelegate_OutputDelegate_9) == 0x0000E0, "Member 'WBP_Buildup_Pal_C_Setup::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, Temp_byte_Variable_1) == 0x0000F0, "Member 'WBP_Buildup_Pal_C_Setup::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_Array_Get_Item) == 0x0000F4, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, K2Node_MakeArray_Array) == 0x000100, "Member 'WBP_Buildup_Pal_C_Setup::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_Array_Get_Item_1) == 0x000110, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_CollectLocalPlayerControllableItemInfos_OutItemInfos) == 0x000118, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_CollectLocalPlayerControllableItemInfos_OutItemInfos' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_Array_Get_Item_2) == 0x000128, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_Array_Length_ReturnValue) == 0x000134, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, Temp_int_Loop_Counter_Variable_2) == 0x000138, "Member 'WBP_Buildup_Pal_C_Setup::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_Less_IntInt_ReturnValue) == 0x00013C, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_Add_IntInt_ReturnValue_2) == 0x000140, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_GetCharacterUpgradeDataTable_ReturnValue) == 0x000148, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_GetCharacterUpgradeDataTable_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, K2Node_CreateDelegate_OutputDelegate_10) == 0x000150, "Member 'WBP_Buildup_Pal_C_Setup::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000160, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, K2Node_CreateDelegate_OutputDelegate_11) == 0x000170, "Member 'WBP_Buildup_Pal_C_Setup::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_Array_Get_Item_3) == 0x000180, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_Array_Length_ReturnValue_1) == 0x000188, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_GetDataTableRowFromName_OutRow) == 0x000190, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0001B0, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001B1, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, Temp_bool_Variable) == 0x0001B2, "Member 'WBP_Buildup_Pal_C_Setup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_Array_AddUnique_ReturnValue) == 0x0001B4, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_GetOtomoHolderComponent_ReturnValue) == 0x0001B8, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_GetOtomoHolderComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_Array_Get_Item_4) == 0x0001C0, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_GetSlots_Slots) == 0x0001C8, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_GetSlots_Slots' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_Array_Get_Item_5) == 0x0001D8, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_IsEmpty_ReturnValue) == 0x0001E0, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, K2Node_Select_Default) == 0x0001E1, "Member 'WBP_Buildup_Pal_C_Setup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_Array_Length_ReturnValue_2) == 0x0001E4, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_Setup, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001E8, "Member 'WBP_Buildup_Pal_C_Setup::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

// Function WBP_Buildup_Pal.WBP_Buildup_Pal_C.SwitchTab
// 0x0004 (0x0004 - 0x0000)
struct WBP_Buildup_Pal_C_SwitchTab final
{
public:
	int32                                         Tab;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Buildup_Pal_C_SwitchTab) == 0x000004, "Wrong alignment on WBP_Buildup_Pal_C_SwitchTab");
static_assert(sizeof(WBP_Buildup_Pal_C_SwitchTab) == 0x000004, "Wrong size on WBP_Buildup_Pal_C_SwitchTab");
static_assert(offsetof(WBP_Buildup_Pal_C_SwitchTab, Tab) == 0x000000, "Member 'WBP_Buildup_Pal_C_SwitchTab::Tab' has a wrong offset!");

// Function WBP_Buildup_Pal.WBP_Buildup_Pal_C.UpdateItemInfo
// 0x0068 (0x0068 - 0x0000)
struct WBP_Buildup_Pal_C_UpdateItemInfo final
{
public:
	TArray<struct FPalStaticItemIdAndNum>         TempItemMap;                                       // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49C9[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
	TArray<struct FPalStaticItemIdAndNum>         CallFunc_CollectLocalPlayerControllableItemInfos_OutItemInfos; // 0x0038(0x0010)(ReferenceParm)
	struct FPalStaticItemIdAndNum                 CallFunc_Array_Get_Item_1;                         // 0x0048(0x000C)(NoDestructor)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49CA[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Buildup_Pal_Item_C*                CallFunc_Array_Get_Item_2;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Buildup_Pal_C_UpdateItemInfo) == 0x000008, "Wrong alignment on WBP_Buildup_Pal_C_UpdateItemInfo");
static_assert(sizeof(WBP_Buildup_Pal_C_UpdateItemInfo) == 0x000068, "Wrong size on WBP_Buildup_Pal_C_UpdateItemInfo");
static_assert(offsetof(WBP_Buildup_Pal_C_UpdateItemInfo, TempItemMap) == 0x000000, "Member 'WBP_Buildup_Pal_C_UpdateItemInfo::TempItemMap' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_UpdateItemInfo, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_Buildup_Pal_C_UpdateItemInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_UpdateItemInfo, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_Buildup_Pal_C_UpdateItemInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_UpdateItemInfo, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Buildup_Pal_C_UpdateItemInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_UpdateItemInfo, CallFunc_Array_Get_Item) == 0x00001C, "Member 'WBP_Buildup_Pal_C_UpdateItemInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_UpdateItemInfo, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'WBP_Buildup_Pal_C_UpdateItemInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_UpdateItemInfo, K2Node_MakeArray_Array) == 0x000028, "Member 'WBP_Buildup_Pal_C_UpdateItemInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_UpdateItemInfo, CallFunc_CollectLocalPlayerControllableItemInfos_OutItemInfos) == 0x000038, "Member 'WBP_Buildup_Pal_C_UpdateItemInfo::CallFunc_CollectLocalPlayerControllableItemInfos_OutItemInfos' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_UpdateItemInfo, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'WBP_Buildup_Pal_C_UpdateItemInfo::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_UpdateItemInfo, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000054, "Member 'WBP_Buildup_Pal_C_UpdateItemInfo::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_UpdateItemInfo, CallFunc_Array_Get_Item_2) == 0x000058, "Member 'WBP_Buildup_Pal_C_UpdateItemInfo::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_UpdateItemInfo, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'WBP_Buildup_Pal_C_UpdateItemInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_UpdateItemInfo, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'WBP_Buildup_Pal_C_UpdateItemInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Buildup_Pal.WBP_Buildup_Pal_C.BP_GetDesiredFocusTarget
// 0x0018 (0x0018 - 0x0000)
struct WBP_Buildup_Pal_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetFocusTarget_Widget;                    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Buildup_Pal_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_Buildup_Pal_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_Buildup_Pal_C_BP_GetDesiredFocusTarget) == 0x000018, "Wrong size on WBP_Buildup_Pal_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_Buildup_Pal_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_Buildup_Pal_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_BP_GetDesiredFocusTarget, CallFunc_GetFocusTarget_Widget) == 0x000008, "Member 'WBP_Buildup_Pal_C_BP_GetDesiredFocusTarget::CallFunc_GetFocusTarget_Widget' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_C_BP_GetDesiredFocusTarget, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_Buildup_Pal_C_BP_GetDesiredFocusTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

