#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Buildup_TabButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Buildup_TabButton.WBP_Buildup_TabButton_C
// 0x0038 (0x02B0 - 0x0278)
class UWBP_Buildup_TabButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anm_NormalToFocus;                                 // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     BP_PalTextBlock_Name;                              // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalCommonButton_C*                 WBP_PalCommonButton;                               // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsActive;                                          // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4257[0x3];                                     // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Index_WBP_Buildup_TabButton_C;                     // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             SwitchTabTo;                                       // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_OptionSettings_TabButton_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WBP_Buildup_TabButton(int32 EntryPoint);
	void SetName(const class FText& Param_Name, int32 Param_Index);
	void SetTabActive(bool Active);
	void SwitchTabTo__DelegateSignature(int32 Param_Index);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Buildup_TabButton_C">();
	}
	static class UWBP_Buildup_TabButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Buildup_TabButton_C>();
	}
};
static_assert(alignof(UWBP_Buildup_TabButton_C) == 0x000008, "Wrong alignment on UWBP_Buildup_TabButton_C");
static_assert(sizeof(UWBP_Buildup_TabButton_C) == 0x0002B0, "Wrong size on UWBP_Buildup_TabButton_C");
static_assert(offsetof(UWBP_Buildup_TabButton_C, UberGraphFrame) == 0x000278, "Member 'UWBP_Buildup_TabButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_TabButton_C, Anm_NormalToFocus) == 0x000280, "Member 'UWBP_Buildup_TabButton_C::Anm_NormalToFocus' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_TabButton_C, BP_PalTextBlock_Name) == 0x000288, "Member 'UWBP_Buildup_TabButton_C::BP_PalTextBlock_Name' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_TabButton_C, WBP_PalCommonButton) == 0x000290, "Member 'UWBP_Buildup_TabButton_C::WBP_PalCommonButton' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_TabButton_C, IsActive) == 0x000298, "Member 'UWBP_Buildup_TabButton_C::IsActive' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_TabButton_C, Index_WBP_Buildup_TabButton_C) == 0x00029C, "Member 'UWBP_Buildup_TabButton_C::Index_WBP_Buildup_TabButton_C' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_TabButton_C, SwitchTabTo) == 0x0002A0, "Member 'UWBP_Buildup_TabButton_C::SwitchTabTo' has a wrong offset!");

}

