#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenu_Technology_Point

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MainMenu_Technology_Point.WBP_MainMenu_Technology_Point_C
// 0x0078 (0x02F0 - 0x0278)
class UWBP_MainMenu_Technology_Point_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anm_Boss;                                          // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anm_Normal;                                        // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anm_Blink;                                         // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anm_EnableToDisable;                               // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BlinkEff_2;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     BP_PalTextBlock_Title;                             // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon_TechPoint_0;                            // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon_TechPoint_1;                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_Point;                                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsBossTechPoint;                                   // 0x02C8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E1[0x7];                                     // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    NormalMsgId;                                       // 0x02D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    BossMsgId;                                         // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void AnmEvent_DIsable();
	void AnmEvent_Enable();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_MainMenu_Technology_Point(int32 EntryPoint);
	void OnUpdateTechnologyPoint(int32 TechnologyPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MainMenu_Technology_Point_C">();
	}
	static class UWBP_MainMenu_Technology_Point_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MainMenu_Technology_Point_C>();
	}
};
static_assert(alignof(UWBP_MainMenu_Technology_Point_C) == 0x000008, "Wrong alignment on UWBP_MainMenu_Technology_Point_C");
static_assert(sizeof(UWBP_MainMenu_Technology_Point_C) == 0x0002F0, "Wrong size on UWBP_MainMenu_Technology_Point_C");
static_assert(offsetof(UWBP_MainMenu_Technology_Point_C, UberGraphFrame) == 0x000278, "Member 'UWBP_MainMenu_Technology_Point_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_Point_C, Anm_Boss) == 0x000280, "Member 'UWBP_MainMenu_Technology_Point_C::Anm_Boss' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_Point_C, Anm_Normal) == 0x000288, "Member 'UWBP_MainMenu_Technology_Point_C::Anm_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_Point_C, Anm_Blink) == 0x000290, "Member 'UWBP_MainMenu_Technology_Point_C::Anm_Blink' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_Point_C, Anm_EnableToDisable) == 0x000298, "Member 'UWBP_MainMenu_Technology_Point_C::Anm_EnableToDisable' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_Point_C, BlinkEff_2) == 0x0002A0, "Member 'UWBP_MainMenu_Technology_Point_C::BlinkEff_2' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_Point_C, BP_PalTextBlock_Title) == 0x0002A8, "Member 'UWBP_MainMenu_Technology_Point_C::BP_PalTextBlock_Title' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_Point_C, Image_Icon_TechPoint_0) == 0x0002B0, "Member 'UWBP_MainMenu_Technology_Point_C::Image_Icon_TechPoint_0' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_Point_C, Image_Icon_TechPoint_1) == 0x0002B8, "Member 'UWBP_MainMenu_Technology_Point_C::Image_Icon_TechPoint_1' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_Point_C, Text_Point) == 0x0002C0, "Member 'UWBP_MainMenu_Technology_Point_C::Text_Point' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_Point_C, IsBossTechPoint) == 0x0002C8, "Member 'UWBP_MainMenu_Technology_Point_C::IsBossTechPoint' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_Point_C, NormalMsgId) == 0x0002D0, "Member 'UWBP_MainMenu_Technology_Point_C::NormalMsgId' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_Point_C, BossMsgId) == 0x0002E0, "Member 'UWBP_MainMenu_Technology_Point_C::BossMsgId' has a wrong offset!");

}

