#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InventoryEquipment_InventoryTabButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Pal_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InventoryEquipment_InventoryTabButton.WBP_InventoryEquipment_InventoryTabButton_C
// 0x0058 (0x02D0 - 0x0278)
class UWBP_InventoryEquipment_InventoryTabButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anm_NormalToFocus;                                 // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 TabBase;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_Main;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalInvisibleButton_C*              WBP_PalInvisibleButton;                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    MsgId;                                             // 0x02A0(0x0010)(Edit, BlueprintVisible, NoDestructor)
	TArray<EPalPlayerInventoryType>               BindedInventoryType;                               // 0x02B0(0x0010)(Edit, BlueprintVisible)
	FMulticastInlineDelegateProperty_             OnClicked;                                         // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void AnmEvent_Focus();
	void AnmEvent_Normal();
	void BndEvt__WBP_InventoryEquipment_InventoryTabButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Construct();
	void ExecuteUbergraph_WBP_InventoryEquipment_InventoryTabButton(int32 EntryPoint);
	void OnClicked__DelegateSignature(class UWBP_InventoryEquipment_InventoryTabButton_C* Button);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_InventoryEquipment_InventoryTabButton_C">();
	}
	static class UWBP_InventoryEquipment_InventoryTabButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InventoryEquipment_InventoryTabButton_C>();
	}
};
static_assert(alignof(UWBP_InventoryEquipment_InventoryTabButton_C) == 0x000008, "Wrong alignment on UWBP_InventoryEquipment_InventoryTabButton_C");
static_assert(sizeof(UWBP_InventoryEquipment_InventoryTabButton_C) == 0x0002D0, "Wrong size on UWBP_InventoryEquipment_InventoryTabButton_C");
static_assert(offsetof(UWBP_InventoryEquipment_InventoryTabButton_C, UberGraphFrame) == 0x000278, "Member 'UWBP_InventoryEquipment_InventoryTabButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_InventoryTabButton_C, Anm_NormalToFocus) == 0x000280, "Member 'UWBP_InventoryEquipment_InventoryTabButton_C::Anm_NormalToFocus' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_InventoryTabButton_C, TabBase) == 0x000288, "Member 'UWBP_InventoryEquipment_InventoryTabButton_C::TabBase' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_InventoryTabButton_C, Text_Main) == 0x000290, "Member 'UWBP_InventoryEquipment_InventoryTabButton_C::Text_Main' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_InventoryTabButton_C, WBP_PalInvisibleButton) == 0x000298, "Member 'UWBP_InventoryEquipment_InventoryTabButton_C::WBP_PalInvisibleButton' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_InventoryTabButton_C, MsgId) == 0x0002A0, "Member 'UWBP_InventoryEquipment_InventoryTabButton_C::MsgId' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_InventoryTabButton_C, BindedInventoryType) == 0x0002B0, "Member 'UWBP_InventoryEquipment_InventoryTabButton_C::BindedInventoryType' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_InventoryTabButton_C, OnClicked) == 0x0002C0, "Member 'UWBP_InventoryEquipment_InventoryTabButton_C::OnClicked' has a wrong offset!");

}

