#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_CharacterHPGauge

#include "Basic.hpp"

#include "Pal_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_CharacterHPGauge.WBP_Menu_CharacterHPGauge_C.ExecuteUbergraph_WBP_Menu_CharacterHPGauge
// 0x0014 (0x0014 - 0x0000)
struct WBP_Menu_CharacterHPGauge_C_ExecuteUbergraph_WBP_Menu_CharacterHPGauge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFixedPoint64& NowHP, const struct FFixedPoint64& NowMaxHP)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_CharacterHPGauge_C_ExecuteUbergraph_WBP_Menu_CharacterHPGauge) == 0x000004, "Wrong alignment on WBP_Menu_CharacterHPGauge_C_ExecuteUbergraph_WBP_Menu_CharacterHPGauge");
static_assert(sizeof(WBP_Menu_CharacterHPGauge_C_ExecuteUbergraph_WBP_Menu_CharacterHPGauge) == 0x000014, "Wrong size on WBP_Menu_CharacterHPGauge_C_ExecuteUbergraph_WBP_Menu_CharacterHPGauge");
static_assert(offsetof(WBP_Menu_CharacterHPGauge_C_ExecuteUbergraph_WBP_Menu_CharacterHPGauge, EntryPoint) == 0x000000, "Member 'WBP_Menu_CharacterHPGauge_C_ExecuteUbergraph_WBP_Menu_CharacterHPGauge::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterHPGauge_C_ExecuteUbergraph_WBP_Menu_CharacterHPGauge, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Menu_CharacterHPGauge_C_ExecuteUbergraph_WBP_Menu_CharacterHPGauge::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_Menu_CharacterHPGauge.WBP_Menu_CharacterHPGauge_C.UpdateHP
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_Menu_CharacterHPGauge_C_UpdateHP final
{
public:
	struct FFixedPoint64                          NowHP;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FFixedPoint64                          NowMaxHP;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	int64                                         CallFunc_Convert_FixedPoint64ToInt64_ReturnValue;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Convert_FixedPoint64ToFloat_ReturnValue;  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5848[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_Int64ToText_ReturnValue;             // 0x0020(0x0018)()
	int64                                         CallFunc_Convert_FixedPoint64ToInt64_ReturnValue_1; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_Int64ToText_ReturnValue_1;           // 0x0090(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm)
	float                                         CallFunc_Convert_FixedPoint64ToFloat_ReturnValue_1; // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5849[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C0(0x0018)()
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_CharacterHPGauge_C_UpdateHP) == 0x000008, "Wrong alignment on WBP_Menu_CharacterHPGauge_C_UpdateHP");
static_assert(sizeof(WBP_Menu_CharacterHPGauge_C_UpdateHP) == 0x0000F8, "Wrong size on WBP_Menu_CharacterHPGauge_C_UpdateHP");
static_assert(offsetof(WBP_Menu_CharacterHPGauge_C_UpdateHP, NowHP) == 0x000000, "Member 'WBP_Menu_CharacterHPGauge_C_UpdateHP::NowHP' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterHPGauge_C_UpdateHP, NowMaxHP) == 0x000008, "Member 'WBP_Menu_CharacterHPGauge_C_UpdateHP::NowMaxHP' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterHPGauge_C_UpdateHP, CallFunc_Convert_FixedPoint64ToInt64_ReturnValue) == 0x000010, "Member 'WBP_Menu_CharacterHPGauge_C_UpdateHP::CallFunc_Convert_FixedPoint64ToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterHPGauge_C_UpdateHP, CallFunc_Convert_FixedPoint64ToFloat_ReturnValue) == 0x000018, "Member 'WBP_Menu_CharacterHPGauge_C_UpdateHP::CallFunc_Convert_FixedPoint64ToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterHPGauge_C_UpdateHP, CallFunc_Conv_Int64ToText_ReturnValue) == 0x000020, "Member 'WBP_Menu_CharacterHPGauge_C_UpdateHP::CallFunc_Conv_Int64ToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterHPGauge_C_UpdateHP, CallFunc_Convert_FixedPoint64ToInt64_ReturnValue_1) == 0x000038, "Member 'WBP_Menu_CharacterHPGauge_C_UpdateHP::CallFunc_Convert_FixedPoint64ToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterHPGauge_C_UpdateHP, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'WBP_Menu_CharacterHPGauge_C_UpdateHP::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterHPGauge_C_UpdateHP, CallFunc_Conv_Int64ToText_ReturnValue_1) == 0x000090, "Member 'WBP_Menu_CharacterHPGauge_C_UpdateHP::CallFunc_Conv_Int64ToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterHPGauge_C_UpdateHP, K2Node_MakeArray_Array) == 0x0000A8, "Member 'WBP_Menu_CharacterHPGauge_C_UpdateHP::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterHPGauge_C_UpdateHP, CallFunc_Convert_FixedPoint64ToFloat_ReturnValue_1) == 0x0000B8, "Member 'WBP_Menu_CharacterHPGauge_C_UpdateHP::CallFunc_Convert_FixedPoint64ToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterHPGauge_C_UpdateHP, CallFunc_Format_ReturnValue) == 0x0000C0, "Member 'WBP_Menu_CharacterHPGauge_C_UpdateHP::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterHPGauge_C_UpdateHP, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000D8, "Member 'WBP_Menu_CharacterHPGauge_C_UpdateHP::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterHPGauge_C_UpdateHP, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x0000E0, "Member 'WBP_Menu_CharacterHPGauge_C_UpdateHP::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterHPGauge_C_UpdateHP, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x0000E8, "Member 'WBP_Menu_CharacterHPGauge_C_UpdateHP::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Menu_CharacterHPGauge_C_UpdateHP, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x0000F0, "Member 'WBP_Menu_CharacterHPGauge_C_UpdateHP::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

}

