#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenu_Tab

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_MainMenu_Tab.WBP_MainMenu_Tab_C.AnmEvent_FirstOpen
// 0x0001 (0x0001 - 0x0000)
struct WBP_MainMenu_Tab_C_AnmEvent_FirstOpen final
{
public:
	bool                                          IsFocused;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Tab_C_AnmEvent_FirstOpen) == 0x000001, "Wrong alignment on WBP_MainMenu_Tab_C_AnmEvent_FirstOpen");
static_assert(sizeof(WBP_MainMenu_Tab_C_AnmEvent_FirstOpen) == 0x000001, "Wrong size on WBP_MainMenu_Tab_C_AnmEvent_FirstOpen");
static_assert(offsetof(WBP_MainMenu_Tab_C_AnmEvent_FirstOpen, IsFocused) == 0x000000, "Member 'WBP_MainMenu_Tab_C_AnmEvent_FirstOpen::IsFocused' has a wrong offset!");

// Function WBP_MainMenu_Tab.WBP_MainMenu_Tab_C.BndEvt__WBP_MainMenu_Tab_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MainMenu_Tab_C_BndEvt__WBP_MainMenu_Tab_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Tab_C_BndEvt__WBP_MainMenu_Tab_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MainMenu_Tab_C_BndEvt__WBP_MainMenu_Tab_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_MainMenu_Tab_C_BndEvt__WBP_MainMenu_Tab_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_MainMenu_Tab_C_BndEvt__WBP_MainMenu_Tab_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_MainMenu_Tab_C_BndEvt__WBP_MainMenu_Tab_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_MainMenu_Tab_C_BndEvt__WBP_MainMenu_Tab_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MainMenu_Tab.WBP_MainMenu_Tab_C.ExecuteUbergraph_WBP_MainMenu_Tab
// 0x0060 (0x0060 - 0x0000)
struct WBP_MainMenu_Tab_C_ExecuteUbergraph_WBP_MainMenu_Tab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_isFocused;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FAD[0x3];                                      // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    CallFunc_Map_Find_Value;                           // 0x0028(0x0010)(NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FAE[0x7];                                      // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text;          // 0x0040(0x0018)()
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Tab_C_ExecuteUbergraph_WBP_MainMenu_Tab) == 0x000008, "Wrong alignment on WBP_MainMenu_Tab_C_ExecuteUbergraph_WBP_MainMenu_Tab");
static_assert(sizeof(WBP_MainMenu_Tab_C_ExecuteUbergraph_WBP_MainMenu_Tab) == 0x000060, "Wrong size on WBP_MainMenu_Tab_C_ExecuteUbergraph_WBP_MainMenu_Tab");
static_assert(offsetof(WBP_MainMenu_Tab_C_ExecuteUbergraph_WBP_MainMenu_Tab, EntryPoint) == 0x000000, "Member 'WBP_MainMenu_Tab_C_ExecuteUbergraph_WBP_MainMenu_Tab::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Tab_C_ExecuteUbergraph_WBP_MainMenu_Tab, K2Node_CustomEvent_isFocused) == 0x000004, "Member 'WBP_MainMenu_Tab_C_ExecuteUbergraph_WBP_MainMenu_Tab::K2Node_CustomEvent_isFocused' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Tab_C_ExecuteUbergraph_WBP_MainMenu_Tab, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_MainMenu_Tab_C_ExecuteUbergraph_WBP_MainMenu_Tab::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Tab_C_ExecuteUbergraph_WBP_MainMenu_Tab, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_MainMenu_Tab_C_ExecuteUbergraph_WBP_MainMenu_Tab::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Tab_C_ExecuteUbergraph_WBP_MainMenu_Tab, CallFunc_PlayAnimation_ReturnValue_2) == 0x000018, "Member 'WBP_MainMenu_Tab_C_ExecuteUbergraph_WBP_MainMenu_Tab::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Tab_C_ExecuteUbergraph_WBP_MainMenu_Tab, CallFunc_PlayAnimation_ReturnValue_3) == 0x000020, "Member 'WBP_MainMenu_Tab_C_ExecuteUbergraph_WBP_MainMenu_Tab::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Tab_C_ExecuteUbergraph_WBP_MainMenu_Tab, CallFunc_Map_Find_Value) == 0x000028, "Member 'WBP_MainMenu_Tab_C_ExecuteUbergraph_WBP_MainMenu_Tab::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Tab_C_ExecuteUbergraph_WBP_MainMenu_Tab, CallFunc_Map_Find_ReturnValue) == 0x000038, "Member 'WBP_MainMenu_Tab_C_ExecuteUbergraph_WBP_MainMenu_Tab::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Tab_C_ExecuteUbergraph_WBP_MainMenu_Tab, CallFunc_GetLocalizedTextFromHandle_Text) == 0x000040, "Member 'WBP_MainMenu_Tab_C_ExecuteUbergraph_WBP_MainMenu_Tab::CallFunc_GetLocalizedTextFromHandle_Text' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Tab_C_ExecuteUbergraph_WBP_MainMenu_Tab, K2Node_ComponentBoundEvent_Button) == 0x000058, "Member 'WBP_MainMenu_Tab_C_ExecuteUbergraph_WBP_MainMenu_Tab::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function WBP_MainMenu_Tab.WBP_MainMenu_Tab_C.OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MainMenu_Tab_C_OnClicked__DelegateSignature final
{
public:
	class UWBP_MainMenu_Tab_C*                    SelfWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Tab_C_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MainMenu_Tab_C_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_MainMenu_Tab_C_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_MainMenu_Tab_C_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_MainMenu_Tab_C_OnClicked__DelegateSignature, SelfWidget) == 0x000000, "Member 'WBP_MainMenu_Tab_C_OnClicked__DelegateSignature::SelfWidget' has a wrong offset!");

// Function WBP_MainMenu_Tab.WBP_MainMenu_Tab_C.SetEnableAttentionDot
// 0x0001 (0x0001 - 0x0000)
struct WBP_MainMenu_Tab_C_SetEnableAttentionDot final
{
public:
	bool                                          IsEnable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Tab_C_SetEnableAttentionDot) == 0x000001, "Wrong alignment on WBP_MainMenu_Tab_C_SetEnableAttentionDot");
static_assert(sizeof(WBP_MainMenu_Tab_C_SetEnableAttentionDot) == 0x000001, "Wrong size on WBP_MainMenu_Tab_C_SetEnableAttentionDot");
static_assert(offsetof(WBP_MainMenu_Tab_C_SetEnableAttentionDot, IsEnable) == 0x000000, "Member 'WBP_MainMenu_Tab_C_SetEnableAttentionDot::IsEnable' has a wrong offset!");

}

