#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IngameMenu_Chest_Filter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_IngameMenu_Chest_Filter.WBP_IngameMenu_Chest_Filter_C
// 0x00F8 (0x0370 - 0x0278)
class UWBP_IngameMenu_Chest_Filter_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image;                                             // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_251;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonButton_1_C*                  WBP_CommonButton_CheckAll;                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonButton_1_C*                  WBP_CommonButton_UncheckAll;                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenu_Chest_FilterContent_C*  WBP_IngameMenu_Chest_FilterContent;                // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenu_Chest_FilterContent_C*  WBP_IngameMenu_Chest_FilterContent_1;              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenu_Chest_FilterContent_C*  WBP_IngameMenu_Chest_FilterContent_2;              // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenu_Chest_FilterContent_C*  WBP_IngameMenu_Chest_FilterContent_3;              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenu_Chest_FilterContent_C*  WBP_IngameMenu_Chest_FilterContent_4;              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenu_Chest_FilterContent_C*  WBP_IngameMenu_Chest_FilterContent_5;              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenu_Chest_FilterContent_C*  WBP_IngameMenu_Chest_FilterContent_6;              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenu_Chest_FilterContent_C*  WBP_IngameMenu_Chest_FilterContent_7;              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenu_Chest_FilterContent_C*  WBP_IngameMenu_Chest_FilterContent_8;              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenu_Chest_FilterContent_C*  WBP_IngameMenu_Chest_FilterContent_9;              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenu_Chest_FilterContent_C*  WBP_IngameMenu_Chest_FilterContent_10;             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenu_Chest_FilterContent_C*  WBP_IngameMenu_Chest_FilterContent_11;             // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenu_Chest_FilterContent_C*  WBP_IngameMenu_Chest_FilterContent_12;             // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_btn_C*                        WBP_Menu_btn;                                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalCommonWindow_C*                 WBP_PalCommonWindow;                               // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WrapBox_FilterList;                                // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnClickedCloseButton;                              // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnClickedAllCheckButton;                           // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnClickedAllUncheckButton;                         // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	class UWBP_IngameMenu_Chest_FilterContent_C* AddContentItem(class FName FilterId, class FName FilterTextId);
	void BndEvt__WBP_IngameMenu_Chest_Filter_WBP_CommonButton_1_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature();
	void BndEvt__WBP_IngameMenu_Chest_Filter_WBP_CommonButton_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature();
	void BndEvt__WBP_IngameMenu_Chest_Filter_WBP_Menu_btn_K2Node_ComponentBoundEvent_0_OnButtonClicked__DelegateSignature();
	void ClearContent();
	void ExecuteUbergraph_WBP_IngameMenu_Chest_Filter(int32 EntryPoint);
	void GetDesiredFocusTarget(class UWidget** NewParam);
	void OnClickedAllCheckButton__DelegateSignature();
	void OnClickedAllUncheckButton__DelegateSignature();
	void OnClickedCloseButton__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_IngameMenu_Chest_Filter_C">();
	}
	static class UWBP_IngameMenu_Chest_Filter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_IngameMenu_Chest_Filter_C>();
	}
};
static_assert(alignof(UWBP_IngameMenu_Chest_Filter_C) == 0x000008, "Wrong alignment on UWBP_IngameMenu_Chest_Filter_C");
static_assert(sizeof(UWBP_IngameMenu_Chest_Filter_C) == 0x000370, "Wrong size on UWBP_IngameMenu_Chest_Filter_C");
static_assert(offsetof(UWBP_IngameMenu_Chest_Filter_C, UberGraphFrame) == 0x000278, "Member 'UWBP_IngameMenu_Chest_Filter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_Filter_C, Image) == 0x000280, "Member 'UWBP_IngameMenu_Chest_Filter_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_Filter_C, Image_1) == 0x000288, "Member 'UWBP_IngameMenu_Chest_Filter_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_Filter_C, Image_2) == 0x000290, "Member 'UWBP_IngameMenu_Chest_Filter_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_Filter_C, Image_3) == 0x000298, "Member 'UWBP_IngameMenu_Chest_Filter_C::Image_3' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_Filter_C, Image_4) == 0x0002A0, "Member 'UWBP_IngameMenu_Chest_Filter_C::Image_4' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_Filter_C, Image_251) == 0x0002A8, "Member 'UWBP_IngameMenu_Chest_Filter_C::Image_251' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_Filter_C, WBP_CommonButton_CheckAll) == 0x0002B0, "Member 'UWBP_IngameMenu_Chest_Filter_C::WBP_CommonButton_CheckAll' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_Filter_C, WBP_CommonButton_UncheckAll) == 0x0002B8, "Member 'UWBP_IngameMenu_Chest_Filter_C::WBP_CommonButton_UncheckAll' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_Filter_C, WBP_IngameMenu_Chest_FilterContent) == 0x0002C0, "Member 'UWBP_IngameMenu_Chest_Filter_C::WBP_IngameMenu_Chest_FilterContent' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_Filter_C, WBP_IngameMenu_Chest_FilterContent_1) == 0x0002C8, "Member 'UWBP_IngameMenu_Chest_Filter_C::WBP_IngameMenu_Chest_FilterContent_1' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_Filter_C, WBP_IngameMenu_Chest_FilterContent_2) == 0x0002D0, "Member 'UWBP_IngameMenu_Chest_Filter_C::WBP_IngameMenu_Chest_FilterContent_2' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_Filter_C, WBP_IngameMenu_Chest_FilterContent_3) == 0x0002D8, "Member 'UWBP_IngameMenu_Chest_Filter_C::WBP_IngameMenu_Chest_FilterContent_3' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_Filter_C, WBP_IngameMenu_Chest_FilterContent_4) == 0x0002E0, "Member 'UWBP_IngameMenu_Chest_Filter_C::WBP_IngameMenu_Chest_FilterContent_4' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_Filter_C, WBP_IngameMenu_Chest_FilterContent_5) == 0x0002E8, "Member 'UWBP_IngameMenu_Chest_Filter_C::WBP_IngameMenu_Chest_FilterContent_5' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_Filter_C, WBP_IngameMenu_Chest_FilterContent_6) == 0x0002F0, "Member 'UWBP_IngameMenu_Chest_Filter_C::WBP_IngameMenu_Chest_FilterContent_6' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_Filter_C, WBP_IngameMenu_Chest_FilterContent_7) == 0x0002F8, "Member 'UWBP_IngameMenu_Chest_Filter_C::WBP_IngameMenu_Chest_FilterContent_7' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_Filter_C, WBP_IngameMenu_Chest_FilterContent_8) == 0x000300, "Member 'UWBP_IngameMenu_Chest_Filter_C::WBP_IngameMenu_Chest_FilterContent_8' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_Filter_C, WBP_IngameMenu_Chest_FilterContent_9) == 0x000308, "Member 'UWBP_IngameMenu_Chest_Filter_C::WBP_IngameMenu_Chest_FilterContent_9' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_Filter_C, WBP_IngameMenu_Chest_FilterContent_10) == 0x000310, "Member 'UWBP_IngameMenu_Chest_Filter_C::WBP_IngameMenu_Chest_FilterContent_10' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_Filter_C, WBP_IngameMenu_Chest_FilterContent_11) == 0x000318, "Member 'UWBP_IngameMenu_Chest_Filter_C::WBP_IngameMenu_Chest_FilterContent_11' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_Filter_C, WBP_IngameMenu_Chest_FilterContent_12) == 0x000320, "Member 'UWBP_IngameMenu_Chest_Filter_C::WBP_IngameMenu_Chest_FilterContent_12' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_Filter_C, WBP_Menu_btn) == 0x000328, "Member 'UWBP_IngameMenu_Chest_Filter_C::WBP_Menu_btn' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_Filter_C, WBP_PalCommonWindow) == 0x000330, "Member 'UWBP_IngameMenu_Chest_Filter_C::WBP_PalCommonWindow' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_Filter_C, WrapBox_FilterList) == 0x000338, "Member 'UWBP_IngameMenu_Chest_Filter_C::WrapBox_FilterList' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_Filter_C, OnClickedCloseButton) == 0x000340, "Member 'UWBP_IngameMenu_Chest_Filter_C::OnClickedCloseButton' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_Filter_C, OnClickedAllCheckButton) == 0x000350, "Member 'UWBP_IngameMenu_Chest_Filter_C::OnClickedAllCheckButton' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_Filter_C, OnClickedAllUncheckButton) == 0x000360, "Member 'UWBP_IngameMenu_Chest_Filter_C::OnClickedAllUncheckButton' has a wrong offset!");

}

