#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PalHudInvader

#include "Basic.hpp"

#include "Pal_structs.hpp"


namespace SDK::Params
{

// Function WBP_PalHudInvader.WBP_PalHudInvader_C.ExecuteUbergraph_WBP_PalHudInvader
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPalDeadInfo& DeadInfo)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49CC[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDDispatchParameterBase*           CallFunc_GetParam_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49CD[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDDispatchParameter_Invader*       K2Node_DynamicCast_AsPal_HUDDispatch_Parameter_Invader; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49CE[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49CF[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          K2Node_DynamicCast_AsPal_Character;                // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49D0[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPalDeadInfo                           K2Node_CustomEvent_DeadInfo;                       // 0x0070(0x0050)(NoDestructor)
};
static_assert(alignof(WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader) == 0x000008, "Wrong alignment on WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader");
static_assert(sizeof(WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader) == 0x0000C0, "Wrong size on WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader");
static_assert(offsetof(WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader, EntryPoint) == 0x000000, "Member 'WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader, CallFunc_GetParam_ReturnValue) == 0x000028, "Member 'WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader::CallFunc_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader, K2Node_DynamicCast_AsPal_HUDDispatch_Parameter_Invader) == 0x000038, "Member 'WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader::K2Node_DynamicCast_AsPal_HUDDispatch_Parameter_Invader' has a wrong offset!");
static_assert(offsetof(WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader, K2Node_CustomEvent_DestroyedActor) == 0x000048, "Member 'WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000050, "Member 'WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000058, "Member 'WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader, K2Node_DynamicCast_AsPal_Character) == 0x000060, "Member 'WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader::K2Node_DynamicCast_AsPal_Character' has a wrong offset!");
static_assert(offsetof(WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader, K2Node_CustomEvent_DeadInfo) == 0x000070, "Member 'WBP_PalHudInvader_C_ExecuteUbergraph_WBP_PalHudInvader::K2Node_CustomEvent_DeadInfo' has a wrong offset!");

// Function WBP_PalHudInvader.WBP_PalHudInvader_C.ParentDeadEvent
// 0x0050 (0x0050 - 0x0000)
struct WBP_PalHudInvader_C_ParentDeadEvent final
{
public:
	struct FPalDeadInfo                           DeadInfo;                                          // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_PalHudInvader_C_ParentDeadEvent) == 0x000008, "Wrong alignment on WBP_PalHudInvader_C_ParentDeadEvent");
static_assert(sizeof(WBP_PalHudInvader_C_ParentDeadEvent) == 0x000050, "Wrong size on WBP_PalHudInvader_C_ParentDeadEvent");
static_assert(offsetof(WBP_PalHudInvader_C_ParentDeadEvent, DeadInfo) == 0x000000, "Member 'WBP_PalHudInvader_C_ParentDeadEvent::DeadInfo' has a wrong offset!");

// Function WBP_PalHudInvader.WBP_PalHudInvader_C.ParentDestroyEvent
// 0x0008 (0x0008 - 0x0000)
struct WBP_PalHudInvader_C_ParentDestroyEvent final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalHudInvader_C_ParentDestroyEvent) == 0x000008, "Wrong alignment on WBP_PalHudInvader_C_ParentDestroyEvent");
static_assert(sizeof(WBP_PalHudInvader_C_ParentDestroyEvent) == 0x000008, "Wrong size on WBP_PalHudInvader_C_ParentDestroyEvent");
static_assert(offsetof(WBP_PalHudInvader_C_ParentDestroyEvent, DestroyedActor) == 0x000000, "Member 'WBP_PalHudInvader_C_ParentDestroyEvent::DestroyedActor' has a wrong offset!");

}

