#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenu_Technology_List

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "F_PalUITechnologyDataMapContent_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Pal_structs.hpp"


namespace SDK::Params
{

// Function WBP_MainMenu_Technology_List.WBP_MainMenu_Technology_List_C.ExecuteUbergraph_WBP_MainMenu_Technology_List
// 0x0018 (0x0018 - 0x0000)
struct WBP_MainMenu_Technology_List_C_ExecuteUbergraph_WBP_MainMenu_Technology_List final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_List_C_ExecuteUbergraph_WBP_MainMenu_Technology_List) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_List_C_ExecuteUbergraph_WBP_MainMenu_Technology_List");
static_assert(sizeof(WBP_MainMenu_Technology_List_C_ExecuteUbergraph_WBP_MainMenu_Technology_List) == 0x000018, "Wrong size on WBP_MainMenu_Technology_List_C_ExecuteUbergraph_WBP_MainMenu_Technology_List");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_ExecuteUbergraph_WBP_MainMenu_Technology_List, EntryPoint) == 0x000000, "Member 'WBP_MainMenu_Technology_List_C_ExecuteUbergraph_WBP_MainMenu_Technology_List::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_ExecuteUbergraph_WBP_MainMenu_Technology_List, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_MainMenu_Technology_List_C_ExecuteUbergraph_WBP_MainMenu_Technology_List::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_ExecuteUbergraph_WBP_MainMenu_Technology_List, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_MainMenu_Technology_List_C_ExecuteUbergraph_WBP_MainMenu_Technology_List::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function WBP_MainMenu_Technology_List.WBP_MainMenu_Technology_List_C.Get Top Focus Target
// 0x0018 (0x0018 - 0x0000)
struct WBP_MainMenu_Technology_List_C_Get_Top_Focus_Target final
{
public:
	class UWidget*                                Target;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MainMenu_Technology_Content_C*     CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_List_C_Get_Top_Focus_Target) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_List_C_Get_Top_Focus_Target");
static_assert(sizeof(WBP_MainMenu_Technology_List_C_Get_Top_Focus_Target) == 0x000018, "Wrong size on WBP_MainMenu_Technology_List_C_Get_Top_Focus_Target");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_Get_Top_Focus_Target, Target) == 0x000000, "Member 'WBP_MainMenu_Technology_List_C_Get_Top_Focus_Target::Target' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_Get_Top_Focus_Target, CallFunc_Array_Get_Item) == 0x000008, "Member 'WBP_MainMenu_Technology_List_C_Get_Top_Focus_Target::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_Get_Top_Focus_Target, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000010, "Member 'WBP_MainMenu_Technology_List_C_Get_Top_Focus_Target::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");

// Function WBP_MainMenu_Technology_List.WBP_MainMenu_Technology_List_C.GetButtonIndex
// 0x0010 (0x0010 - 0x0000)
struct WBP_MainMenu_Technology_List_C_GetButtonIndex final
{
public:
	class UWBP_MainMenu_Technology_Content_C*     ButtonWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_List_C_GetButtonIndex) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_List_C_GetButtonIndex");
static_assert(sizeof(WBP_MainMenu_Technology_List_C_GetButtonIndex) == 0x000010, "Wrong size on WBP_MainMenu_Technology_List_C_GetButtonIndex");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_GetButtonIndex, ButtonWidget) == 0x000000, "Member 'WBP_MainMenu_Technology_List_C_GetButtonIndex::ButtonWidget' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_GetButtonIndex, Param_Index) == 0x000008, "Member 'WBP_MainMenu_Technology_List_C_GetButtonIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_GetButtonIndex, CallFunc_Array_Find_ReturnValue) == 0x00000C, "Member 'WBP_MainMenu_Technology_List_C_GetButtonIndex::CallFunc_Array_Find_ReturnValue' has a wrong offset!");

// Function WBP_MainMenu_Technology_List.WBP_MainMenu_Technology_List_C.GetButtonNum
// 0x0008 (0x0008 - 0x0000)
struct WBP_MainMenu_Technology_List_C_GetButtonNum final
{
public:
	int32                                         Num;                                               // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_List_C_GetButtonNum) == 0x000004, "Wrong alignment on WBP_MainMenu_Technology_List_C_GetButtonNum");
static_assert(sizeof(WBP_MainMenu_Technology_List_C_GetButtonNum) == 0x000008, "Wrong size on WBP_MainMenu_Technology_List_C_GetButtonNum");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_GetButtonNum, Num) == 0x000000, "Member 'WBP_MainMenu_Technology_List_C_GetButtonNum::Num' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_GetButtonNum, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'WBP_MainMenu_Technology_List_C_GetButtonNum::CallFunc_Array_Length_ReturnValue' has a wrong offset!");

// Function WBP_MainMenu_Technology_List.WBP_MainMenu_Technology_List_C.GetFocusTargetByIndex
// 0x0020 (0x0020 - 0x0000)
struct WBP_MainMenu_Technology_List_C_GetFocusTargetByIndex final
{
public:
	int32                                         ButtonIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E9[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Widget;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MainMenu_Technology_Content_C*     CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_List_C_GetFocusTargetByIndex) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_List_C_GetFocusTargetByIndex");
static_assert(sizeof(WBP_MainMenu_Technology_List_C_GetFocusTargetByIndex) == 0x000020, "Wrong size on WBP_MainMenu_Technology_List_C_GetFocusTargetByIndex");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_GetFocusTargetByIndex, ButtonIndex) == 0x000000, "Member 'WBP_MainMenu_Technology_List_C_GetFocusTargetByIndex::ButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_GetFocusTargetByIndex, Widget) == 0x000008, "Member 'WBP_MainMenu_Technology_List_C_GetFocusTargetByIndex::Widget' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_GetFocusTargetByIndex, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_MainMenu_Technology_List_C_GetFocusTargetByIndex::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_GetFocusTargetByIndex, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_MainMenu_Technology_List_C_GetFocusTargetByIndex::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_GetFocusTargetByIndex, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_MainMenu_Technology_List_C_GetFocusTargetByIndex::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_MainMenu_Technology_List.WBP_MainMenu_Technology_List_C.OnClickedTechnology__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MainMenu_Technology_List_C_OnClickedTechnology__DelegateSignature final
{
public:
	class UWBP_MainMenu_Technology_Content_C*     Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_List_C_OnClickedTechnology__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_List_C_OnClickedTechnology__DelegateSignature");
static_assert(sizeof(WBP_MainMenu_Technology_List_C_OnClickedTechnology__DelegateSignature) == 0x000008, "Wrong size on WBP_MainMenu_Technology_List_C_OnClickedTechnology__DelegateSignature");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_OnClickedTechnology__DelegateSignature, Widget) == 0x000000, "Member 'WBP_MainMenu_Technology_List_C_OnClickedTechnology__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_MainMenu_Technology_List.WBP_MainMenu_Technology_List_C.OnClickedTechnology_Internal
// 0x0008 (0x0008 - 0x0000)
struct WBP_MainMenu_Technology_List_C_OnClickedTechnology_Internal final
{
public:
	class UWBP_MainMenu_Technology_Content_C*     Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_List_C_OnClickedTechnology_Internal) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_List_C_OnClickedTechnology_Internal");
static_assert(sizeof(WBP_MainMenu_Technology_List_C_OnClickedTechnology_Internal) == 0x000008, "Wrong size on WBP_MainMenu_Technology_List_C_OnClickedTechnology_Internal");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_OnClickedTechnology_Internal, Widget) == 0x000000, "Member 'WBP_MainMenu_Technology_List_C_OnClickedTechnology_Internal::Widget' has a wrong offset!");

// Function WBP_MainMenu_Technology_List.WBP_MainMenu_Technology_List_C.OnHoveredTechnology_Internal
// 0x0008 (0x0008 - 0x0000)
struct WBP_MainMenu_Technology_List_C_OnHoveredTechnology_Internal final
{
public:
	class UWBP_MainMenu_Technology_Content_C*     Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_List_C_OnHoveredTechnology_Internal) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_List_C_OnHoveredTechnology_Internal");
static_assert(sizeof(WBP_MainMenu_Technology_List_C_OnHoveredTechnology_Internal) == 0x000008, "Wrong size on WBP_MainMenu_Technology_List_C_OnHoveredTechnology_Internal");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_OnHoveredTechnology_Internal, Widget) == 0x000000, "Member 'WBP_MainMenu_Technology_List_C_OnHoveredTechnology_Internal::Widget' has a wrong offset!");

// Function WBP_MainMenu_Technology_List.WBP_MainMenu_Technology_List_C.OnHoveredTechnoogy__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_MainMenu_Technology_List_C_OnHoveredTechnoogy__DelegateSignature final
{
public:
	class UWBP_MainMenu_Technology_Content_C*     Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MainMenu_Technology_List_C*        ListWidget;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_List_C_OnHoveredTechnoogy__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_List_C_OnHoveredTechnoogy__DelegateSignature");
static_assert(sizeof(WBP_MainMenu_Technology_List_C_OnHoveredTechnoogy__DelegateSignature) == 0x000010, "Wrong size on WBP_MainMenu_Technology_List_C_OnHoveredTechnoogy__DelegateSignature");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_OnHoveredTechnoogy__DelegateSignature, Widget) == 0x000000, "Member 'WBP_MainMenu_Technology_List_C_OnHoveredTechnoogy__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_OnHoveredTechnoogy__DelegateSignature, ListWidget) == 0x000008, "Member 'WBP_MainMenu_Technology_List_C_OnHoveredTechnoogy__DelegateSignature::ListWidget' has a wrong offset!");

// Function WBP_MainMenu_Technology_List.WBP_MainMenu_Technology_List_C.OnUnhoveredTechnology__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MainMenu_Technology_List_C_OnUnhoveredTechnology__DelegateSignature final
{
public:
	class UWBP_MainMenu_Technology_Content_C*     Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_List_C_OnUnhoveredTechnology__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_List_C_OnUnhoveredTechnology__DelegateSignature");
static_assert(sizeof(WBP_MainMenu_Technology_List_C_OnUnhoveredTechnology__DelegateSignature) == 0x000008, "Wrong size on WBP_MainMenu_Technology_List_C_OnUnhoveredTechnology__DelegateSignature");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_OnUnhoveredTechnology__DelegateSignature, Widget) == 0x000000, "Member 'WBP_MainMenu_Technology_List_C_OnUnhoveredTechnology__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_MainMenu_Technology_List.WBP_MainMenu_Technology_List_C.OnUnhoveredTechnology_Internal
// 0x0008 (0x0008 - 0x0000)
struct WBP_MainMenu_Technology_List_C_OnUnhoveredTechnology_Internal final
{
public:
	class UWBP_MainMenu_Technology_Content_C*     Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_List_C_OnUnhoveredTechnology_Internal) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_List_C_OnUnhoveredTechnology_Internal");
static_assert(sizeof(WBP_MainMenu_Technology_List_C_OnUnhoveredTechnology_Internal) == 0x000008, "Wrong size on WBP_MainMenu_Technology_List_C_OnUnhoveredTechnology_Internal");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_OnUnhoveredTechnology_Internal, Widget) == 0x000000, "Member 'WBP_MainMenu_Technology_List_C_OnUnhoveredTechnology_Internal::Widget' has a wrong offset!");

// Function WBP_MainMenu_Technology_List.WBP_MainMenu_Technology_List_C.OnUpdatePlayerLevel
// 0x0038 (0x0038 - 0x0000)
struct WBP_MainMenu_Technology_List_C_OnUpdatePlayerLevel final
{
public:
	int32                                         AddLevel;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NowLevel;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57EA[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MainMenu_Technology_Content_C*     K2Node_DynamicCast_AsWBP_Main_Menu_Technology_Content; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_List_C_OnUpdatePlayerLevel) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_List_C_OnUpdatePlayerLevel");
static_assert(sizeof(WBP_MainMenu_Technology_List_C_OnUpdatePlayerLevel) == 0x000038, "Wrong size on WBP_MainMenu_Technology_List_C_OnUpdatePlayerLevel");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_OnUpdatePlayerLevel, AddLevel) == 0x000000, "Member 'WBP_MainMenu_Technology_List_C_OnUpdatePlayerLevel::AddLevel' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_OnUpdatePlayerLevel, NowLevel) == 0x000004, "Member 'WBP_MainMenu_Technology_List_C_OnUpdatePlayerLevel::NowLevel' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_OnUpdatePlayerLevel, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_MainMenu_Technology_List_C_OnUpdatePlayerLevel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_OnUpdatePlayerLevel, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_MainMenu_Technology_List_C_OnUpdatePlayerLevel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_OnUpdatePlayerLevel, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_MainMenu_Technology_List_C_OnUpdatePlayerLevel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_OnUpdatePlayerLevel, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'WBP_MainMenu_Technology_List_C_OnUpdatePlayerLevel::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_OnUpdatePlayerLevel, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_MainMenu_Technology_List_C_OnUpdatePlayerLevel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_OnUpdatePlayerLevel, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_MainMenu_Technology_List_C_OnUpdatePlayerLevel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_OnUpdatePlayerLevel, K2Node_DynamicCast_AsWBP_Main_Menu_Technology_Content) == 0x000028, "Member 'WBP_MainMenu_Technology_List_C_OnUpdatePlayerLevel::K2Node_DynamicCast_AsWBP_Main_Menu_Technology_Content' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_OnUpdatePlayerLevel, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_MainMenu_Technology_List_C_OnUpdatePlayerLevel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_OnUpdatePlayerLevel, CallFunc_Less_IntInt_ReturnValue) == 0x000031, "Member 'WBP_MainMenu_Technology_List_C_OnUpdatePlayerLevel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_MainMenu_Technology_List.WBP_MainMenu_Technology_List_C.RegisterButtonEvent
// 0x0038 (0x0038 - 0x0000)
struct WBP_MainMenu_Technology_List_C_RegisterButtonEvent final
{
public:
	class UWBP_MainMenu_Technology_Content_C*     TechnologyContentWidget;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_MainMenu_Technology_Content_C* Widget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_MainMenu_Technology_Content_C* Widget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_MainMenu_Technology_Content_C* Widget)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_List_C_RegisterButtonEvent) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_List_C_RegisterButtonEvent");
static_assert(sizeof(WBP_MainMenu_Technology_List_C_RegisterButtonEvent) == 0x000038, "Wrong size on WBP_MainMenu_Technology_List_C_RegisterButtonEvent");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_RegisterButtonEvent, TechnologyContentWidget) == 0x000000, "Member 'WBP_MainMenu_Technology_List_C_RegisterButtonEvent::TechnologyContentWidget' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_RegisterButtonEvent, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_MainMenu_Technology_List_C_RegisterButtonEvent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_RegisterButtonEvent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WBP_MainMenu_Technology_List_C_RegisterButtonEvent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_RegisterButtonEvent, K2Node_CreateDelegate_OutputDelegate_2) == 0x000028, "Member 'WBP_MainMenu_Technology_List_C_RegisterButtonEvent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function WBP_MainMenu_Technology_List.WBP_MainMenu_Technology_List_C.RegisterPlayerEvent
// 0x0030 (0x0030 - 0x0000)
struct WBP_MainMenu_Technology_List_C_RegisterPlayerEvent final
{
public:
	TDelegate<void(int32 AddLevel, int32 NowLevel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57EB[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterParameter*       CallFunc_TryGetIndividualParameter_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57EC[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLevel_ReturnValue;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_List_C_RegisterPlayerEvent) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_List_C_RegisterPlayerEvent");
static_assert(sizeof(WBP_MainMenu_Technology_List_C_RegisterPlayerEvent) == 0x000030, "Wrong size on WBP_MainMenu_Technology_List_C_RegisterPlayerEvent");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_RegisterPlayerEvent, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_MainMenu_Technology_List_C_RegisterPlayerEvent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_RegisterPlayerEvent, CallFunc_GetPalmi_ReturnValue) == 0x000010, "Member 'WBP_MainMenu_Technology_List_C_RegisterPlayerEvent::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_RegisterPlayerEvent, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_MainMenu_Technology_List_C_RegisterPlayerEvent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_RegisterPlayerEvent, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'WBP_MainMenu_Technology_List_C_RegisterPlayerEvent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_RegisterPlayerEvent, CallFunc_TryGetIndividualParameter_ReturnValue) == 0x000020, "Member 'WBP_MainMenu_Technology_List_C_RegisterPlayerEvent::CallFunc_TryGetIndividualParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_RegisterPlayerEvent, CallFunc_IsValid_ReturnValue_2) == 0x000028, "Member 'WBP_MainMenu_Technology_List_C_RegisterPlayerEvent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_RegisterPlayerEvent, CallFunc_IsValid_ReturnValue_3) == 0x000029, "Member 'WBP_MainMenu_Technology_List_C_RegisterPlayerEvent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_RegisterPlayerEvent, CallFunc_GetLevel_ReturnValue) == 0x00002C, "Member 'WBP_MainMenu_Technology_List_C_RegisterPlayerEvent::CallFunc_GetLevel_ReturnValue' has a wrong offset!");

// Function WBP_MainMenu_Technology_List.WBP_MainMenu_Technology_List_C.SetTechnologyData
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_MainMenu_Technology_List_C_SetTechnologyData final
{
public:
	struct FF_PalUITechnologyDataMapContent       DisplayTechnologyData;                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57ED[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57EE[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalTechnologyData*                     CallFunc_GetLocalTechnologyData_ReturnValue;       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalTechnologyRecipeUnlockDataTableRow CallFunc_GetRecipeTechlonogy_ReturnValue;          // 0x0038(0x0060)(ConstParm)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_MainMenu_Technology_Content_C*     CallFunc_Create_ReturnValue;                       // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_List_C_SetTechnologyData) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_List_C_SetTechnologyData");
static_assert(sizeof(WBP_MainMenu_Technology_List_C_SetTechnologyData) == 0x0000C8, "Wrong size on WBP_MainMenu_Technology_List_C_SetTechnologyData");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_SetTechnologyData, DisplayTechnologyData) == 0x000000, "Member 'WBP_MainMenu_Technology_List_C_SetTechnologyData::DisplayTechnologyData' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_SetTechnologyData, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_MainMenu_Technology_List_C_SetTechnologyData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_SetTechnologyData, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'WBP_MainMenu_Technology_List_C_SetTechnologyData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_SetTechnologyData, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_MainMenu_Technology_List_C_SetTechnologyData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_SetTechnologyData, Temp_bool_Has_Been_Initd_Variable) == 0x000020, "Member 'WBP_MainMenu_Technology_List_C_SetTechnologyData::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_SetTechnologyData, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WBP_MainMenu_Technology_List_C_SetTechnologyData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_SetTechnologyData, Temp_bool_IsClosed_Variable) == 0x000028, "Member 'WBP_MainMenu_Technology_List_C_SetTechnologyData::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_SetTechnologyData, CallFunc_Less_IntInt_ReturnValue) == 0x000029, "Member 'WBP_MainMenu_Technology_List_C_SetTechnologyData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_SetTechnologyData, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_MainMenu_Technology_List_C_SetTechnologyData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_SetTechnologyData, CallFunc_GetLocalTechnologyData_ReturnValue) == 0x000030, "Member 'WBP_MainMenu_Technology_List_C_SetTechnologyData::CallFunc_GetLocalTechnologyData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_SetTechnologyData, CallFunc_GetRecipeTechlonogy_ReturnValue) == 0x000038, "Member 'WBP_MainMenu_Technology_List_C_SetTechnologyData::CallFunc_GetRecipeTechlonogy_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_SetTechnologyData, K2Node_MakeStruct_Margin) == 0x000098, "Member 'WBP_MainMenu_Technology_List_C_SetTechnologyData::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_SetTechnologyData, CallFunc_GetLocalPlayerController_ReturnValue) == 0x0000A8, "Member 'WBP_MainMenu_Technology_List_C_SetTechnologyData::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_SetTechnologyData, CallFunc_Create_ReturnValue) == 0x0000B0, "Member 'WBP_MainMenu_Technology_List_C_SetTechnologyData::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_SetTechnologyData, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x0000B8, "Member 'WBP_MainMenu_Technology_List_C_SetTechnologyData::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_SetTechnologyData, CallFunc_Array_Add_ReturnValue) == 0x0000C0, "Member 'WBP_MainMenu_Technology_List_C_SetTechnologyData::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WBP_MainMenu_Technology_List.WBP_MainMenu_Technology_List_C.SetTechnologyLevel
// 0x0020 (0x0020 - 0x0000)
struct WBP_MainMenu_Technology_List_C_SetTechnologyLevel final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57EF[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(WBP_MainMenu_Technology_List_C_SetTechnologyLevel) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_List_C_SetTechnologyLevel");
static_assert(sizeof(WBP_MainMenu_Technology_List_C_SetTechnologyLevel) == 0x000020, "Wrong size on WBP_MainMenu_Technology_List_C_SetTechnologyLevel");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_SetTechnologyLevel, Level) == 0x000000, "Member 'WBP_MainMenu_Technology_List_C_SetTechnologyLevel::Level' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_SetTechnologyLevel, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_MainMenu_Technology_List_C_SetTechnologyLevel::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_MainMenu_Technology_List.WBP_MainMenu_Technology_List_C.UnregisterAllButtonEvent
// 0x0050 (0x0050 - 0x0000)
struct WBP_MainMenu_Technology_List_C_UnregisterAllButtonEvent final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_MainMenu_Technology_Content_C* Widget)> K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57F0[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MainMenu_Technology_Content_C*     CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_MainMenu_Technology_Content_C* Widget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57F1[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWBP_MainMenu_Technology_Content_C* Widget)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_List_C_UnregisterAllButtonEvent) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_List_C_UnregisterAllButtonEvent");
static_assert(sizeof(WBP_MainMenu_Technology_List_C_UnregisterAllButtonEvent) == 0x000050, "Wrong size on WBP_MainMenu_Technology_List_C_UnregisterAllButtonEvent");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_UnregisterAllButtonEvent, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_MainMenu_Technology_List_C_UnregisterAllButtonEvent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_UnregisterAllButtonEvent, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_MainMenu_Technology_List_C_UnregisterAllButtonEvent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_UnregisterAllButtonEvent, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_MainMenu_Technology_List_C_UnregisterAllButtonEvent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_UnregisterAllButtonEvent, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'WBP_MainMenu_Technology_List_C_UnregisterAllButtonEvent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_UnregisterAllButtonEvent, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_MainMenu_Technology_List_C_UnregisterAllButtonEvent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_UnregisterAllButtonEvent, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_MainMenu_Technology_List_C_UnregisterAllButtonEvent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_UnregisterAllButtonEvent, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'WBP_MainMenu_Technology_List_C_UnregisterAllButtonEvent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_UnregisterAllButtonEvent, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_MainMenu_Technology_List_C_UnregisterAllButtonEvent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_UnregisterAllButtonEvent, K2Node_CreateDelegate_OutputDelegate_2) == 0x000040, "Member 'WBP_MainMenu_Technology_List_C_UnregisterAllButtonEvent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function WBP_MainMenu_Technology_List.WBP_MainMenu_Technology_List_C.UnregisterPlayerEvent
// 0x0030 (0x0030 - 0x0000)
struct WBP_MainMenu_Technology_List_C_UnregisterPlayerEvent final
{
public:
	TDelegate<void(int32 AddLevel, int32 NowLevel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57F2[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterParameter*       CallFunc_TryGetIndividualParameter_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_List_C_UnregisterPlayerEvent) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_List_C_UnregisterPlayerEvent");
static_assert(sizeof(WBP_MainMenu_Technology_List_C_UnregisterPlayerEvent) == 0x000030, "Wrong size on WBP_MainMenu_Technology_List_C_UnregisterPlayerEvent");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_UnregisterPlayerEvent, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_MainMenu_Technology_List_C_UnregisterPlayerEvent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_UnregisterPlayerEvent, CallFunc_GetPalmi_ReturnValue) == 0x000010, "Member 'WBP_MainMenu_Technology_List_C_UnregisterPlayerEvent::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_UnregisterPlayerEvent, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_MainMenu_Technology_List_C_UnregisterPlayerEvent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_UnregisterPlayerEvent, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'WBP_MainMenu_Technology_List_C_UnregisterPlayerEvent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_UnregisterPlayerEvent, CallFunc_TryGetIndividualParameter_ReturnValue) == 0x000020, "Member 'WBP_MainMenu_Technology_List_C_UnregisterPlayerEvent::CallFunc_TryGetIndividualParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_UnregisterPlayerEvent, CallFunc_IsValid_ReturnValue_2) == 0x000028, "Member 'WBP_MainMenu_Technology_List_C_UnregisterPlayerEvent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_UnregisterPlayerEvent, CallFunc_IsValid_ReturnValue_3) == 0x000029, "Member 'WBP_MainMenu_Technology_List_C_UnregisterPlayerEvent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function WBP_MainMenu_Technology_List.WBP_MainMenu_Technology_List_C.UpdateAllButtonDetail
// 0x0030 (0x0030 - 0x0000)
struct WBP_MainMenu_Technology_List_C_UpdateAllButtonDetail final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57F3[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57F4[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MainMenu_Technology_Content_C*     K2Node_DynamicCast_AsWBP_Main_Menu_Technology_Content; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_List_C_UpdateAllButtonDetail) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_List_C_UpdateAllButtonDetail");
static_assert(sizeof(WBP_MainMenu_Technology_List_C_UpdateAllButtonDetail) == 0x000030, "Wrong size on WBP_MainMenu_Technology_List_C_UpdateAllButtonDetail");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_UpdateAllButtonDetail, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_MainMenu_Technology_List_C_UpdateAllButtonDetail::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_UpdateAllButtonDetail, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_MainMenu_Technology_List_C_UpdateAllButtonDetail::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_UpdateAllButtonDetail, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_MainMenu_Technology_List_C_UpdateAllButtonDetail::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_UpdateAllButtonDetail, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_MainMenu_Technology_List_C_UpdateAllButtonDetail::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_UpdateAllButtonDetail, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_MainMenu_Technology_List_C_UpdateAllButtonDetail::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_UpdateAllButtonDetail, K2Node_DynamicCast_AsWBP_Main_Menu_Technology_Content) == 0x000020, "Member 'WBP_MainMenu_Technology_List_C_UpdateAllButtonDetail::K2Node_DynamicCast_AsWBP_Main_Menu_Technology_Content' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_UpdateAllButtonDetail, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_MainMenu_Technology_List_C_UpdateAllButtonDetail::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_UpdateAllButtonDetail, CallFunc_Less_IntInt_ReturnValue) == 0x000029, "Member 'WBP_MainMenu_Technology_List_C_UpdateAllButtonDetail::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_MainMenu_Technology_List.WBP_MainMenu_Technology_List_C.UpdateListActive
// 0x0006 (0x0006 - 0x0000)
struct WBP_MainMenu_Technology_List_C_UpdateListActive final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Technology_List_C_UpdateListActive) == 0x000001, "Wrong alignment on WBP_MainMenu_Technology_List_C_UpdateListActive");
static_assert(sizeof(WBP_MainMenu_Technology_List_C_UpdateListActive) == 0x000006, "Wrong size on WBP_MainMenu_Technology_List_C_UpdateListActive");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_UpdateListActive, Temp_byte_Variable) == 0x000000, "Member 'WBP_MainMenu_Technology_List_C_UpdateListActive::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_List_C_UpdateListActive, Temp_byte_Variable_1) == 0x000001, "Member 'WBP_MainMenu_Technology_List_C_UpdateListActive::Temp_byte_Variable_1' has a wrong offset!");
