#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WorkSuitabilityPreference_CheckBox_0

#include "Basic.hpp"

#include "Pal_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_WorkSuitabilityPreference_CheckBox_0.WBP_WorkSuitabilityPreference_CheckBox_0_C.BndEvt__WBP_WorkSuitabilityPreference_CheckBox_0_PalCheckBox_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_WorkSuitabilityPreference_CheckBox_0_C_BndEvt__WBP_WorkSuitabilityPreference_CheckBox_0_PalCheckBox_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorkSuitabilityPreference_CheckBox_0_C_BndEvt__WBP_WorkSuitabilityPreference_CheckBox_0_PalCheckBox_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_WorkSuitabilityPreference_CheckBox_0_C_BndEvt__WBP_WorkSuitabilityPreference_CheckBox_0_PalCheckBox_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(WBP_WorkSuitabilityPreference_CheckBox_0_C_BndEvt__WBP_WorkSuitabilityPreference_CheckBox_0_PalCheckBox_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_WorkSuitabilityPreference_CheckBox_0_C_BndEvt__WBP_WorkSuitabilityPreference_CheckBox_0_PalCheckBox_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(WBP_WorkSuitabilityPreference_CheckBox_0_C_BndEvt__WBP_WorkSuitabilityPreference_CheckBox_0_PalCheckBox_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'WBP_WorkSuitabilityPreference_CheckBox_0_C_BndEvt__WBP_WorkSuitabilityPreference_CheckBox_0_PalCheckBox_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function WBP_WorkSuitabilityPreference_CheckBox_0.WBP_WorkSuitabilityPreference_CheckBox_0_C.BndEvt__WBP_WorkSuitabilityPreference_CheckBox_0_WBP_PalInvisibleButton_0_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_WorkSuitabilityPreference_CheckBox_0_C_BndEvt__WBP_WorkSuitabilityPreference_CheckBox_0_WBP_PalInvisibleButton_0_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorkSuitabilityPreference_CheckBox_0_C_BndEvt__WBP_WorkSuitabilityPreference_CheckBox_0_WBP_PalInvisibleButton_0_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_WorkSuitabilityPreference_CheckBox_0_C_BndEvt__WBP_WorkSuitabilityPreference_CheckBox_0_WBP_PalInvisibleButton_0_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_WorkSuitabilityPreference_CheckBox_0_C_BndEvt__WBP_WorkSuitabilityPreference_CheckBox_0_WBP_PalInvisibleButton_0_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_WorkSuitabilityPreference_CheckBox_0_C_BndEvt__WBP_WorkSuitabilityPreference_CheckBox_0_WBP_PalInvisibleButton_0_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_WorkSuitabilityPreference_CheckBox_0_C_BndEvt__WBP_WorkSuitabilityPreference_CheckBox_0_WBP_PalInvisibleButton_0_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_WorkSuitabilityPreference_CheckBox_0_C_BndEvt__WBP_WorkSuitabilityPreference_CheckBox_0_WBP_PalInvisibleButton_0_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_WorkSuitabilityPreference_CheckBox_0.WBP_WorkSuitabilityPreference_CheckBox_0_C.BndEvt__WBP_WorkSuitabilityPreference_CheckBox_0_WBP_PalInvisibleButton_0_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_WorkSuitabilityPreference_CheckBox_0_C_BndEvt__WBP_WorkSuitabilityPreference_CheckBox_0_WBP_PalInvisibleButton_0_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorkSuitabilityPreference_CheckBox_0_C_BndEvt__WBP_WorkSuitabilityPreference_CheckBox_0_WBP_PalInvisibleButton_0_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_WorkSuitabilityPreference_CheckBox_0_C_BndEvt__WBP_WorkSuitabilityPreference_CheckBox_0_WBP_PalInvisibleButton_0_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_WorkSuitabilityPreference_CheckBox_0_C_BndEvt__WBP_WorkSuitabilityPreference_CheckBox_0_WBP_PalInvisibleButton_0_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_WorkSuitabilityPreference_CheckBox_0_C_BndEvt__WBP_WorkSuitabilityPreference_CheckBox_0_WBP_PalInvisibleButton_0_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_WorkSuitabilityPreference_CheckBox_0_C_BndEvt__WBP_WorkSuitabilityPreference_CheckBox_0_WBP_PalInvisibleButton_0_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_WorkSuitabilityPreference_CheckBox_0_C_BndEvt__WBP_WorkSuitabilityPreference_CheckBox_0_WBP_PalInvisibleButton_0_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_WorkSuitabilityPreference_CheckBox_0.WBP_WorkSuitabilityPreference_CheckBox_0_C.ExecuteUbergraph_WBP_WorkSuitabilityPreference_CheckBox_0
// 0x0020 (0x0020 - 0x0000)
struct WBP_WorkSuitabilityPreference_CheckBox_0_C_ExecuteUbergraph_WBP_WorkSuitabilityPreference_CheckBox_0 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4378[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4379[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorkSuitabilityPreference_CheckBox_0_C_ExecuteUbergraph_WBP_WorkSuitabilityPreference_CheckBox_0) == 0x000008, "Wrong alignment on WBP_WorkSuitabilityPreference_CheckBox_0_C_ExecuteUbergraph_WBP_WorkSuitabilityPreference_CheckBox_0");
static_assert(sizeof(WBP_WorkSuitabilityPreference_CheckBox_0_C_ExecuteUbergraph_WBP_WorkSuitabilityPreference_CheckBox_0) == 0x000020, "Wrong size on WBP_WorkSuitabilityPreference_CheckBox_0_C_ExecuteUbergraph_WBP_WorkSuitabilityPreference_CheckBox_0");
static_assert(offsetof(WBP_WorkSuitabilityPreference_CheckBox_0_C_ExecuteUbergraph_WBP_WorkSuitabilityPreference_CheckBox_0, EntryPoint) == 0x000000, "Member 'WBP_WorkSuitabilityPreference_CheckBox_0_C_ExecuteUbergraph_WBP_WorkSuitabilityPreference_CheckBox_0::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_WorkSuitabilityPreference_CheckBox_0_C_ExecuteUbergraph_WBP_WorkSuitabilityPreference_CheckBox_0, K2Node_ComponentBoundEvent_Button_1) == 0x000008, "Member 'WBP_WorkSuitabilityPreference_CheckBox_0_C_ExecuteUbergraph_WBP_WorkSuitabilityPreference_CheckBox_0::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkSuitabilityPreference_CheckBox_0_C_ExecuteUbergraph_WBP_WorkSuitabilityPreference_CheckBox_0, K2Node_ComponentBoundEvent_bIsChecked) == 0x000010, "Member 'WBP_WorkSuitabilityPreference_CheckBox_0_C_ExecuteUbergraph_WBP_WorkSuitabilityPreference_CheckBox_0::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(WBP_WorkSuitabilityPreference_CheckBox_0_C_ExecuteUbergraph_WBP_WorkSuitabilityPreference_CheckBox_0, K2Node_ComponentBoundEvent_Button) == 0x000018, "Member 'WBP_WorkSuitabilityPreference_CheckBox_0_C_ExecuteUbergraph_WBP_WorkSuitabilityPreference_CheckBox_0::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function WBP_WorkSuitabilityPreference_CheckBox_0.WBP_WorkSuitabilityPreference_CheckBox_0_C.GetBindedSuitability
// 0x0001 (0x0001 - 0x0000)
struct WBP_WorkSuitabilityPreference_CheckBox_0_C_GetBindedSuitability final
{
public:
	EPalWorkSuitability                           Suitability;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorkSuitabilityPreference_CheckBox_0_C_GetBindedSuitability) == 0x000001, "Wrong alignment on WBP_WorkSuitabilityPreference_CheckBox_0_C_GetBindedSuitability");
static_assert(sizeof(WBP_WorkSuitabilityPreference_CheckBox_0_C_GetBindedSuitability) == 0x000001, "Wrong size on WBP_WorkSuitabilityPreference_CheckBox_0_C_GetBindedSuitability");
static_assert(offsetof(WBP_WorkSuitabilityPreference_CheckBox_0_C_GetBindedSuitability, Suitability) == 0x000000, "Member 'WBP_WorkSuitabilityPreference_CheckBox_0_C_GetBindedSuitability::Suitability' has a wrong offset!");

// Function WBP_WorkSuitabilityPreference_CheckBox_0.WBP_WorkSuitabilityPreference_CheckBox_0_C.IsBattleSettingCheckBox
// 0x0001 (0x0001 - 0x0000)
struct WBP_WorkSuitabilityPreference_CheckBox_0_C_IsBattleSettingCheckBox final
{
public:
	bool                                          IsBattleSetting;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorkSuitabilityPreference_CheckBox_0_C_IsBattleSettingCheckBox) == 0x000001, "Wrong alignment on WBP_WorkSuitabilityPreference_CheckBox_0_C_IsBattleSettingCheckBox");
static_assert(sizeof(WBP_WorkSuitabilityPreference_CheckBox_0_C_IsBattleSettingCheckBox) == 0x000001, "Wrong size on WBP_WorkSuitabilityPreference_CheckBox_0_C_IsBattleSettingCheckBox");
static_assert(offsetof(WBP_WorkSuitabilityPreference_CheckBox_0_C_IsBattleSettingCheckBox, IsBattleSetting) == 0x000000, "Member 'WBP_WorkSuitabilityPreference_CheckBox_0_C_IsBattleSettingCheckBox::IsBattleSetting' has a wrong offset!");

// Function WBP_WorkSuitabilityPreference_CheckBox_0.WBP_WorkSuitabilityPreference_CheckBox_0_C.OnCheckStateChanged__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct WBP_WorkSuitabilityPreference_CheckBox_0_C_OnCheckStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalWorkSuitability                           Suitability;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorkSuitabilityPreference_CheckBox_0_C_OnCheckStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_WorkSuitabilityPreference_CheckBox_0_C_OnCheckStateChanged__DelegateSignature");
static_assert(sizeof(WBP_WorkSuitabilityPreference_CheckBox_0_C_OnCheckStateChanged__DelegateSignature) == 0x000002, "Wrong size on WBP_WorkSuitabilityPreference_CheckBox_0_C_OnCheckStateChanged__DelegateSignature");
static_assert(offsetof(WBP_WorkSuitabilityPreference_CheckBox_0_C_OnCheckStateChanged__DelegateSignature, IsChecked) == 0x000000, "Member 'WBP_WorkSuitabilityPreference_CheckBox_0_C_OnCheckStateChanged__DelegateSignature::IsChecked' has a wrong offset!");
static_assert(offsetof(WBP_WorkSuitabilityPreference_CheckBox_0_C_OnCheckStateChanged__DelegateSignature, Suitability) == 0x000001, "Member 'WBP_WorkSuitabilityPreference_CheckBox_0_C_OnCheckStateChanged__DelegateSignature::Suitability' has a wrong offset!");

// Function WBP_WorkSuitabilityPreference_CheckBox_0.WBP_WorkSuitabilityPreference_CheckBox_0_C.OnHoveredCheckBox__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_WorkSuitabilityPreference_CheckBox_0_C_OnHoveredCheckBox__DelegateSignature final
{
public:
	class UWBP_WorkSuitabilityPreference_CheckBox_0_C* SelfWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorkSuitabilityPreference_CheckBox_0_C_OnHoveredCheckBox__DelegateSignature) == 0x000008, "Wrong alignment on WBP_WorkSuitabilityPreference_CheckBox_0_C_OnHoveredCheckBox__DelegateSignature");
static_assert(sizeof(WBP_WorkSuitabilityPreference_CheckBox_0_C_OnHoveredCheckBox__DelegateSignature) == 0x000008, "Wrong size on WBP_WorkSuitabilityPreference_CheckBox_0_C_OnHoveredCheckBox__DelegateSignature");
static_assert(offsetof(WBP_WorkSuitabilityPreference_CheckBox_0_C_OnHoveredCheckBox__DelegateSignature, SelfWidget) == 0x000000, "Member 'WBP_WorkSuitabilityPreference_CheckBox_0_C_OnHoveredCheckBox__DelegateSignature::SelfWidget' has a wrong offset!");

// Function WBP_WorkSuitabilityPreference_CheckBox_0.WBP_WorkSuitabilityPreference_CheckBox_0_C.SetCheckedState
// 0x0001 (0x0001 - 0x0000)
struct WBP_WorkSuitabilityPreference_CheckBox_0_C_SetCheckedState final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorkSuitabilityPreference_CheckBox_0_C_SetCheckedState) == 0x000001, "Wrong alignment on WBP_WorkSuitabilityPreference_CheckBox_0_C_SetCheckedState");
static_assert(sizeof(WBP_WorkSuitabilityPreference_CheckBox_0_C_SetCheckedState) == 0x000001, "Wrong size on WBP_WorkSuitabilityPreference_CheckBox_0_C_SetCheckedState");
static_assert(offsetof(WBP_WorkSuitabilityPreference_CheckBox_0_C_SetCheckedState, IsChecked) == 0x000000, "Member 'WBP_WorkSuitabilityPreference_CheckBox_0_C_SetCheckedState::IsChecked' has a wrong offset!");

// Function WBP_WorkSuitabilityPreference_CheckBox_0.WBP_WorkSuitabilityPreference_CheckBox_0_C.SetEnableClick
// 0x0009 (0x0009 - 0x0000)
struct WBP_WorkSuitabilityPreference_CheckBox_0_C_SetEnableClick final
{
public:
	bool                                          IsEnable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorkSuitabilityPreference_CheckBox_0_C_SetEnableClick) == 0x000001, "Wrong alignment on WBP_WorkSuitabilityPreference_CheckBox_0_C_SetEnableClick");
static_assert(sizeof(WBP_WorkSuitabilityPreference_CheckBox_0_C_SetEnableClick) == 0x000009, "Wrong size on WBP_WorkSuitabilityPreference_CheckBox_0_C_SetEnableClick");
static_assert(offsetof(WBP_WorkSuitabilityPreference_CheckBox_0_C_SetEnableClick, IsEnable) == 0x000000, "Member 'WBP_WorkSuitabilityPreference_CheckBox_0_C_SetEnableClick::IsEnable' has a wrong offset!");
static_assert(offsetof(WBP_WorkSuitabilityPreference_CheckBox_0_C_SetEnableClick, Temp_bool_Variable) == 0x000001, "Member 'WBP_WorkSuitabilityPreference_CheckBox_0_C_SetEnableClick::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorkSuitabilityPreference_CheckBox_0_C_SetEnableClick, Temp_byte_Variable) == 0x000002, "Member 'WBP_WorkSuitabilityPreference_CheckBox_0_C_SetEnableClick::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorkSuitabilityPreference_CheckBox_0_C_SetEnableClick, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_WorkSuitabilityPreference_CheckBox_0_C_SetEnableClick::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkSuitabilityPreference_CheckBox_0_C_SetEnableClick, Temp_bool_Variable_1) == 0x000004, "Member 'WBP_WorkSuitabilityPreference_CheckBox_0_C_SetEnableClick::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_WorkSuitabilityPreference_CheckBox_0_C_SetEnableClick, Temp_byte_Variable_2) == 0x000005, "Member 'WBP_WorkSuitabilityPreference_CheckBox_0_C_SetEnableClick::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_WorkSuitabilityPreference_CheckBox_0_C_SetEnableClick, Temp_byte_Variable_3) == 0x000006, "Member 'WBP_WorkSuitabilityPreference_CheckBox_0_C_SetEnableClick::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_WorkSuitabilityPreference_CheckBox_0_C_SetEnableClick, K2Node_Select_Default) == 0x000007, "Member 'WBP_WorkSuitabilityPreference_CheckBox_0_C_SetEnableClick::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_WorkSuitabilityPreference_CheckBox_0_C_SetEnableClick, K2Node_Select_Default_1) == 0x000008, "Member 'WBP_WorkSuitabilityPreference_CheckBox_0_C_SetEnableClick::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_WorkSuitabilityPreference_CheckBox_0.WBP_WorkSuitabilityPreference_CheckBox_0_C.Setup
// 0x0001 (0x0001 - 0x0000)
struct WBP_WorkSuitabilityPreference_CheckBox_0_C_Setup final
{
public:
	EPalWorkSuitability                           BindSuitability;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorkSuitabilityPreference_CheckBox_0_C_Setup) == 0x000001, "Wrong alignment on WBP_WorkSuitabilityPreference_CheckBox_0_C_Setup");
static_assert(sizeof(WBP_WorkSuitabilityPreference_CheckBox_0_C_Setup) == 0x000001, "Wrong size on WBP_WorkSuitabilityPreference_CheckBox_0_C_Setup");
static_assert(offsetof(WBP_WorkSuitabilityPreference_CheckBox_0_C_Setup, BindSuitability) == 0x000000, "Member 'WBP_WorkSuitabilityPreference_CheckBox_0_C_Setup::BindSuitability' has a wrong offset!");

}

