#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenu_bg

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_MainMenu_bg.WBP_MainMenu_bg_C.ExecuteUbergraph_WBP_MainMenu_bg
// 0x0010 (0x0010 - 0x0000)
struct WBP_MainMenu_bg_C_ExecuteUbergraph_WBP_MainMenu_bg final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_bg_C_ExecuteUbergraph_WBP_MainMenu_bg) == 0x000008, "Wrong alignment on WBP_MainMenu_bg_C_ExecuteUbergraph_WBP_MainMenu_bg");
static_assert(sizeof(WBP_MainMenu_bg_C_ExecuteUbergraph_WBP_MainMenu_bg) == 0x000010, "Wrong size on WBP_MainMenu_bg_C_ExecuteUbergraph_WBP_MainMenu_bg");
static_assert(offsetof(WBP_MainMenu_bg_C_ExecuteUbergraph_WBP_MainMenu_bg, EntryPoint) == 0x000000, "Member 'WBP_MainMenu_bg_C_ExecuteUbergraph_WBP_MainMenu_bg::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_bg_C_ExecuteUbergraph_WBP_MainMenu_bg, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_MainMenu_bg_C_ExecuteUbergraph_WBP_MainMenu_bg::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_MainMenu_bg.WBP_MainMenu_bg_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct WBP_MainMenu_bg_C_SetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_MainMenu_bg_C_SetText) == 0x000008, "Wrong alignment on WBP_MainMenu_bg_C_SetText");
static_assert(sizeof(WBP_MainMenu_bg_C_SetText) == 0x000018, "Wrong size on WBP_MainMenu_bg_C_SetText");
static_assert(offsetof(WBP_MainMenu_bg_C_SetText, Text) == 0x000000, "Member 'WBP_MainMenu_bg_C_SetText::Text' has a wrong offset!");

}

