#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PalWorkPowerPlant_Gauge

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PalWorkPowerPlant_Gauge.WBP_PalWorkPowerPlant_Gauge_C
// 0x0020 (0x0298 - 0x0278)
class UWBP_PalWorkPowerPlant_Gauge_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anm_Change;                                        // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Gauge;                                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Current_Changing;                                  // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldShow;                                        // 0x0291(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnmEvent_Changing(bool IsChanging);
	void ExecuteUbergraph_WBP_PalWorkPowerPlant_Gauge(int32 EntryPoint);
	void SetState(bool IsLow, bool Show);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PalWorkPowerPlant_Gauge_C">();
	}
	static class UWBP_PalWorkPowerPlant_Gauge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PalWorkPowerPlant_Gauge_C>();
	}
};
static_assert(alignof(UWBP_PalWorkPowerPlant_Gauge_C) == 0x000008, "Wrong alignment on UWBP_PalWorkPowerPlant_Gauge_C");
static_assert(sizeof(UWBP_PalWorkPowerPlant_Gauge_C) == 0x000298, "Wrong size on UWBP_PalWorkPowerPlant_Gauge_C");
static_assert(offsetof(UWBP_PalWorkPowerPlant_Gauge_C, UberGraphFrame) == 0x000278, "Member 'UWBP_PalWorkPowerPlant_Gauge_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PalWorkPowerPlant_Gauge_C, Anm_Change) == 0x000280, "Member 'UWBP_PalWorkPowerPlant_Gauge_C::Anm_Change' has a wrong offset!");
static_assert(offsetof(UWBP_PalWorkPowerPlant_Gauge_C, Gauge) == 0x000288, "Member 'UWBP_PalWorkPowerPlant_Gauge_C::Gauge' has a wrong offset!");
static_assert(offsetof(UWBP_PalWorkPowerPlant_Gauge_C, Current_Changing) == 0x000290, "Member 'UWBP_PalWorkPowerPlant_Gauge_C::Current_Changing' has a wrong offset!");
static_assert(offsetof(UWBP_PalWorkPowerPlant_Gauge_C, ShouldShow) == 0x000291, "Member 'UWBP_PalWorkPowerPlant_Gauge_C::ShouldShow' has a wrong offset!");

}

