#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Map_Base

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Pal_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Map_Base.WBP_Map_Base_C.AddBossIcon
// 0x0090 (0x0090 - 0x0000)
struct WBP_Map_Base_C_AddBossIcon final
{
public:
	class ABP_PalSpawner_Standard_C*              Spawner;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalHUDService*                         CallFunc_GetHUDService_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalSpawnerGroupInfo                   CallFunc_Array_Get_Item;                           // 0x0028(0x0018)()
	struct FPalSpawnerOneTribeInfo                CallFunc_Array_Get_Item_1;                         // 0x0040(0x0020)(NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52F7[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalPlayerRecordData*                   CallFunc_GetLocalRecordData_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRecordData_Bool_ReturnValue;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52F8[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Map_IconBoss_C*                    CallFunc_Create_ReturnValue;                       // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Add_Icon_By_Location_Added;               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52F9[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_Base_C_AddBossIcon) == 0x000008, "Wrong alignment on WBP_Map_Base_C_AddBossIcon");
static_assert(sizeof(WBP_Map_Base_C_AddBossIcon) == 0x000090, "Wrong size on WBP_Map_Base_C_AddBossIcon");
static_assert(offsetof(WBP_Map_Base_C_AddBossIcon, Spawner) == 0x000000, "Member 'WBP_Map_Base_C_AddBossIcon::Spawner' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_AddBossIcon, Location) == 0x000008, "Member 'WBP_Map_Base_C_AddBossIcon::Location' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_AddBossIcon, CallFunc_GetHUDService_ReturnValue) == 0x000020, "Member 'WBP_Map_Base_C_AddBossIcon::CallFunc_GetHUDService_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_AddBossIcon, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_Map_Base_C_AddBossIcon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_AddBossIcon, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'WBP_Map_Base_C_AddBossIcon::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_AddBossIcon, CallFunc_Array_Contains_ReturnValue) == 0x000060, "Member 'WBP_Map_Base_C_AddBossIcon::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_AddBossIcon, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000061, "Member 'WBP_Map_Base_C_AddBossIcon::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_AddBossIcon, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000062, "Member 'WBP_Map_Base_C_AddBossIcon::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_AddBossIcon, CallFunc_BooleanOR_ReturnValue) == 0x000063, "Member 'WBP_Map_Base_C_AddBossIcon::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_AddBossIcon, CallFunc_GetLocalRecordData_ReturnValue) == 0x000068, "Member 'WBP_Map_Base_C_AddBossIcon::CallFunc_GetLocalRecordData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_AddBossIcon, CallFunc_GetRecordData_Bool_ReturnValue) == 0x000070, "Member 'WBP_Map_Base_C_AddBossIcon::CallFunc_GetRecordData_Bool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_AddBossIcon, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000078, "Member 'WBP_Map_Base_C_AddBossIcon::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_AddBossIcon, CallFunc_Create_ReturnValue) == 0x000080, "Member 'WBP_Map_Base_C_AddBossIcon::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_AddBossIcon, CallFunc_Add_Icon_By_Location_Added) == 0x000088, "Member 'WBP_Map_Base_C_AddBossIcon::CallFunc_Add_Icon_By_Location_Added' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_AddBossIcon, CallFunc_Array_Add_ReturnValue) == 0x00008C, "Member 'WBP_Map_Base_C_AddBossIcon::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WBP_Map_Base.WBP_Map_Base_C.ChangeCustomIcon
// 0x0040 (0x0040 - 0x0000)
struct WBP_Map_Base_C_ChangeCustomIcon final
{
public:
	class UWBP_Map_IconCustom_C*                  Icon;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  RemoveId;                                          // 0x000C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52FA[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalLocationManager*                    CallFunc_GetLocationManager_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalLocationPoint*                      CallFunc_GetLocationPoint_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalLocationPoint_Custom*               K2Node_DynamicCast_AsPal_Location_Point_Custom;    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_Base_C_ChangeCustomIcon) == 0x000008, "Wrong alignment on WBP_Map_Base_C_ChangeCustomIcon");
static_assert(sizeof(WBP_Map_Base_C_ChangeCustomIcon) == 0x000040, "Wrong size on WBP_Map_Base_C_ChangeCustomIcon");
static_assert(offsetof(WBP_Map_Base_C_ChangeCustomIcon, Icon) == 0x000000, "Member 'WBP_Map_Base_C_ChangeCustomIcon::Icon' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeCustomIcon, Param_Index) == 0x000008, "Member 'WBP_Map_Base_C_ChangeCustomIcon::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeCustomIcon, RemoveId) == 0x00000C, "Member 'WBP_Map_Base_C_ChangeCustomIcon::RemoveId' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeCustomIcon, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'WBP_Map_Base_C_ChangeCustomIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeCustomIcon, CallFunc_GetLocationManager_ReturnValue) == 0x000020, "Member 'WBP_Map_Base_C_ChangeCustomIcon::CallFunc_GetLocationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeCustomIcon, CallFunc_GetLocationPoint_ReturnValue) == 0x000028, "Member 'WBP_Map_Base_C_ChangeCustomIcon::CallFunc_GetLocationPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeCustomIcon, K2Node_DynamicCast_AsPal_Location_Point_Custom) == 0x000030, "Member 'WBP_Map_Base_C_ChangeCustomIcon::K2Node_DynamicCast_AsPal_Location_Point_Custom' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeCustomIcon, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_Map_Base_C_ChangeCustomIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_Map_Base.WBP_Map_Base_C.ChangeFilter
// 0x01A8 (0x01A8 - 0x0000)
struct WBP_Map_Base_C_ChangeFilter final
{
public:
	EPalLocationType                              FilterMap;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnable;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52FB[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<EPalLocationType>                        TempFilter;                                        // 0x0008(0x0050)(Edit, BlueprintVisible)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalLocationType                              Temp_byte_Variable_1;                              // 0x005A(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalLocationType                              Temp_byte_Variable_2;                              // 0x005B(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52FC[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<EPalLocationType>                        K2Node_MakeVariable_MakeVariableOutput;            // 0x0068(0x0050)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52FD[0x3];                                     // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52FE[0x3];                                     // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Map_IconBoss_C*                    CallFunc_Array_Get_Item;                           // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalLocationType                              Temp_byte_Variable_10;                             // 0x00FD(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSet<EPalLocationType>                        K2Node_MakeSet_Set;                                // 0x0100(0x0050)()
	bool                                          CallFunc_Set_Contains_ReturnValue_1;               // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue_2;               // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0153(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Remove_ReturnValue;                   // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52FF[0x3];                                     // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Map_IconPlayer_C*                  CallFunc_Array_Get_Item_1;                         // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5300[0x3];                                     // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Map_IconDeath_C*                   CallFunc_Array_Get_Item_2;                         // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_WorldMap_IconBase_NoDesign_C*> CallFunc_Map_Values_Values;                        // 0x0170(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_WorldMap_IconBase_NoDesign_C*      CallFunc_Array_Get_Item_3;                         // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5301[0x4];                                     // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalLocationPoint*                      CallFunc_GetLocationPoint_LocationPoint;           // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalLocationType                              CallFunc_GetType_ReturnValue;                      // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue_3;               // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5302[0x1];                                     // 0x019B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_Base_C_ChangeFilter) == 0x000008, "Wrong alignment on WBP_Map_Base_C_ChangeFilter");
static_assert(sizeof(WBP_Map_Base_C_ChangeFilter) == 0x0001A8, "Wrong size on WBP_Map_Base_C_ChangeFilter");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, FilterMap) == 0x000000, "Member 'WBP_Map_Base_C_ChangeFilter::FilterMap' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, IsEnable) == 0x000001, "Member 'WBP_Map_Base_C_ChangeFilter::IsEnable' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, TempFilter) == 0x000008, "Member 'WBP_Map_Base_C_ChangeFilter::TempFilter' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_byte_Variable) == 0x000058, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000059, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_byte_Variable_1) == 0x00005A, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_byte_Variable_2) == 0x00005B, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_bool_Variable) == 0x00005C, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_byte_Variable_3) == 0x00005D, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_byte_Variable_4) == 0x00005E, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_bool_Variable_1) == 0x00005F, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_byte_Variable_5) == 0x000060, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_byte_Variable_6) == 0x000061, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_bool_Variable_2) == 0x000062, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_byte_Variable_7) == 0x000063, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_byte_Variable_8) == 0x000064, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, K2Node_MakeVariable_MakeVariableOutput) == 0x000068, "Member 'WBP_Map_Base_C_ChangeFilter::K2Node_MakeVariable_MakeVariableOutput' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_int_Array_Index_Variable) == 0x0000B8, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_byte_Variable_9) == 0x0000BC, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_int_Loop_Counter_Variable) == 0x0000C0, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_int_Loop_Counter_Variable_1) == 0x0000C4, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Add_IntInt_ReturnValue) == 0x0000C8, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000CC, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_int_Loop_Counter_Variable_2) == 0x0000D0, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000D4, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_int_Array_Index_Variable_1) == 0x0000D8, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_bool_Variable_3) == 0x0000DC, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_int_Array_Index_Variable_2) == 0x0000E0, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_int_Loop_Counter_Variable_3) == 0x0000E4, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000E8, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_int_Array_Index_Variable_3) == 0x0000EC, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Array_Get_Item) == 0x0000F0, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Array_Length_ReturnValue) == 0x0000F8, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Less_IntInt_ReturnValue) == 0x0000FC, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_byte_Variable_10) == 0x0000FD, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Set_Contains_ReturnValue) == 0x0000FE, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Set_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, K2Node_Select_Default) == 0x0000FF, "Member 'WBP_Map_Base_C_ChangeFilter::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, K2Node_MakeSet_Set) == 0x000100, "Member 'WBP_Map_Base_C_ChangeFilter::K2Node_MakeSet_Set' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Set_Contains_ReturnValue_1) == 0x000150, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Set_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Set_Contains_ReturnValue_2) == 0x000151, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Set_Contains_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, K2Node_Select_Default_1) == 0x000152, "Member 'WBP_Map_Base_C_ChangeFilter::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, K2Node_Select_Default_2) == 0x000153, "Member 'WBP_Map_Base_C_ChangeFilter::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Set_Remove_ReturnValue) == 0x000154, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Set_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Array_Get_Item_1) == 0x000158, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Array_Length_ReturnValue_1) == 0x000160, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Less_IntInt_ReturnValue_1) == 0x000164, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Array_Get_Item_2) == 0x000168, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Map_Values_Values) == 0x000170, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Array_Get_Item_3) == 0x000180, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Array_Length_ReturnValue_2) == 0x000188, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_GetLocationPoint_LocationPoint) == 0x000190, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_GetLocationPoint_LocationPoint' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Less_IntInt_ReturnValue_2) == 0x000198, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_GetType_ReturnValue) == 0x000199, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_GetType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Set_Contains_ReturnValue_3) == 0x00019A, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Set_Contains_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Array_Length_ReturnValue_3) == 0x00019C, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Less_IntInt_ReturnValue_3) == 0x0001A0, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, K2Node_Select_Default_3) == 0x0001A1, "Member 'WBP_Map_Base_C_ChangeFilter::K2Node_Select_Default_3' has a wrong offset!");

// Function WBP_Map_Base.WBP_Map_Base_C.Collect Boss Pal Spawner
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_Map_Base_C_Collect_Boss_Pal_Spawner final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5303[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_DungeonFixedEntrance_C*>     CallFunc_GetAllActorsOfClass_OutActors;            // 0x0018(0x0010)(ReferenceParm)
	class ABP_DungeonFixedEntrance_C*             CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5304[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5305[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class APalNPCSpawnerBase>         CallFunc_GetEnemySpawner_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetDefaultObject_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5306[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PalSpawner_Standard_C*              K2Node_DynamicCast_AsBP_Pal_Spawner_Standard;      // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5307[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_PalSpawner_Standard_C*>      CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0080(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5308[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PalSpawner_Standard_C*              CallFunc_Array_Get_Item_1;                         // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5309[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_Base_C_Collect_Boss_Pal_Spawner) == 0x000008, "Wrong alignment on WBP_Map_Base_C_Collect_Boss_Pal_Spawner");
static_assert(sizeof(WBP_Map_Base_C_Collect_Boss_Pal_Spawner) == 0x0000C0, "Wrong size on WBP_Map_Base_C_Collect_Boss_Pal_Spawner");
static_assert(offsetof(WBP_Map_Base_C_Collect_Boss_Pal_Spawner, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'WBP_Map_Base_C_Collect_Boss_Pal_Spawner::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Collect_Boss_Pal_Spawner, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WBP_Map_Base_C_Collect_Boss_Pal_Spawner::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Collect_Boss_Pal_Spawner, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_Map_Base_C_Collect_Boss_Pal_Spawner::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Collect_Boss_Pal_Spawner, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'WBP_Map_Base_C_Collect_Boss_Pal_Spawner::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Collect_Boss_Pal_Spawner, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'WBP_Map_Base_C_Collect_Boss_Pal_Spawner::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Collect_Boss_Pal_Spawner, CallFunc_GetAllActorsOfClass_OutActors) == 0x000018, "Member 'WBP_Map_Base_C_Collect_Boss_Pal_Spawner::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Collect_Boss_Pal_Spawner, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_Map_Base_C_Collect_Boss_Pal_Spawner::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Collect_Boss_Pal_Spawner, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_Map_Base_C_Collect_Boss_Pal_Spawner::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Collect_Boss_Pal_Spawner, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'WBP_Map_Base_C_Collect_Boss_Pal_Spawner::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Collect_Boss_Pal_Spawner, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'WBP_Map_Base_C_Collect_Boss_Pal_Spawner::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Collect_Boss_Pal_Spawner, CallFunc_GetEnemySpawner_ReturnValue) == 0x000058, "Member 'WBP_Map_Base_C_Collect_Boss_Pal_Spawner::CallFunc_GetEnemySpawner_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Collect_Boss_Pal_Spawner, CallFunc_GetDefaultObject_ReturnValue) == 0x000060, "Member 'WBP_Map_Base_C_Collect_Boss_Pal_Spawner::CallFunc_GetDefaultObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Collect_Boss_Pal_Spawner, CallFunc_Add_IntInt_ReturnValue_1) == 0x000068, "Member 'WBP_Map_Base_C_Collect_Boss_Pal_Spawner::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Collect_Boss_Pal_Spawner, K2Node_DynamicCast_AsBP_Pal_Spawner_Standard) == 0x000070, "Member 'WBP_Map_Base_C_Collect_Boss_Pal_Spawner::K2Node_DynamicCast_AsBP_Pal_Spawner_Standard' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Collect_Boss_Pal_Spawner, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WBP_Map_Base_C_Collect_Boss_Pal_Spawner::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Collect_Boss_Pal_Spawner, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000080, "Member 'WBP_Map_Base_C_Collect_Boss_Pal_Spawner::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Collect_Boss_Pal_Spawner, CallFunc_Array_Length_ReturnValue_1) == 0x000090, "Member 'WBP_Map_Base_C_Collect_Boss_Pal_Spawner::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Collect_Boss_Pal_Spawner, CallFunc_Array_Get_Item_1) == 0x000098, "Member 'WBP_Map_Base_C_Collect_Boss_Pal_Spawner::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Collect_Boss_Pal_Spawner, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A0, "Member 'WBP_Map_Base_C_Collect_Boss_Pal_Spawner::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Collect_Boss_Pal_Spawner, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000A8, "Member 'WBP_Map_Base_C_Collect_Boss_Pal_Spawner::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");

// Function WBP_Map_Base.WBP_Map_Base_C.CollectAndAddIcon
// 0x0088 (0x0088 - 0x0000)
struct WBP_Map_Base_C_CollectAndAddIcon final
{
public:
	class UClass*                                 CollectActorClass;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 AddWidgetClass;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_FindOwnerPalCharacter_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_530A[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APalCharacter*>                  CallFunc_GetAllControlledCharacters_OutCharacters; // 0x0058(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_530B[0x2];                                     // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_WorldMap_IconBase_NoDesign_C*      CallFunc_Create_ReturnValue;                       // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Add_Icon_By_Location_Added;               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_Base_C_CollectAndAddIcon) == 0x000008, "Wrong alignment on WBP_Map_Base_C_CollectAndAddIcon");
static_assert(sizeof(WBP_Map_Base_C_CollectAndAddIcon) == 0x000088, "Wrong size on WBP_Map_Base_C_CollectAndAddIcon");
static_assert(offsetof(WBP_Map_Base_C_CollectAndAddIcon, CollectActorClass) == 0x000000, "Member 'WBP_Map_Base_C_CollectAndAddIcon::CollectActorClass' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_CollectAndAddIcon, AddWidgetClass) == 0x000008, "Member 'WBP_Map_Base_C_CollectAndAddIcon::AddWidgetClass' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_CollectAndAddIcon, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'WBP_Map_Base_C_CollectAndAddIcon::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_CollectAndAddIcon, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_Map_Base_C_CollectAndAddIcon::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_CollectAndAddIcon, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'WBP_Map_Base_C_CollectAndAddIcon::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_CollectAndAddIcon, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_Map_Base_C_CollectAndAddIcon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_CollectAndAddIcon, CallFunc_FindOwnerPalCharacter_ReturnValue) == 0x000030, "Member 'WBP_Map_Base_C_CollectAndAddIcon::CallFunc_FindOwnerPalCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_CollectAndAddIcon, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'WBP_Map_Base_C_CollectAndAddIcon::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_CollectAndAddIcon, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'WBP_Map_Base_C_CollectAndAddIcon::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_CollectAndAddIcon, CallFunc_GetAllControlledCharacters_OutCharacters) == 0x000058, "Member 'WBP_Map_Base_C_CollectAndAddIcon::CallFunc_GetAllControlledCharacters_OutCharacters' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_CollectAndAddIcon, CallFunc_Array_Contains_ReturnValue) == 0x000068, "Member 'WBP_Map_Base_C_CollectAndAddIcon::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_CollectAndAddIcon, CallFunc_Less_IntInt_ReturnValue) == 0x000069, "Member 'WBP_Map_Base_C_CollectAndAddIcon::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_CollectAndAddIcon, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'WBP_Map_Base_C_CollectAndAddIcon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_CollectAndAddIcon, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000070, "Member 'WBP_Map_Base_C_CollectAndAddIcon::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_CollectAndAddIcon, CallFunc_Create_ReturnValue) == 0x000078, "Member 'WBP_Map_Base_C_CollectAndAddIcon::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_CollectAndAddIcon, CallFunc_Add_Icon_By_Location_Added) == 0x000080, "Member 'WBP_Map_Base_C_CollectAndAddIcon::CallFunc_Add_Icon_By_Location_Added' has a wrong offset!");

// Function WBP_Map_Base.WBP_Map_Base_C.EnableCustomMark
// 0x0088 (0x0088 - 0x0000)
struct WBP_Map_Base_C_EnableCustomMark final
{
public:
	class UPalLocationManager*                    CallFunc_GetLocationManager_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLocalCustomLocationCount_ReturnValue;  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_530C[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalGameSetting*                        CallFunc_GetGameSetting_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_530D[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_530E[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Map_IconCustom_C*                  K2Node_DynamicCast_AsWBP_Map_Icon_Custom;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_530F[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalLocationManager*                    CallFunc_GetLocationManager_ReturnValue_1;         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Project_Icon_Position_to_World_Postion_WorldPosition; // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_AddLocalCustomLocation_ReturnValue;       // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_Base_C_EnableCustomMark) == 0x000008, "Wrong alignment on WBP_Map_Base_C_EnableCustomMark");
static_assert(sizeof(WBP_Map_Base_C_EnableCustomMark) == 0x000088, "Wrong size on WBP_Map_Base_C_EnableCustomMark");
static_assert(offsetof(WBP_Map_Base_C_EnableCustomMark, CallFunc_GetLocationManager_ReturnValue) == 0x000000, "Member 'WBP_Map_Base_C_EnableCustomMark::CallFunc_GetLocationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_EnableCustomMark, CallFunc_GetLocalCustomLocationCount_ReturnValue) == 0x000008, "Member 'WBP_Map_Base_C_EnableCustomMark::CallFunc_GetLocalCustomLocationCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_EnableCustomMark, CallFunc_GetGameSetting_ReturnValue) == 0x000010, "Member 'WBP_Map_Base_C_EnableCustomMark::CallFunc_GetGameSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_EnableCustomMark, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Map_Base_C_EnableCustomMark::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_EnableCustomMark, CallFunc_BooleanAND_ReturnValue) == 0x000019, "Member 'WBP_Map_Base_C_EnableCustomMark::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_EnableCustomMark, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000020, "Member 'WBP_Map_Base_C_EnableCustomMark::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_EnableCustomMark, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_Map_Base_C_EnableCustomMark::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_EnableCustomMark, K2Node_DynamicCast_AsWBP_Map_Icon_Custom) == 0x000038, "Member 'WBP_Map_Base_C_EnableCustomMark::K2Node_DynamicCast_AsWBP_Map_Icon_Custom' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_EnableCustomMark, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_Map_Base_C_EnableCustomMark::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_EnableCustomMark, CallFunc_GetLocationManager_ReturnValue_1) == 0x000048, "Member 'WBP_Map_Base_C_EnableCustomMark::CallFunc_GetLocationManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_EnableCustomMark, CallFunc_Conv_VectorToVector2D_ReturnValue_1) == 0x000050, "Member 'WBP_Map_Base_C_EnableCustomMark::CallFunc_Conv_VectorToVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_EnableCustomMark, CallFunc_Project_Icon_Position_to_World_Postion_WorldPosition) == 0x000060, "Member 'WBP_Map_Base_C_EnableCustomMark::CallFunc_Project_Icon_Position_to_World_Postion_WorldPosition' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_EnableCustomMark, CallFunc_AddLocalCustomLocation_ReturnValue) == 0x000078, "Member 'WBP_Map_Base_C_EnableCustomMark::CallFunc_AddLocalCustomLocation_ReturnValue' has a wrong offset!");

// Function WBP_Map_Base.WBP_Map_Base_C.ExecuteUbergraph_WBP_Map_Base
// 0x03F0 (0x03F0 - 0x0000)
struct WBP_Map_Base_C_ExecuteUbergraph_WBP_Map_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5310[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5311[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalDebugSetting*                       CallFunc_GetPalDebugSetting_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue;        // 0x0030(0x0004)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5312[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalWorldMapUIData*                     CallFunc_GetLocalWorldMapData_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLocalPlayerID_ReturnValue;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnlockMap_ReturnValue;                    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5313[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_Map_IconPlayer_C*>          CallFunc_SetupPlayerIcon_PlayerIcons;              // 0x0050(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue_1;      // 0x0070(0x0004)(NoDestructor)
	uint8                                         Pad_5314[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDDispatchParameterBase*           CallFunc_GetParam_ReturnValue;                     // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
