#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IngameMenu_Chest_FilterContent

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_IngameMenu_Chest_FilterContent.WBP_IngameMenu_Chest_FilterContent_C.BndEvt__WBP_IngameMenu_Chest_FilterContent_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_IngameMenu_Chest_FilterContent_C_BndEvt__WBP_IngameMenu_Chest_FilterContent_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_Chest_FilterContent_C_BndEvt__WBP_IngameMenu_Chest_FilterContent_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_IngameMenu_Chest_FilterContent_C_BndEvt__WBP_IngameMenu_Chest_FilterContent_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_IngameMenu_Chest_FilterContent_C_BndEvt__WBP_IngameMenu_Chest_FilterContent_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_IngameMenu_Chest_FilterContent_C_BndEvt__WBP_IngameMenu_Chest_FilterContent_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_IngameMenu_Chest_FilterContent_C_BndEvt__WBP_IngameMenu_Chest_FilterContent_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_IngameMenu_Chest_FilterContent_C_BndEvt__WBP_IngameMenu_Chest_FilterContent_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_IngameMenu_Chest_FilterContent.WBP_IngameMenu_Chest_FilterContent_C.ExecuteUbergraph_WBP_IngameMenu_Chest_FilterContent
// 0x0010 (0x0010 - 0x0000)
struct WBP_IngameMenu_Chest_FilterContent_C_ExecuteUbergraph_WBP_IngameMenu_Chest_FilterContent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45CD[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_Chest_FilterContent_C_ExecuteUbergraph_WBP_IngameMenu_Chest_FilterContent) == 0x000008, "Wrong alignment on WBP_IngameMenu_Chest_FilterContent_C_ExecuteUbergraph_WBP_IngameMenu_Chest_FilterContent");
static_assert(sizeof(WBP_IngameMenu_Chest_FilterContent_C_ExecuteUbergraph_WBP_IngameMenu_Chest_FilterContent) == 0x000010, "Wrong size on WBP_IngameMenu_Chest_FilterContent_C_ExecuteUbergraph_WBP_IngameMenu_Chest_FilterContent");
static_assert(offsetof(WBP_IngameMenu_Chest_FilterContent_C_ExecuteUbergraph_WBP_IngameMenu_Chest_FilterContent, EntryPoint) == 0x000000, "Member 'WBP_IngameMenu_Chest_FilterContent_C_ExecuteUbergraph_WBP_IngameMenu_Chest_FilterContent::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_FilterContent_C_ExecuteUbergraph_WBP_IngameMenu_Chest_FilterContent, CallFunc_IsChecked_ReturnValue) == 0x000004, "Member 'WBP_IngameMenu_Chest_FilterContent_C_ExecuteUbergraph_WBP_IngameMenu_Chest_FilterContent::CallFunc_IsChecked_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_FilterContent_C_ExecuteUbergraph_WBP_IngameMenu_Chest_FilterContent, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'WBP_IngameMenu_Chest_FilterContent_C_ExecuteUbergraph_WBP_IngameMenu_Chest_FilterContent::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function WBP_IngameMenu_Chest_FilterContent.WBP_IngameMenu_Chest_FilterContent_C.OnChangedStateInternal
// 0x0001 (0x0001 - 0x0000)
struct WBP_IngameMenu_Chest_FilterContent_C_OnChangedStateInternal final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_Chest_FilterContent_C_OnChangedStateInternal) == 0x000001, "Wrong alignment on WBP_IngameMenu_Chest_FilterContent_C_OnChangedStateInternal");
static_assert(sizeof(WBP_IngameMenu_Chest_FilterContent_C_OnChangedStateInternal) == 0x000001, "Wrong size on WBP_IngameMenu_Chest_FilterContent_C_OnChangedStateInternal");
static_assert(offsetof(WBP_IngameMenu_Chest_FilterContent_C_OnChangedStateInternal, IsChecked) == 0x000000, "Member 'WBP_IngameMenu_Chest_FilterContent_C_OnChangedStateInternal::IsChecked' has a wrong offset!");

// Function WBP_IngameMenu_Chest_FilterContent.WBP_IngameMenu_Chest_FilterContent_C.OnClickedCheckButton__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct WBP_IngameMenu_Chest_FilterContent_C_OnClickedCheckButton__DelegateSignature final
{
public:
	class FName                                   Param_FilterId;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bChecked;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_Chest_FilterContent_C_OnClickedCheckButton__DelegateSignature) == 0x000004, "Wrong alignment on WBP_IngameMenu_Chest_FilterContent_C_OnClickedCheckButton__DelegateSignature");
static_assert(sizeof(WBP_IngameMenu_Chest_FilterContent_C_OnClickedCheckButton__DelegateSignature) == 0x00000C, "Wrong size on WBP_IngameMenu_Chest_FilterContent_C_OnClickedCheckButton__DelegateSignature");
static_assert(offsetof(WBP_IngameMenu_Chest_FilterContent_C_OnClickedCheckButton__DelegateSignature, Param_FilterId) == 0x000000, "Member 'WBP_IngameMenu_Chest_FilterContent_C_OnClickedCheckButton__DelegateSignature::Param_FilterId' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_FilterContent_C_OnClickedCheckButton__DelegateSignature, bChecked) == 0x000008, "Member 'WBP_IngameMenu_Chest_FilterContent_C_OnClickedCheckButton__DelegateSignature::bChecked' has a wrong offset!");

// Function WBP_IngameMenu_Chest_FilterContent.WBP_IngameMenu_Chest_FilterContent_C.OnUpdateFilterPreference
// 0x0028 (0x0028 - 0x0000)
struct WBP_IngameMenu_Chest_FilterContent_C_OnUpdateFilterPreference final
{
public:
	class UPalMapObjectItemContainerModule*       Module;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45CE[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetFilterOffList_ReturnValue;             // 0x0010(0x0010)(ReferenceParm)
	ECheckBoxState                                Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable_1;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                K2Node_Select_Default;                             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_Chest_FilterContent_C_OnUpdateFilterPreference) == 0x000008, "Wrong alignment on WBP_IngameMenu_Chest_FilterContent_C_OnUpdateFilterPreference");
static_assert(sizeof(WBP_IngameMenu_Chest_FilterContent_C_OnUpdateFilterPreference) == 0x000028, "Wrong size on WBP_IngameMenu_Chest_FilterContent_C_OnUpdateFilterPreference");
static_assert(offsetof(WBP_IngameMenu_Chest_FilterContent_C_OnUpdateFilterPreference, Module) == 0x000000, "Member 'WBP_IngameMenu_Chest_FilterContent_C_OnUpdateFilterPreference::Module' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_FilterContent_C_OnUpdateFilterPreference, Temp_bool_Variable) == 0x000008, "Member 'WBP_IngameMenu_Chest_FilterContent_C_OnUpdateFilterPreference::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_FilterContent_C_OnUpdateFilterPreference, CallFunc_GetFilterOffList_ReturnValue) == 0x000010, "Member 'WBP_IngameMenu_Chest_FilterContent_C_OnUpdateFilterPreference::CallFunc_GetFilterOffList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_FilterContent_C_OnUpdateFilterPreference, Temp_byte_Variable) == 0x000020, "Member 'WBP_IngameMenu_Chest_FilterContent_C_OnUpdateFilterPreference::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_FilterContent_C_OnUpdateFilterPreference, Temp_byte_Variable_1) == 0x000021, "Member 'WBP_IngameMenu_Chest_FilterContent_C_OnUpdateFilterPreference::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_FilterContent_C_OnUpdateFilterPreference, CallFunc_Array_Contains_ReturnValue) == 0x000022, "Member 'WBP_IngameMenu_Chest_FilterContent_C_OnUpdateFilterPreference::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_FilterContent_C_OnUpdateFilterPreference, CallFunc_Not_PreBool_ReturnValue) == 0x000023, "Member 'WBP_IngameMenu_Chest_FilterContent_C_OnUpdateFilterPreference::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_FilterContent_C_OnUpdateFilterPreference, K2Node_Select_Default) == 0x000024, "Member 'WBP_IngameMenu_Chest_FilterContent_C_OnUpdateFilterPreference::K2Node_Select_Default' has a wrong offset!");

// Function WBP_IngameMenu_Chest_FilterContent.WBP_IngameMenu_Chest_FilterContent_C.RegisterEvents
// 0x0020 (0x0020 - 0x0000)
struct WBP_IngameMenu_Chest_FilterContent_C_RegisterEvents final
{
public:
	class UPalUIItemChestFilterModel*             Model;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPalMapObjectItemContainerModule* Module)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalMapObjectItemContainerModule*       CallFunc_GetItemContainerModule_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_Chest_FilterContent_C_RegisterEvents) == 0x000008, "Wrong alignment on WBP_IngameMenu_Chest_FilterContent_C_RegisterEvents");
static_assert(sizeof(WBP_IngameMenu_Chest_FilterContent_C_RegisterEvents) == 0x000020, "Wrong size on WBP_IngameMenu_Chest_FilterContent_C_RegisterEvents");
static_assert(offsetof(WBP_IngameMenu_Chest_FilterContent_C_RegisterEvents, Model) == 0x000000, "Member 'WBP_IngameMenu_Chest_FilterContent_C_RegisterEvents::Model' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_FilterContent_C_RegisterEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_IngameMenu_Chest_FilterContent_C_RegisterEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_FilterContent_C_RegisterEvents, CallFunc_GetItemContainerModule_ReturnValue) == 0x000018, "Member 'WBP_IngameMenu_Chest_FilterContent_C_RegisterEvents::CallFunc_GetItemContainerModule_ReturnValue' has a wrong offset!");

// Function WBP_IngameMenu_Chest_FilterContent.WBP_IngameMenu_Chest_FilterContent_C.SetupUI
// 0x0028 (0x0028 - 0x0000)
struct WBP_IngameMenu_Chest_FilterContent_C_SetupUI final
{
public:
	class FName                                   Param_FilterId;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TextId;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizedText_ReturnValue;             // 0x0010(0x0018)()
};
static_assert(alignof(WBP_IngameMenu_Chest_FilterContent_C_SetupUI) == 0x000008, "Wrong alignment on WBP_IngameMenu_Chest_FilterContent_C_SetupUI");
static_assert(sizeof(WBP_IngameMenu_Chest_FilterContent_C_SetupUI) == 0x000028, "Wrong size on WBP_IngameMenu_Chest_FilterContent_C_SetupUI");
static_assert(offsetof(WBP_IngameMenu_Chest_FilterContent_C_SetupUI, Param_FilterId) == 0x000000, "Member 'WBP_IngameMenu_Chest_FilterContent_C_SetupUI::Param_FilterId' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_FilterContent_C_SetupUI, TextId) == 0x000008, "Member 'WBP_IngameMenu_Chest_FilterContent_C_SetupUI::TextId' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_FilterContent_C_SetupUI, CallFunc_GetLocalizedText_ReturnValue) == 0x000010, "Member 'WBP_IngameMenu_Chest_FilterContent_C_SetupUI::CallFunc_GetLocalizedText_ReturnValue' has a wrong offset!");

}

