#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IngameConstruction_Num

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_IngameConstruction_Num.WBP_IngameConstruction_Num_C.SetNums
// 0x0068 (0x0068 - 0x0000)
struct WBP_IngameConstruction_Num_C_SetNums final
{
public:
	int32                                         RequiredNum;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxNum;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40AD[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Min_ReturnValue;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0038(0x0014)()
	int32                                         CallFunc_Min_ReturnValue_1;                        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0050(0x0018)()
};
static_assert(alignof(WBP_IngameConstruction_Num_C_SetNums) == 0x000008, "Wrong alignment on WBP_IngameConstruction_Num_C_SetNums");
static_assert(sizeof(WBP_IngameConstruction_Num_C_SetNums) == 0x000068, "Wrong size on WBP_IngameConstruction_Num_C_SetNums");
static_assert(offsetof(WBP_IngameConstruction_Num_C_SetNums, RequiredNum) == 0x000000, "Member 'WBP_IngameConstruction_Num_C_SetNums::RequiredNum' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_Num_C_SetNums, MaxNum) == 0x000004, "Member 'WBP_IngameConstruction_Num_C_SetNums::MaxNum' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_Num_C_SetNums, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'WBP_IngameConstruction_Num_C_SetNums::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_Num_C_SetNums, CallFunc_Min_ReturnValue) == 0x00000C, "Member 'WBP_IngameConstruction_Num_C_SetNums::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_Num_C_SetNums, CallFunc_SelectColor_ReturnValue) == 0x000010, "Member 'WBP_IngameConstruction_Num_C_SetNums::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_Num_C_SetNums, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'WBP_IngameConstruction_Num_C_SetNums::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_Num_C_SetNums, K2Node_MakeStruct_SlateColor) == 0x000038, "Member 'WBP_IngameConstruction_Num_C_SetNums::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_Num_C_SetNums, CallFunc_Min_ReturnValue_1) == 0x00004C, "Member 'WBP_IngameConstruction_Num_C_SetNums::CallFunc_Min_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_Num_C_SetNums, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000050, "Member 'WBP_IngameConstruction_Num_C_SetNums::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");

// Function WBP_IngameConstruction_Num.WBP_IngameConstruction_Num_C.SetNumInternal
// 0x0038 (0x0038 - 0x0000)
struct WBP_IngameConstruction_Num_C_SetNumInternal final
{
public:
	class UBP_PalTextBlock_C*                     TargetText;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         InNum;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40AE[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameConstruction_Num_C_SetNumInternal) == 0x000008, "Wrong alignment on WBP_IngameConstruction_Num_C_SetNumInternal");
static_assert(sizeof(WBP_IngameConstruction_Num_C_SetNumInternal) == 0x000038, "Wrong size on WBP_IngameConstruction_Num_C_SetNumInternal");
static_assert(offsetof(WBP_IngameConstruction_Num_C_SetNumInternal, TargetText) == 0x000000, "Member 'WBP_IngameConstruction_Num_C_SetNumInternal::TargetText' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_Num_C_SetNumInternal, InNum) == 0x000008, "Member 'WBP_IngameConstruction_Num_C_SetNumInternal::InNum' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_Num_C_SetNumInternal, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_IngameConstruction_Num_C_SetNumInternal::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_Num_C_SetNumInternal, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'WBP_IngameConstruction_Num_C_SetNumInternal::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_Num_C_SetNumInternal, CallFunc_SelectFloat_ReturnValue) == 0x000028, "Member 'WBP_IngameConstruction_Num_C_SetNumInternal::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_Num_C_SetNumInternal, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000030, "Member 'WBP_IngameConstruction_Num_C_SetNumInternal::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

}

