#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PalWork_BreedFarm

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Pal_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_PalWork_BreedFarm.WBP_PalWork_BreedFarm_C.CREATEDELEGATE_PROXYFUNCTION_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_PalWork_BreedFarm_C_CREATEDELEGATE_PROXYFUNCTION_0 final
{
public:
	float                                         CurrentProgress;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxProgress;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_OnUpdateProgress_NowProgress_ImplicitCast; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_OnUpdateProgress_MaxProgress_ImplicitCast; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalWork_BreedFarm_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000008, "Wrong alignment on WBP_PalWork_BreedFarm_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(sizeof(WBP_PalWork_BreedFarm_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000018, "Wrong size on WBP_PalWork_BreedFarm_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_CREATEDELEGATE_PROXYFUNCTION_0, CurrentProgress) == 0x000000, "Member 'WBP_PalWork_BreedFarm_C_CREATEDELEGATE_PROXYFUNCTION_0::CurrentProgress' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_CREATEDELEGATE_PROXYFUNCTION_0, MaxProgress) == 0x000004, "Member 'WBP_PalWork_BreedFarm_C_CREATEDELEGATE_PROXYFUNCTION_0::MaxProgress' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_CREATEDELEGATE_PROXYFUNCTION_0, CallFunc_OnUpdateProgress_NowProgress_ImplicitCast) == 0x000008, "Member 'WBP_PalWork_BreedFarm_C_CREATEDELEGATE_PROXYFUNCTION_0::CallFunc_OnUpdateProgress_NowProgress_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_CREATEDELEGATE_PROXYFUNCTION_0, CallFunc_OnUpdateProgress_MaxProgress_ImplicitCast) == 0x000010, "Member 'WBP_PalWork_BreedFarm_C_CREATEDELEGATE_PROXYFUNCTION_0::CallFunc_OnUpdateProgress_MaxProgress_ImplicitCast' has a wrong offset!");

// Function WBP_PalWork_BreedFarm.WBP_PalWork_BreedFarm_C.ExecuteUbergraph_WBP_PalWork_BreedFarm
// 0x0148 (0x0148 - 0x0000)
struct WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalWorkSuitability                           CallFunc_GetWorkSuitability_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59FA[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetBreedProgress_NowProgress;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBreedProgress_MaxProgress;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalMapObjectWorkeeModule*              CallFunc_GetWorkeeModule_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalWorkBase*                           CallFunc_GetWork_ReturnValue;                      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalMapObjectItemContainerModule*       CallFunc_GetItemContainerModule_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalHUDDispatchParameterBase*           CallFunc_GetParam_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalUIMapObjectStatusIndicatorParameterBase* K2Node_DynamicCast_AsPal_UIMap_Object_Status_Indicator_Parameter_Base; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59FB[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59FC[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalMapObjectConcreteModelBase*         CallFunc_GetConcreteModel_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UPalMapObjectBreedFarmModel*            K2Node_DynamicCast_AsPal_Map_Object_Breed_Farm_Model; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59FD[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59FE[0x6];                                     // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalGameSetting*                        CallFunc_GetGameSetting_ReturnValue;               // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPalMapObjectItemContainerModule* Module)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59FF[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetMapObjectLocation_outVector;           // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A00[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A01[0x5];                                     // 0x00F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPalWorkBase* Work)>     K2Node_CreateDelegate_OutputDelegate_2;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float CurrentProgress, float MaxProgress)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_OnUpdateProgress_NowProgress_ImplicitCast; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_OnUpdateProgress_MaxProgress_ImplicitCast; // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_B_ImplicitCast;         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimation_StartAtTime_ImplicitCast;   // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm) == 0x000008, "Wrong alignment on WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm");
static_assert(sizeof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm) == 0x000148, "Wrong size on WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, EntryPoint) == 0x000000, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, CallFunc_GetWorkSuitability_ReturnValue) == 0x000004, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::CallFunc_GetWorkSuitability_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, Temp_byte_Variable) == 0x000005, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, CallFunc_GetBreedProgress_NowProgress) == 0x000008, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::CallFunc_GetBreedProgress_NowProgress' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, CallFunc_GetBreedProgress_MaxProgress) == 0x00000C, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::CallFunc_GetBreedProgress_MaxProgress' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, CallFunc_GetWorkeeModule_ReturnValue) == 0x000010, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::CallFunc_GetWorkeeModule_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, CallFunc_GetWork_ReturnValue) == 0x000018, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::CallFunc_GetWork_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, CallFunc_GetItemContainerModule_ReturnValue) == 0x000020, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::CallFunc_GetItemContainerModule_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, CallFunc_GetParam_ReturnValue) == 0x000028, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::CallFunc_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, K2Node_DynamicCast_AsPal_UIMap_Object_Status_Indicator_Parameter_Base) == 0x000030, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::K2Node_DynamicCast_AsPal_UIMap_Object_Status_Indicator_Parameter_Base' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, CallFunc_GetConcreteModel_ReturnValue) == 0x000050, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::CallFunc_GetConcreteModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000058, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, K2Node_DynamicCast_AsPal_Map_Object_Breed_Farm_Model) == 0x000060, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::K2Node_DynamicCast_AsPal_Map_Object_Breed_Farm_Model' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, CallFunc_GetPalmi_ReturnValue) == 0x000070, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, Temp_byte_Variable_1) == 0x000078, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, CallFunc_IsValid_ReturnValue) == 0x000079, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000080, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, CallFunc_GetGameSetting_ReturnValue) == 0x000098, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::CallFunc_GetGameSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000A0, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, CallFunc_GetEndTime_ReturnValue) == 0x0000B0, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000B8, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, CallFunc_PlayAnimation_ReturnValue) == 0x0000C0, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, CallFunc_GetMapObjectLocation_outVector) == 0x0000C8, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::CallFunc_GetMapObjectLocation_outVector' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, Temp_bool_Variable) == 0x0000E0, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, CallFunc_Vector_Distance_ReturnValue) == 0x0000E8, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0000F0, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, K2Node_Select_Default) == 0x0000F1, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x0000F2, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000F8, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, K2Node_CreateDelegate_OutputDelegate_2) == 0x000100, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, K2Node_CreateDelegate_OutputDelegate_3) == 0x000110, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, CallFunc_OnUpdateProgress_NowProgress_ImplicitCast) == 0x000120, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::CallFunc_OnUpdateProgress_NowProgress_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, CallFunc_OnUpdateProgress_MaxProgress_ImplicitCast) == 0x000128, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::CallFunc_OnUpdateProgress_MaxProgress_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, CallFunc_Less_DoubleDouble_B_ImplicitCast) == 0x000130, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::CallFunc_Less_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000138, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm, CallFunc_PlayAnimation_StartAtTime_ImplicitCast) == 0x000140, "Member 'WBP_PalWork_BreedFarm_C_ExecuteUbergraph_WBP_PalWork_BreedFarm::CallFunc_PlayAnimation_StartAtTime_ImplicitCast' has a wrong offset!");

// Function WBP_PalWork_BreedFarm.WBP_PalWork_BreedFarm_C.On Updated Worker Pal
// 0x0138 (0x0138 - 0x0000)
struct WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal final
{
public:
	class UPalWorkBase*                           Work;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         FemaleCount;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaleCount;                                         // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Canbreed;                                          // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A02[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPalIndividualCharacterSlot*>    CallFunc_GetAssignedCharacters_IndividualSlots;    // 0x0018(0x0010)(ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A03[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A04[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A05[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A06[0x2];                                     // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A07[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterSlot*            CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterHandle*          CallFunc_GetHandle_ReturnValue;                    // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterParameter*       CallFunc_TryGetIndividualParameter_ReturnValue;    // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPalGenderType                                CallFunc_GetGenderType_ReturnValue;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A08[0x5];                                     // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A09[0x2];                                     // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalWorkSuitability                           CallFunc_GetWorkSuitability_ReturnValue;           // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A0A[0x3];                                     // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00A0(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x00B8(0x0018)()
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    K2Node_Select_Default_1;                           // 0x00D8(0x0010)(NoDestructor)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text;          // 0x00E8(0x0018)()
	bool                                          Temp_bool_Variable_3;                              // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A0B[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_Select_Default_2;                           // 0x0108(0x0010)(NoDestructor)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_1;        // 0x0118(0x0018)()
	class UMaterialInterface*                     K2Node_Select_Default_3;                           // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal) == 0x000008, "Wrong alignment on WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal");
static_assert(sizeof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal) == 0x000138, "Wrong size on WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, Work) == 0x000000, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::Work' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, FemaleCount) == 0x000008, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::FemaleCount' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, MaleCount) == 0x00000C, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::MaleCount' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, Canbreed) == 0x000010, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::Canbreed' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, Temp_bool_Variable) == 0x000011, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, CallFunc_GetAssignedCharacters_IndividualSlots) == 0x000018, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::CallFunc_GetAssignedCharacters_IndividualSlots' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, Temp_byte_Variable) == 0x000028, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, Temp_byte_Variable_1) == 0x000030, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, CallFunc_SelectColor_ReturnValue) == 0x000034, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, Temp_int_Variable) == 0x000044, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, Temp_bool_Variable_1) == 0x000048, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, Temp_int_Variable_1) == 0x00004C, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, K2Node_Select_Default) == 0x000054, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, CallFunc_Less_IntInt_ReturnValue) == 0x000055, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, Temp_int_Array_Index_Variable) == 0x00005C, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, Temp_bool_Variable_2) == 0x000060, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, CallFunc_Array_Get_Item) == 0x000068, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, CallFunc_GetHandle_ReturnValue) == 0x000070, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::CallFunc_GetHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, CallFunc_TryGetIndividualParameter_ReturnValue) == 0x000078, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::CallFunc_TryGetIndividualParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, CallFunc_GetGenderType_ReturnValue) == 0x000080, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::CallFunc_GetGenderType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, K2Node_SwitchEnum_CmpSuccess) == 0x000081, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, CallFunc_Greater_IntInt_ReturnValue) == 0x000082, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, Temp_object_Variable) == 0x000088, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000090, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, CallFunc_BooleanAND_ReturnValue) == 0x000091, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, CallFunc_Add_IntInt_ReturnValue_1) == 0x000094, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, CallFunc_Add_IntInt_ReturnValue_2) == 0x000098, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, CallFunc_GetWorkSuitability_ReturnValue) == 0x00009C, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::CallFunc_GetWorkSuitability_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, CallFunc_Conv_IntToText_ReturnValue) == 0x0000A0, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, CallFunc_Conv_IntToText_ReturnValue_1) == 0x0000B8, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, Temp_object_Variable_1) == 0x0000D0, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, K2Node_Select_Default_1) == 0x0000D8, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, CallFunc_GetLocalizedTextFromHandle_Text) == 0x0000E8, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::CallFunc_GetLocalizedTextFromHandle_Text' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, Temp_bool_Variable_3) == 0x000100, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, K2Node_Select_Default_2) == 0x000108, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, CallFunc_GetLocalizedTextFromHandle_Text_1) == 0x000118, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::CallFunc_GetLocalizedTextFromHandle_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal, K2Node_Select_Default_3) == 0x000130, "Member 'WBP_PalWork_BreedFarm_C_On_Updated_Worker_Pal::K2Node_Select_Default_3' has a wrong offset!");

// Function WBP_PalWork_BreedFarm.WBP_PalWork_BreedFarm_C.OnUpdateContainer
// 0x0028 (0x0028 - 0x0000)
struct WBP_PalWork_BreedFarm_C_OnUpdateContainer final
{
public:
	class UPalMapObjectItemContainerModule*       Container;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A0C[0x1];                                     // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPalItemSlotIdAndNum                   CallFunc_CanConsumeBreedItem_ConsumableItem;       // 0x000C(0x0018)(NoDestructor)
	EPalItemOperationResult                       CallFunc_CanConsumeBreedItem_ReturnValue;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalWork_BreedFarm_C_OnUpdateContainer) == 0x000008, "Wrong alignment on WBP_PalWork_BreedFarm_C_OnUpdateContainer");
static_assert(sizeof(WBP_PalWork_BreedFarm_C_OnUpdateContainer) == 0x000028, "Wrong size on WBP_PalWork_BreedFarm_C_OnUpdateContainer");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_OnUpdateContainer, Container) == 0x000000, "Member 'WBP_PalWork_BreedFarm_C_OnUpdateContainer::Container' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_OnUpdateContainer, Temp_bool_Variable) == 0x000008, "Member 'WBP_PalWork_BreedFarm_C_OnUpdateContainer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_OnUpdateContainer, Temp_byte_Variable) == 0x000009, "Member 'WBP_PalWork_BreedFarm_C_OnUpdateContainer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_OnUpdateContainer, Temp_byte_Variable_1) == 0x00000A, "Member 'WBP_PalWork_BreedFarm_C_OnUpdateContainer::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_OnUpdateContainer, CallFunc_CanConsumeBreedItem_ConsumableItem) == 0x00000C, "Member 'WBP_PalWork_BreedFarm_C_OnUpdateContainer::CallFunc_CanConsumeBreedItem_ConsumableItem' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_OnUpdateContainer, CallFunc_CanConsumeBreedItem_ReturnValue) == 0x000024, "Member 'WBP_PalWork_BreedFarm_C_OnUpdateContainer::CallFunc_CanConsumeBreedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_OnUpdateContainer, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000025, "Member 'WBP_PalWork_BreedFarm_C_OnUpdateContainer::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_OnUpdateContainer, K2Node_Select_Default) == 0x000026, "Member 'WBP_PalWork_BreedFarm_C_OnUpdateContainer::K2Node_Select_Default' has a wrong offset!");

// Function WBP_PalWork_BreedFarm.WBP_PalWork_BreedFarm_C.OnUpdateProgress
// 0x0028 (0x0028 - 0x0000)
struct WBP_PalWork_BreedFarm_C_OnUpdateProgress final
{
public:
	double                                        NowProgress;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxProgress;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalWork_BreedFarm_C_OnUpdateProgress) == 0x000008, "Wrong alignment on WBP_PalWork_BreedFarm_C_OnUpdateProgress");
static_assert(sizeof(WBP_PalWork_BreedFarm_C_OnUpdateProgress) == 0x000028, "Wrong size on WBP_PalWork_BreedFarm_C_OnUpdateProgress");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_OnUpdateProgress, NowProgress) == 0x000000, "Member 'WBP_PalWork_BreedFarm_C_OnUpdateProgress::NowProgress' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_OnUpdateProgress, MaxProgress) == 0x000008, "Member 'WBP_PalWork_BreedFarm_C_OnUpdateProgress::MaxProgress' has a wrong offset!");
static_assert(offsetof(WBP_PalWork_BreedFarm_C_OnUpdateProgress, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_PalWork_BreedFarm_C_OnUpdateProgress::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
