#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PaldexScrollList

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Pal_structs.hpp"


namespace SDK::Params
{

// Function WBP_PaldexScrollList.WBP_PaldexScrollList_C.AddDisplayInfo
// 0x0060 (0x0060 - 0x0000)
struct WBP_PaldexScrollList_C_AddDisplayInfo final
{
public:
	TArray<struct FPalUIPaldex_DisplayInfo>       InfoArray;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41EF[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPalUIPaldex_DisplayInfo               CallFunc_Array_Get_Item;                           // 0x0020(0x0038)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41F0[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PaldexScrollList_C_AddDisplayInfo) == 0x000008, "Wrong alignment on WBP_PaldexScrollList_C_AddDisplayInfo");
static_assert(sizeof(WBP_PaldexScrollList_C_AddDisplayInfo) == 0x000060, "Wrong size on WBP_PaldexScrollList_C_AddDisplayInfo");
static_assert(offsetof(WBP_PaldexScrollList_C_AddDisplayInfo, InfoArray) == 0x000000, "Member 'WBP_PaldexScrollList_C_AddDisplayInfo::InfoArray' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_AddDisplayInfo, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_PaldexScrollList_C_AddDisplayInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_AddDisplayInfo, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WBP_PaldexScrollList_C_AddDisplayInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_AddDisplayInfo, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'WBP_PaldexScrollList_C_AddDisplayInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_AddDisplayInfo, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_PaldexScrollList_C_AddDisplayInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_AddDisplayInfo, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'WBP_PaldexScrollList_C_AddDisplayInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_AddDisplayInfo, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'WBP_PaldexScrollList_C_AddDisplayInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_PaldexScrollList.WBP_PaldexScrollList_C.ClickByCharacterID
// 0x0050 (0x0050 - 0x0000)
struct WBP_PaldexScrollList_C_ClickByCharacterID final
{
public:
	class FName                                   CharacterID;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41F1[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41F2[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41F3[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Paldex_List_C*                     K2Node_DynamicCast_AsWBP_Paldex_List;              // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PaldexScrollList_C_ClickByCharacterID) == 0x000008, "Wrong alignment on WBP_PaldexScrollList_C_ClickByCharacterID");
static_assert(sizeof(WBP_PaldexScrollList_C_ClickByCharacterID) == 0x000050, "Wrong size on WBP_PaldexScrollList_C_ClickByCharacterID");
static_assert(offsetof(WBP_PaldexScrollList_C_ClickByCharacterID, CharacterID) == 0x000000, "Member 'WBP_PaldexScrollList_C_ClickByCharacterID::CharacterID' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_ClickByCharacterID, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_PaldexScrollList_C_ClickByCharacterID::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_ClickByCharacterID, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_PaldexScrollList_C_ClickByCharacterID::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_ClickByCharacterID, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_PaldexScrollList_C_ClickByCharacterID::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_ClickByCharacterID, CallFunc_GetAllChildren_ReturnValue) == 0x000018, "Member 'WBP_PaldexScrollList_C_ClickByCharacterID::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_ClickByCharacterID, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_PaldexScrollList_C_ClickByCharacterID::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_ClickByCharacterID, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_PaldexScrollList_C_ClickByCharacterID::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_ClickByCharacterID, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'WBP_PaldexScrollList_C_ClickByCharacterID::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_ClickByCharacterID, K2Node_DynamicCast_AsWBP_Paldex_List) == 0x000040, "Member 'WBP_PaldexScrollList_C_ClickByCharacterID::K2Node_DynamicCast_AsWBP_Paldex_List' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_ClickByCharacterID, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_PaldexScrollList_C_ClickByCharacterID::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_ClickByCharacterID, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000049, "Member 'WBP_PaldexScrollList_C_ClickByCharacterID::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function WBP_PaldexScrollList.WBP_PaldexScrollList_C.ClickByIndex
// 0x0040 (0x0040 - 0x0000)
struct WBP_PaldexScrollList_C_ClickByIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41F4[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41F5[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41F6[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Paldex_List_C*                     K2Node_DynamicCast_AsWBP_Paldex_List;              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PaldexScrollList_C_ClickByIndex) == 0x000008, "Wrong alignment on WBP_PaldexScrollList_C_ClickByIndex");
static_assert(sizeof(WBP_PaldexScrollList_C_ClickByIndex) == 0x000040, "Wrong size on WBP_PaldexScrollList_C_ClickByIndex");
static_assert(offsetof(WBP_PaldexScrollList_C_ClickByIndex, Param_Index) == 0x000000, "Member 'WBP_PaldexScrollList_C_ClickByIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_ClickByIndex, CallFunc_GetAllChildren_ReturnValue) == 0x000008, "Member 'WBP_PaldexScrollList_C_ClickByIndex::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_ClickByIndex, CallFunc_Array_LastIndex_ReturnValue) == 0x000018, "Member 'WBP_PaldexScrollList_C_ClickByIndex::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_ClickByIndex, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_PaldexScrollList_C_ClickByIndex::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_ClickByIndex, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'WBP_PaldexScrollList_C_ClickByIndex::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_ClickByIndex, K2Node_DynamicCast_AsWBP_Paldex_List) == 0x000030, "Member 'WBP_PaldexScrollList_C_ClickByIndex::K2Node_DynamicCast_AsWBP_Paldex_List' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_ClickByIndex, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_PaldexScrollList_C_ClickByIndex::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_PaldexScrollList.WBP_PaldexScrollList_C.CreateChild
// 0x0090 (0x0090 - 0x0000)
struct WBP_PaldexScrollList_C_CreateChild final
{
public:
	struct FPalUIPaldex_DisplayInfo               DisplayInfo;                                       // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	TDelegate<void(class FName CharacterID, class UWBP_Paldex_List_C* SelfWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName CharacterID, class UWBP_Paldex_List_C* Widget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Paldex_List_C*                     CallFunc_Create_ReturnValue;                       // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPalScrollBoxSlot*                      K2Node_DynamicCast_AsPal_Scroll_Box_Slot;          // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PaldexScrollList_C_CreateChild) == 0x000008, "Wrong alignment on WBP_PaldexScrollList_C_CreateChild");
static_assert(sizeof(WBP_PaldexScrollList_C_CreateChild) == 0x000090, "Wrong size on WBP_PaldexScrollList_C_CreateChild");
static_assert(offsetof(WBP_PaldexScrollList_C_CreateChild, DisplayInfo) == 0x000000, "Member 'WBP_PaldexScrollList_C_CreateChild::DisplayInfo' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_CreateChild, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WBP_PaldexScrollList_C_CreateChild::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_CreateChild, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'WBP_PaldexScrollList_C_CreateChild::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_CreateChild, K2Node_MakeStruct_Margin) == 0x000058, "Member 'WBP_PaldexScrollList_C_CreateChild::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_CreateChild, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000068, "Member 'WBP_PaldexScrollList_C_CreateChild::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_CreateChild, CallFunc_Create_ReturnValue) == 0x000070, "Member 'WBP_PaldexScrollList_C_CreateChild::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_CreateChild, CallFunc_AddChild_ReturnValue) == 0x000078, "Member 'WBP_PaldexScrollList_C_CreateChild::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_CreateChild, K2Node_DynamicCast_AsPal_Scroll_Box_Slot) == 0x000080, "Member 'WBP_PaldexScrollList_C_CreateChild::K2Node_DynamicCast_AsPal_Scroll_Box_Slot' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_CreateChild, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'WBP_PaldexScrollList_C_CreateChild::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_PaldexScrollList.WBP_PaldexScrollList_C.FocusByCharatcerID
// 0x0020 (0x0020 - 0x0000)
struct WBP_PaldexScrollList_C_FocusByCharatcerID final
{
public:
	class FName                                   CharacterID;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EScrollWhenFocusChanges                       TmpScrollWhenFocusChanged;                         // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41F7[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetFocusTargetByCharacterID_widget;       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PaldexScrollList_C_FocusByCharatcerID) == 0x000008, "Wrong alignment on WBP_PaldexScrollList_C_FocusByCharatcerID");
static_assert(sizeof(WBP_PaldexScrollList_C_FocusByCharatcerID) == 0x000020, "Wrong size on WBP_PaldexScrollList_C_FocusByCharatcerID");
static_assert(offsetof(WBP_PaldexScrollList_C_FocusByCharatcerID, CharacterID) == 0x000000, "Member 'WBP_PaldexScrollList_C_FocusByCharatcerID::CharacterID' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_FocusByCharatcerID, TmpScrollWhenFocusChanged) == 0x000008, "Member 'WBP_PaldexScrollList_C_FocusByCharatcerID::TmpScrollWhenFocusChanged' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_FocusByCharatcerID, CallFunc_GetFocusTargetByCharacterID_widget) == 0x000010, "Member 'WBP_PaldexScrollList_C_FocusByCharatcerID::CallFunc_GetFocusTargetByCharacterID_widget' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_FocusByCharatcerID, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_PaldexScrollList_C_FocusByCharatcerID::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_PaldexScrollList.WBP_PaldexScrollList_C.FocusByIndex
// 0x0018 (0x0018 - 0x0000)
struct WBP_PaldexScrollList_C_FocusByIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41F8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetFocusTargetByIndex_target;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PaldexScrollList_C_FocusByIndex) == 0x000008, "Wrong alignment on WBP_PaldexScrollList_C_FocusByIndex");
static_assert(sizeof(WBP_PaldexScrollList_C_FocusByIndex) == 0x000018, "Wrong size on WBP_PaldexScrollList_C_FocusByIndex");
static_assert(offsetof(WBP_PaldexScrollList_C_FocusByIndex, Param_Index) == 0x000000, "Member 'WBP_PaldexScrollList_C_FocusByIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_FocusByIndex, CallFunc_GetFocusTargetByIndex_target) == 0x000008, "Member 'WBP_PaldexScrollList_C_FocusByIndex::CallFunc_GetFocusTargetByIndex_target' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_FocusByIndex, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_PaldexScrollList_C_FocusByIndex::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_PaldexScrollList.WBP_PaldexScrollList_C.GetFocusTargetByCharacterID
// 0x0058 (0x0058 - 0x0000)
struct WBP_PaldexScrollList_C_GetFocusTargetByCharacterID final
{
public:
	class FName                                   CharacterID;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Widget;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41F9[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41FA[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Paldex_List_C*                     K2Node_DynamicCast_AsWBP_Paldex_List;              // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41FB[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41FC[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PaldexScrollList_C_GetFocusTargetByCharacterID) == 0x000008, "Wrong alignment on WBP_PaldexScrollList_C_GetFocusTargetByCharacterID");
static_assert(sizeof(WBP_PaldexScrollList_C_GetFocusTargetByCharacterID) == 0x000058, "Wrong size on WBP_PaldexScrollList_C_GetFocusTargetByCharacterID");
static_assert(offsetof(WBP_PaldexScrollList_C_GetFocusTargetByCharacterID, CharacterID) == 0x000000, "Member 'WBP_PaldexScrollList_C_GetFocusTargetByCharacterID::CharacterID' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_GetFocusTargetByCharacterID, Widget) == 0x000008, "Member 'WBP_PaldexScrollList_C_GetFocusTargetByCharacterID::Widget' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_GetFocusTargetByCharacterID, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_PaldexScrollList_C_GetFocusTargetByCharacterID::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_GetFocusTargetByCharacterID, CallFunc_GetAllChildren_ReturnValue) == 0x000018, "Member 'WBP_PaldexScrollList_C_GetFocusTargetByCharacterID::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_GetFocusTargetByCharacterID, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'WBP_PaldexScrollList_C_GetFocusTargetByCharacterID::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_GetFocusTargetByCharacterID, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_PaldexScrollList_C_GetFocusTargetByCharacterID::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_GetFocusTargetByCharacterID, K2Node_DynamicCast_AsWBP_Paldex_List) == 0x000038, "Member 'WBP_PaldexScrollList_C_GetFocusTargetByCharacterID::K2Node_DynamicCast_AsWBP_Paldex_List' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_GetFocusTargetByCharacterID, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_PaldexScrollList_C_GetFocusTargetByCharacterID::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_GetFocusTargetByCharacterID, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'WBP_PaldexScrollList_C_GetFocusTargetByCharacterID::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_GetFocusTargetByCharacterID, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000048, "Member 'WBP_PaldexScrollList_C_GetFocusTargetByCharacterID::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_GetFocusTargetByCharacterID, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'WBP_PaldexScrollList_C_GetFocusTargetByCharacterID::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_GetFocusTargetByCharacterID, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'WBP_PaldexScrollList_C_GetFocusTargetByCharacterID::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_PaldexScrollList.WBP_PaldexScrollList_C.GetFocusTargetByIndex
// 0x0020 (0x0020 - 0x0000)
struct WBP_PaldexScrollList_C_GetFocusTargetByIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41FD[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Target;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Paldex_List_C*                     CallFunc_GetWidgetByIndex_Widget;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PaldexScrollList_C_GetFocusTargetByIndex) == 0x000008, "Wrong alignment on WBP_PaldexScrollList_C_GetFocusTargetByIndex");
static_assert(sizeof(WBP_PaldexScrollList_C_GetFocusTargetByIndex) == 0x000020, "Wrong size on WBP_PaldexScrollList_C_GetFocusTargetByIndex");
static_assert(offsetof(WBP_PaldexScrollList_C_GetFocusTargetByIndex, Param_Index) == 0x000000, "Member 'WBP_PaldexScrollList_C_GetFocusTargetByIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_GetFocusTargetByIndex, Target) == 0x000008, "Member 'WBP_PaldexScrollList_C_GetFocusTargetByIndex::Target' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_GetFocusTargetByIndex, CallFunc_GetWidgetByIndex_Widget) == 0x000010, "Member 'WBP_PaldexScrollList_C_GetFocusTargetByIndex::CallFunc_GetWidgetByIndex_Widget' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_GetFocusTargetByIndex, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_PaldexScrollList_C_GetFocusTargetByIndex::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_PaldexScrollList.WBP_PaldexScrollList_C.GetWidgetByIndex
// 0x0048 (0x0048 - 0x0000)
struct WBP_PaldexScrollList_C_GetWidgetByIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41FE[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Paldex_List_C*                     Widget;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41FF[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4200[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Paldex_List_C*                     K2Node_DynamicCast_AsWBP_Paldex_List;              // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PaldexScrollList_C_GetWidgetByIndex) == 0x000008, "Wrong alignment on WBP_PaldexScrollList_C_GetWidgetByIndex");
static_assert(sizeof(WBP_PaldexScrollList_C_GetWidgetByIndex) == 0x000048, "Wrong size on WBP_PaldexScrollList_C_GetWidgetByIndex");
static_assert(offsetof(WBP_PaldexScrollList_C_GetWidgetByIndex, Param_Index) == 0x000000, "Member 'WBP_PaldexScrollList_C_GetWidgetByIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_GetWidgetByIndex, Widget) == 0x000008, "Member 'WBP_PaldexScrollList_C_GetWidgetByIndex::Widget' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_GetWidgetByIndex, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'WBP_PaldexScrollList_C_GetWidgetByIndex::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_GetWidgetByIndex, CallFunc_Array_LastIndex_ReturnValue) == 0x000020, "Member 'WBP_PaldexScrollList_C_GetWidgetByIndex::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_GetWidgetByIndex, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_PaldexScrollList_C_GetWidgetByIndex::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_GetWidgetByIndex, CallFunc_Greater_IntInt_ReturnValue) == 0x000030, "Member 'WBP_PaldexScrollList_C_GetWidgetByIndex::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_GetWidgetByIndex, K2Node_DynamicCast_AsWBP_Paldex_List) == 0x000038, "Member 'WBP_PaldexScrollList_C_GetWidgetByIndex::K2Node_DynamicCast_AsWBP_Paldex_List' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_GetWidgetByIndex, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_PaldexScrollList_C_GetWidgetByIndex::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_PaldexScrollList.WBP_PaldexScrollList_C.OnClickedAnyPanel__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_PaldexScrollList_C_OnClickedAnyPanel__DelegateSignature final
{
public:
	class FName                                   CharacterID;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Paldex_List_C*                     Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PaldexScrollList_C_OnClickedAnyPanel__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PaldexScrollList_C_OnClickedAnyPanel__DelegateSignature");
static_assert(sizeof(WBP_PaldexScrollList_C_OnClickedAnyPanel__DelegateSignature) == 0x000010, "Wrong size on WBP_PaldexScrollList_C_OnClickedAnyPanel__DelegateSignature");
static_assert(offsetof(WBP_PaldexScrollList_C_OnClickedAnyPanel__DelegateSignature, CharacterID) == 0x000000, "Member 'WBP_PaldexScrollList_C_OnClickedAnyPanel__DelegateSignature::CharacterID' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_OnClickedAnyPanel__DelegateSignature, Widget) == 0x000008, "Member 'WBP_PaldexScrollList_C_OnClickedAnyPanel__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_PaldexScrollList.WBP_PaldexScrollList_C.OnClickedPanel_Internal
// 0x0010 (0x0010 - 0x0000)
struct WBP_PaldexScrollList_C_OnClickedPanel_Internal final
{
public:
	class FName                                   CharacterID;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Paldex_List_C*                     Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PaldexScrollList_C_OnClickedPanel_Internal) == 0x000008, "Wrong alignment on WBP_PaldexScrollList_C_OnClickedPanel_Internal");
static_assert(sizeof(WBP_PaldexScrollList_C_OnClickedPanel_Internal) == 0x000010, "Wrong size on WBP_PaldexScrollList_C_OnClickedPanel_Internal");
static_assert(offsetof(WBP_PaldexScrollList_C_OnClickedPanel_Internal, CharacterID) == 0x000000, "Member 'WBP_PaldexScrollList_C_OnClickedPanel_Internal::CharacterID' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_OnClickedPanel_Internal, Widget) == 0x000008, "Member 'WBP_PaldexScrollList_C_OnClickedPanel_Internal::Widget' has a wrong offset!");

// Function WBP_PaldexScrollList.WBP_PaldexScrollList_C.OnHoveredAnyPanel__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_PaldexScrollList_C_OnHoveredAnyPanel__DelegateSignature final
{
public:
	class FName                                   CharacterID;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Paldex_List_C*                     SelfWidget;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PaldexScrollList_C_OnHoveredAnyPanel__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PaldexScrollList_C_OnHoveredAnyPanel__DelegateSignature");
static_assert(sizeof(WBP_PaldexScrollList_C_OnHoveredAnyPanel__DelegateSignature) == 0x000010, "Wrong size on WBP_PaldexScrollList_C_OnHoveredAnyPanel__DelegateSignature");
static_assert(offsetof(WBP_PaldexScrollList_C_OnHoveredAnyPanel__DelegateSignature, CharacterID) == 0x000000, "Member 'WBP_PaldexScrollList_C_OnHoveredAnyPanel__DelegateSignature::CharacterID' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_OnHoveredAnyPanel__DelegateSignature, SelfWidget) == 0x000008, "Member 'WBP_PaldexScrollList_C_OnHoveredAnyPanel__DelegateSignature::SelfWidget' has a wrong offset!");

// Function WBP_PaldexScrollList.WBP_PaldexScrollList_C.OnHoveredPanel_Internal
// 0x0010 (0x0010 - 0x0000)
struct WBP_PaldexScrollList_C_OnHoveredPanel_Internal final
{
public:
	class FName                                   CharacterID;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Paldex_List_C*                     SelfWidget;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PaldexScrollList_C_OnHoveredPanel_Internal) == 0x000008, "Wrong alignment on WBP_PaldexScrollList_C_OnHoveredPanel_Internal");
static_assert(sizeof(WBP_PaldexScrollList_C_OnHoveredPanel_Internal) == 0x000010, "Wrong size on WBP_PaldexScrollList_C_OnHoveredPanel_Internal");
static_assert(offsetof(WBP_PaldexScrollList_C_OnHoveredPanel_Internal, CharacterID) == 0x000000, "Member 'WBP_PaldexScrollList_C_OnHoveredPanel_Internal::CharacterID' has a wrong offset!");
static_assert(offsetof(WBP_PaldexScrollList_C_OnHoveredPanel_Internal, SelfWidget) == 0x000008, "Member 'WBP_PaldexScrollList_C_OnHoveredPanel_Internal::SelfWidget' has a wrong offset!");

}

