#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IngameMenuConstruction_ItemSlot

#include "Basic.hpp"

#include "Pal_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_IngameMenuConstruction_ItemSlot.WBP_IngameMenuConstruction_ItemSlot_C
// 0x00B8 (0x0330 - 0x0278)
class UWBP_IngameMenuConstruction_ItemSlot_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       Anm_LtoS;                                          // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anm_OnToOff;                                       // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     BP_PalTextBlock_C_81;                              // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_2;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MainMenu_NewDot_C*                 WBP_MainMenu_NewDot;                               // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalCommonNewMark_0_C*              WBP_PalCommonNewMark_0;                            // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FPalBuildObjectData                    BuildObjectData;                                   // 0x02B0(0x0080)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void PlayAnimCanNotBuild();
	void PlayAnimToSmall();
	void SetNewIconVisibility(bool Visable);
	void Setup(const struct FPalBuildObjectData& Param_BuildObjectData);

	struct FVector2D GetCanvasSize() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_IngameMenuConstruction_ItemSlot_C">();
	}
	static class UWBP_IngameMenuConstruction_ItemSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_IngameMenuConstruction_ItemSlot_C>();
	}
};
static_assert(alignof(UWBP_IngameMenuConstruction_ItemSlot_C) == 0x000008, "Wrong alignment on UWBP_IngameMenuConstruction_ItemSlot_C");
static_assert(sizeof(UWBP_IngameMenuConstruction_ItemSlot_C) == 0x000330, "Wrong size on UWBP_IngameMenuConstruction_ItemSlot_C");
static_assert(offsetof(UWBP_IngameMenuConstruction_ItemSlot_C, Anm_LtoS) == 0x000278, "Member 'UWBP_IngameMenuConstruction_ItemSlot_C::Anm_LtoS' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_ItemSlot_C, Anm_OnToOff) == 0x000280, "Member 'UWBP_IngameMenuConstruction_ItemSlot_C::Anm_OnToOff' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_ItemSlot_C, BP_PalTextBlock_C_81) == 0x000288, "Member 'UWBP_IngameMenuConstruction_ItemSlot_C::BP_PalTextBlock_C_81' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_ItemSlot_C, CanvasPanel_2) == 0x000290, "Member 'UWBP_IngameMenuConstruction_ItemSlot_C::CanvasPanel_2' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_ItemSlot_C, Icon) == 0x000298, "Member 'UWBP_IngameMenuConstruction_ItemSlot_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_ItemSlot_C, WBP_MainMenu_NewDot) == 0x0002A0, "Member 'UWBP_IngameMenuConstruction_ItemSlot_C::WBP_MainMenu_NewDot' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_ItemSlot_C, WBP_PalCommonNewMark_0) == 0x0002A8, "Member 'UWBP_IngameMenuConstruction_ItemSlot_C::WBP_PalCommonNewMark_0' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_ItemSlot_C, BuildObjectData) == 0x0002B0, "Member 'UWBP_IngameMenuConstruction_ItemSlot_C::BuildObjectData' has a wrong offset!");

}

