#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PalCraftInfo_Pal

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_PalCraftInfo_Pal.WBP_PalCraftInfo_Pal_C.BindEvent
// 0x0028 (0x0028 - 0x0000)
struct WBP_PalCraftInfo_Pal_C_BindEvent final
{
public:
	class UPalIndividualCharacterParameter*       Paremter;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float Current, float Last)>    K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float NowSanity, float OldSanity)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalCraftInfo_Pal_C_BindEvent) == 0x000008, "Wrong alignment on WBP_PalCraftInfo_Pal_C_BindEvent");
static_assert(sizeof(WBP_PalCraftInfo_Pal_C_BindEvent) == 0x000028, "Wrong size on WBP_PalCraftInfo_Pal_C_BindEvent");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_BindEvent, Paremter) == 0x000000, "Member 'WBP_PalCraftInfo_Pal_C_BindEvent::Paremter' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_BindEvent, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_PalCraftInfo_Pal_C_BindEvent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_BindEvent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WBP_PalCraftInfo_Pal_C_BindEvent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WBP_PalCraftInfo_Pal.WBP_PalCraftInfo_Pal_C.ExecuteUbergraph_WBP_PalCraftInfo_Pal
// 0x0018 (0x0018 - 0x0000)
struct WBP_PalCraftInfo_Pal_C_ExecuteUbergraph_WBP_PalCraftInfo_Pal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4237[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterial*                              K2Node_DynamicCast_AsMaterial;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalCraftInfo_Pal_C_ExecuteUbergraph_WBP_PalCraftInfo_Pal) == 0x000008, "Wrong alignment on WBP_PalCraftInfo_Pal_C_ExecuteUbergraph_WBP_PalCraftInfo_Pal");
static_assert(sizeof(WBP_PalCraftInfo_Pal_C_ExecuteUbergraph_WBP_PalCraftInfo_Pal) == 0x000018, "Wrong size on WBP_PalCraftInfo_Pal_C_ExecuteUbergraph_WBP_PalCraftInfo_Pal");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_ExecuteUbergraph_WBP_PalCraftInfo_Pal, EntryPoint) == 0x000000, "Member 'WBP_PalCraftInfo_Pal_C_ExecuteUbergraph_WBP_PalCraftInfo_Pal::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_ExecuteUbergraph_WBP_PalCraftInfo_Pal, K2Node_DynamicCast_AsMaterial) == 0x000008, "Member 'WBP_PalCraftInfo_Pal_C_ExecuteUbergraph_WBP_PalCraftInfo_Pal::K2Node_DynamicCast_AsMaterial' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_ExecuteUbergraph_WBP_PalCraftInfo_Pal, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_PalCraftInfo_Pal_C_ExecuteUbergraph_WBP_PalCraftInfo_Pal::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_PalCraftInfo_Pal.WBP_PalCraftInfo_Pal_C.SetTargetPal
// 0x0070 (0x0070 - 0x0000)
struct WBP_PalCraftInfo_Pal_C_SetTargetPal final
{
public:
	class UPalIndividualCharacterSlot*            TargetSlot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFixedAssign;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4238[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterHandle*          CallFunc_GetHandle_ReturnValue;                    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UPalIndividualCharacterHandle> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0018(0x0030)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4239[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterParameter*       CallFunc_TryGetIndividualParameter_ReturnValue;    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFullStomach_ReturnValue;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSanityValue_ReturnValue;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxFullStomach_ReturnValue;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxSanityValue_ReturnValue;            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalCraftInfo_Pal_C_SetTargetPal) == 0x000008, "Wrong alignment on WBP_PalCraftInfo_Pal_C_SetTargetPal");
static_assert(sizeof(WBP_PalCraftInfo_Pal_C_SetTargetPal) == 0x000070, "Wrong size on WBP_PalCraftInfo_Pal_C_SetTargetPal");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_SetTargetPal, TargetSlot) == 0x000000, "Member 'WBP_PalCraftInfo_Pal_C_SetTargetPal::TargetSlot' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_SetTargetPal, IsFixedAssign) == 0x000008, "Member 'WBP_PalCraftInfo_Pal_C_SetTargetPal::IsFixedAssign' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_SetTargetPal, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'WBP_PalCraftInfo_Pal_C_SetTargetPal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_SetTargetPal, CallFunc_GetHandle_ReturnValue) == 0x000010, "Member 'WBP_PalCraftInfo_Pal_C_SetTargetPal::CallFunc_GetHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_SetTargetPal, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000018, "Member 'WBP_PalCraftInfo_Pal_C_SetTargetPal::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_SetTargetPal, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'WBP_PalCraftInfo_Pal_C_SetTargetPal::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_SetTargetPal, CallFunc_TryGetIndividualParameter_ReturnValue) == 0x000050, "Member 'WBP_PalCraftInfo_Pal_C_SetTargetPal::CallFunc_TryGetIndividualParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_SetTargetPal, CallFunc_GetFullStomach_ReturnValue) == 0x000058, "Member 'WBP_PalCraftInfo_Pal_C_SetTargetPal::CallFunc_GetFullStomach_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_SetTargetPal, CallFunc_GetSanityValue_ReturnValue) == 0x00005C, "Member 'WBP_PalCraftInfo_Pal_C_SetTargetPal::CallFunc_GetSanityValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_SetTargetPal, CallFunc_GetMaxFullStomach_ReturnValue) == 0x000060, "Member 'WBP_PalCraftInfo_Pal_C_SetTargetPal::CallFunc_GetMaxFullStomach_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_SetTargetPal, CallFunc_GetMaxSanityValue_ReturnValue) == 0x000064, "Member 'WBP_PalCraftInfo_Pal_C_SetTargetPal::CallFunc_GetMaxSanityValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_SetTargetPal, CallFunc_IsValid_ReturnValue_2) == 0x000068, "Member 'WBP_PalCraftInfo_Pal_C_SetTargetPal::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function WBP_PalCraftInfo_Pal.WBP_PalCraftInfo_Pal_C.UnbindEvent
// 0x0050 (0x0050 - 0x0000)
struct WBP_PalCraftInfo_Pal_C_UnbindEvent final
{
public:
	TDelegate<void(float Current, float Last)>    K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float NowSanity, float OldSanity)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_423A[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterHandle*          K2Node_DynamicCast_AsPal_Individual_Character_Handle; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_423B[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterParameter*       CallFunc_TryGetIndividualParameter_ReturnValue;    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalCraftInfo_Pal_C_UnbindEvent) == 0x000008, "Wrong alignment on WBP_PalCraftInfo_Pal_C_UnbindEvent");
static_assert(sizeof(WBP_PalCraftInfo_Pal_C_UnbindEvent) == 0x000050, "Wrong size on WBP_PalCraftInfo_Pal_C_UnbindEvent");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_UnbindEvent, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_PalCraftInfo_Pal_C_UnbindEvent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_UnbindEvent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'WBP_PalCraftInfo_Pal_C_UnbindEvent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_UnbindEvent, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000020, "Member 'WBP_PalCraftInfo_Pal_C_UnbindEvent::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_UnbindEvent, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000028, "Member 'WBP_PalCraftInfo_Pal_C_UnbindEvent::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_UnbindEvent, K2Node_DynamicCast_AsPal_Individual_Character_Handle) == 0x000030, "Member 'WBP_PalCraftInfo_Pal_C_UnbindEvent::K2Node_DynamicCast_AsPal_Individual_Character_Handle' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_UnbindEvent, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_PalCraftInfo_Pal_C_UnbindEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_UnbindEvent, CallFunc_TryGetIndividualParameter_ReturnValue) == 0x000040, "Member 'WBP_PalCraftInfo_Pal_C_UnbindEvent::CallFunc_TryGetIndividualParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_UnbindEvent, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'WBP_PalCraftInfo_Pal_C_UnbindEvent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_UnbindEvent, CallFunc_IsValid_ReturnValue_1) == 0x000049, "Member 'WBP_PalCraftInfo_Pal_C_UnbindEvent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_PalCraftInfo_Pal.WBP_PalCraftInfo_Pal_C.UpdateHunger
// 0x0028 (0x0028 - 0x0000)
struct WBP_PalCraftInfo_Pal_C_UpdateHunger final
{
public:
	float                                         Current;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Last;                                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalCraftInfo_Pal_C_UpdateHunger) == 0x000008, "Wrong alignment on WBP_PalCraftInfo_Pal_C_UpdateHunger");
static_assert(sizeof(WBP_PalCraftInfo_Pal_C_UpdateHunger) == 0x000028, "Wrong size on WBP_PalCraftInfo_Pal_C_UpdateHunger");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_UpdateHunger, Current) == 0x000000, "Member 'WBP_PalCraftInfo_Pal_C_UpdateHunger::Current' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_UpdateHunger, Last) == 0x000004, "Member 'WBP_PalCraftInfo_Pal_C_UpdateHunger::Last' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_UpdateHunger, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_PalCraftInfo_Pal_C_UpdateHunger::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_UpdateHunger, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000010, "Member 'WBP_PalCraftInfo_Pal_C_UpdateHunger::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_UpdateHunger, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000018, "Member 'WBP_PalCraftInfo_Pal_C_UpdateHunger::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_UpdateHunger, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000020, "Member 'WBP_PalCraftInfo_Pal_C_UpdateHunger::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function WBP_PalCraftInfo_Pal.WBP_PalCraftInfo_Pal_C.UpdateSanity
// 0x0020 (0x0020 - 0x0000)
struct WBP_PalCraftInfo_Pal_C_UpdateSanity final
{
public:
	float                                         NowSanity;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldSanity;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast_1;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalCraftInfo_Pal_C_UpdateSanity) == 0x000008, "Wrong alignment on WBP_PalCraftInfo_Pal_C_UpdateSanity");
static_assert(sizeof(WBP_PalCraftInfo_Pal_C_UpdateSanity) == 0x000020, "Wrong size on WBP_PalCraftInfo_Pal_C_UpdateSanity");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_UpdateSanity, NowSanity) == 0x000000, "Member 'WBP_PalCraftInfo_Pal_C_UpdateSanity::NowSanity' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_UpdateSanity, OldSanity) == 0x000004, "Member 'WBP_PalCraftInfo_Pal_C_UpdateSanity::OldSanity' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_UpdateSanity, CallFunc_FTrunc_ReturnValue) == 0x000008, "Member 'WBP_PalCraftInfo_Pal_C_UpdateSanity::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_UpdateSanity, CallFunc_FTrunc_ReturnValue_1) == 0x00000C, "Member 'WBP_PalCraftInfo_Pal_C_UpdateSanity::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_UpdateSanity, CallFunc_FTrunc_A_ImplicitCast) == 0x000010, "Member 'WBP_PalCraftInfo_Pal_C_UpdateSanity::CallFunc_FTrunc_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PalCraftInfo_Pal_C_UpdateSanity, CallFunc_FTrunc_A_ImplicitCast_1) == 0x000018, "Member 'WBP_PalCraftInfo_Pal_C_UpdateSanity::CallFunc_FTrunc_A_ImplicitCast_1' has a wrong offset!");

}

