#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PalPossessItemIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PalPossessItemIcon.WBP_PalPossessItemIcon_C
// 0x0070 (0x02E8 - 0x0278)
class UWBP_PalPossessItemIcon_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anm_Red;                                           // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anm_Orange;                                        // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anm_Blue;                                          // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anm_Loop;                                          // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anm_Close;                                         // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anm_Open;                                          // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BaseFlare;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flare;                                             // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line;                                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalCommonItemIcon_C*               WBP_PalCommonItemIcon;                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnFinishedClose;                                   // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void AnmEvent_Close();
	void AnmEvent_Open();
	void ExecuteUbergraph_WBP_PalPossessItemIcon(int32 EntryPoint);
	void Finished_8EA3005E48EF792C3516879160C3F958();
	void Finished_D25F024E49DE41380A3843A691EA22D3();
	void OnFinishedClose__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PalPossessItemIcon_C">();
	}
	static class UWBP_PalPossessItemIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PalPossessItemIcon_C>();
	}
};
static_assert(alignof(UWBP_PalPossessItemIcon_C) == 0x000008, "Wrong alignment on UWBP_PalPossessItemIcon_C");
static_assert(sizeof(UWBP_PalPossessItemIcon_C) == 0x0002E8, "Wrong size on UWBP_PalPossessItemIcon_C");
static_assert(offsetof(UWBP_PalPossessItemIcon_C, UberGraphFrame) == 0x000278, "Member 'UWBP_PalPossessItemIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PalPossessItemIcon_C, Anm_Red) == 0x000280, "Member 'UWBP_PalPossessItemIcon_C::Anm_Red' has a wrong offset!");
static_assert(offsetof(UWBP_PalPossessItemIcon_C, Anm_Orange) == 0x000288, "Member 'UWBP_PalPossessItemIcon_C::Anm_Orange' has a wrong offset!");
static_assert(offsetof(UWBP_PalPossessItemIcon_C, Anm_Blue) == 0x000290, "Member 'UWBP_PalPossessItemIcon_C::Anm_Blue' has a wrong offset!");
static_assert(offsetof(UWBP_PalPossessItemIcon_C, Anm_Loop) == 0x000298, "Member 'UWBP_PalPossessItemIcon_C::Anm_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_PalPossessItemIcon_C, Anm_Close) == 0x0002A0, "Member 'UWBP_PalPossessItemIcon_C::Anm_Close' has a wrong offset!");
static_assert(offsetof(UWBP_PalPossessItemIcon_C, Anm_Open) == 0x0002A8, "Member 'UWBP_PalPossessItemIcon_C::Anm_Open' has a wrong offset!");
static_assert(offsetof(UWBP_PalPossessItemIcon_C, BaseFlare) == 0x0002B0, "Member 'UWBP_PalPossessItemIcon_C::BaseFlare' has a wrong offset!");
static_assert(offsetof(UWBP_PalPossessItemIcon_C, Flare) == 0x0002B8, "Member 'UWBP_PalPossessItemIcon_C::Flare' has a wrong offset!");
static_assert(offsetof(UWBP_PalPossessItemIcon_C, Line) == 0x0002C0, "Member 'UWBP_PalPossessItemIcon_C::Line' has a wrong offset!");
static_assert(offsetof(UWBP_PalPossessItemIcon_C, Shadow) == 0x0002C8, "Member 'UWBP_PalPossessItemIcon_C::Shadow' has a wrong offset!");
static_assert(offsetof(UWBP_PalPossessItemIcon_C, WBP_PalCommonItemIcon) == 0x0002D0, "Member 'UWBP_PalPossessItemIcon_C::WBP_PalCommonItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_PalPossessItemIcon_C, OnFinishedClose) == 0x0002D8, "Member 'UWBP_PalPossessItemIcon_C::OnFinishedClose' has a wrong offset!");

}

