#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PalCutsceneOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Pal_structs.hpp"
#include "Pal_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PalCutsceneOverlay.WBP_PalCutsceneOverlay_C
// 0x0020 (0x0450 - 0x0430)
class UWBP_PalCutsceneOverlay_C final : public UPalUserWidgetOverlayUI
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FPalDataTableRowName_UIInputAction     SkipInput;                                         // 0x0438(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           HideTimerHandle;                                   // 0x0440(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   InputActionHandle;                                 // 0x0448(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          IsDisplaying;                                      // 0x044C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void Display();
	void ExecuteUbergraph_WBP_PalCutsceneOverlay(int32 EntryPoint);
	void Hide();
	struct FEventReply OnAnalogValueChanged(const struct FGeometry& MyGeometry, const struct FAnalogInputEvent& InAnalogInputEvent);
	struct FEventReply OnPreviewKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnPreviewMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void Skip();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PalCutsceneOverlay_C">();
	}
	static class UWBP_PalCutsceneOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PalCutsceneOverlay_C>();
	}
};
static_assert(alignof(UWBP_PalCutsceneOverlay_C) == 0x000008, "Wrong alignment on UWBP_PalCutsceneOverlay_C");
static_assert(sizeof(UWBP_PalCutsceneOverlay_C) == 0x000450, "Wrong size on UWBP_PalCutsceneOverlay_C");
static_assert(offsetof(UWBP_PalCutsceneOverlay_C, UberGraphFrame) == 0x000430, "Member 'UWBP_PalCutsceneOverlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PalCutsceneOverlay_C, SkipInput) == 0x000438, "Member 'UWBP_PalCutsceneOverlay_C::SkipInput' has a wrong offset!");
static_assert(offsetof(UWBP_PalCutsceneOverlay_C, HideTimerHandle) == 0x000440, "Member 'UWBP_PalCutsceneOverlay_C::HideTimerHandle' has a wrong offset!");
static_assert(offsetof(UWBP_PalCutsceneOverlay_C, InputActionHandle) == 0x000448, "Member 'UWBP_PalCutsceneOverlay_C::InputActionHandle' has a wrong offset!");
static_assert(offsetof(UWBP_PalCutsceneOverlay_C, IsDisplaying) == 0x00044C, "Member 'UWBP_PalCutsceneOverlay_C::IsDisplaying' has a wrong offset!");

}

