#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IngameMenuConstruction_Tab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Pal_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_IngameMenuConstruction_Tab.WBP_IngameMenuConstruction_Tab_C
// 0x00B8 (0x0330 - 0x0278)
class UWBP_IngameMenuConstruction_Tab_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anm_NormalToFocus;                                 // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_Category;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenuConstruction_TabSub_C*   WBP_IngameMenuConstruction_TabSub;                 // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalCommonNewMark_0_C*              WBP_PalCommonNewMark;                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalInvisibleButton_C*              WBP_PalInvisibleButton;                            // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_IngameMenuConstruction_TabSub_C*> Tabs;                                              // 0x02B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         TabNum;                                            // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_477D[0x4];                                     // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             SwitchTab;                                         // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	EPalBuildObjectTypeA                          Type_A;                                            // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NowActive;                                         // 0x02D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_477E[0x2];                                     // 0x02DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LastIndex;                                         // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EPalBuildObjectTypeA, TSoftObjectPtr<class UTexture2D>> IconMap;                                           // 0x02E0(0x0050)(Edit, BlueprintVisible)

public:
	void BndEvt__WBP_IngameMenuConstruction_Tab_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Construct();
	void ExecuteUbergraph_WBP_IngameMenuConstruction_Tab(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void ResetActiveTab();
	void SetActiveNewMark(bool Active);
	void SetActiveTab(int32 Param_Index);
	void SetTab(int32 Num, EPalBuildObjectTypeA TypeA);
	void SetupTabs();
	void SwitchTab__DelegateSignature(EPalBuildObjectTypeA TypeA);
	void SwitchToTab();

	void GetTabNum(int32* Param_TabNum) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_IngameMenuConstruction_Tab_C">();
	}
	static class UWBP_IngameMenuConstruction_Tab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_IngameMenuConstruction_Tab_C>();
	}
};
static_assert(alignof(UWBP_IngameMenuConstruction_Tab_C) == 0x000008, "Wrong alignment on UWBP_IngameMenuConstruction_Tab_C");
static_assert(sizeof(UWBP_IngameMenuConstruction_Tab_C) == 0x000330, "Wrong size on UWBP_IngameMenuConstruction_Tab_C");
static_assert(offsetof(UWBP_IngameMenuConstruction_Tab_C, UberGraphFrame) == 0x000278, "Member 'UWBP_IngameMenuConstruction_Tab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Tab_C, Anm_NormalToFocus) == 0x000280, "Member 'UWBP_IngameMenuConstruction_Tab_C::Anm_NormalToFocus' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Tab_C, Image_Icon) == 0x000288, "Member 'UWBP_IngameMenuConstruction_Tab_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Tab_C, Text_Category) == 0x000290, "Member 'UWBP_IngameMenuConstruction_Tab_C::Text_Category' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Tab_C, WBP_IngameMenuConstruction_TabSub) == 0x000298, "Member 'UWBP_IngameMenuConstruction_Tab_C::WBP_IngameMenuConstruction_TabSub' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Tab_C, WBP_PalCommonNewMark) == 0x0002A0, "Member 'UWBP_IngameMenuConstruction_Tab_C::WBP_PalCommonNewMark' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Tab_C, WBP_PalInvisibleButton) == 0x0002A8, "Member 'UWBP_IngameMenuConstruction_Tab_C::WBP_PalInvisibleButton' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Tab_C, Tabs) == 0x0002B0, "Member 'UWBP_IngameMenuConstruction_Tab_C::Tabs' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Tab_C, TabNum) == 0x0002C0, "Member 'UWBP_IngameMenuConstruction_Tab_C::TabNum' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Tab_C, SwitchTab) == 0x0002C8, "Member 'UWBP_IngameMenuConstruction_Tab_C::SwitchTab' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Tab_C, Type_A) == 0x0002D8, "Member 'UWBP_IngameMenuConstruction_Tab_C::Type_A' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Tab_C, NowActive) == 0x0002D9, "Member 'UWBP_IngameMenuConstruction_Tab_C::NowActive' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Tab_C, LastIndex) == 0x0002DC, "Member 'UWBP_IngameMenuConstruction_Tab_C::LastIndex' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Tab_C, IconMap) == 0x0002E0, "Member 'UWBP_IngameMenuConstruction_Tab_C::IconMap' has a wrong offset!");

}

