#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenu_Technology_Point

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_MainMenu_Technology_Point.WBP_MainMenu_Technology_Point_C.ExecuteUbergraph_WBP_MainMenu_Technology_Point
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 TechnologyPoint)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E2[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalTechnologyData*                     CallFunc_GetLocalTechnologyData_ReturnValue;       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E3[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBossTechnologyPoints_ReturnValue;      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTechnologyPoints_ReturnValue;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E4[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalTechnologyData*                     CallFunc_GetLocalTechnologyData_ReturnValue_1;     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E5[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 TechnologyPoint)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E6[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    K2Node_Select_Default_1;                           // 0x0078(0x0010)(NoDestructor)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text;          // 0x0088(0x0018)()
};
static_assert(alignof(WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point");
static_assert(sizeof(WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point) == 0x0000A0, "Wrong size on WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point");
static_assert(offsetof(WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point, EntryPoint) == 0x000000, "Member 'WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point, Temp_bool_Variable) == 0x000014, "Member 'WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point, Temp_bool_Variable_1) == 0x000015, "Member 'WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point, CallFunc_PlayAnimation_ReturnValue_2) == 0x000028, "Member 'WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point, CallFunc_GetLocalTechnologyData_ReturnValue) == 0x000030, "Member 'WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point::CallFunc_GetLocalTechnologyData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point, CallFunc_GetBossTechnologyPoints_ReturnValue) == 0x00003C, "Member 'WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point::CallFunc_GetBossTechnologyPoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point, CallFunc_GetTechnologyPoints_ReturnValue) == 0x000040, "Member 'WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point::CallFunc_GetTechnologyPoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point, CallFunc_GetLocalTechnologyData_ReturnValue_1) == 0x000048, "Member 'WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point::CallFunc_GetLocalTechnologyData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point, K2Node_CreateDelegate_OutputDelegate_1) == 0x000054, "Member 'WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point, K2Node_Select_Default) == 0x000068, "Member 'WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point, CallFunc_PlayAnimation_ReturnValue_3) == 0x000070, "Member 'WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point, K2Node_Select_Default_1) == 0x000078, "Member 'WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point, CallFunc_GetLocalizedTextFromHandle_Text) == 0x000088, "Member 'WBP_MainMenu_Technology_Point_C_ExecuteUbergraph_WBP_MainMenu_Technology_Point::CallFunc_GetLocalizedTextFromHandle_Text' has a wrong offset!");

// Function WBP_MainMenu_Technology_Point.WBP_MainMenu_Technology_Point_C.OnUpdateTechnologyPoint
// 0x0020 (0x0020 - 0x0000)
struct WBP_MainMenu_Technology_Point_C_OnUpdateTechnologyPoint final
{
public:
	int32                                         TechnologyPoint;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E7[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(WBP_MainMenu_Technology_Point_C_OnUpdateTechnologyPoint) == 0x000008, "Wrong alignment on WBP_MainMenu_Technology_Point_C_OnUpdateTechnologyPoint");
static_assert(sizeof(WBP_MainMenu_Technology_Point_C_OnUpdateTechnologyPoint) == 0x000020, "Wrong size on WBP_MainMenu_Technology_Point_C_OnUpdateTechnologyPoint");
static_assert(offsetof(WBP_MainMenu_Technology_Point_C_OnUpdateTechnologyPoint, TechnologyPoint) == 0x000000, "Member 'WBP_MainMenu_Technology_Point_C_OnUpdateTechnologyPoint::TechnologyPoint' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Point_C_OnUpdateTechnologyPoint, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'WBP_MainMenu_Technology_Point_C_OnUpdateTechnologyPoint::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Technology_Point_C_OnUpdateTechnologyPoint, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_MainMenu_Technology_Point_C_OnUpdateTechnologyPoint::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

}

