#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InventoryEquipment_StatusUpButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_InventoryEquipment_StatusUpButton.WBP_InventoryEquipment_StatusUpButton_C.BndEvt__WBP_InventoryEquipment_StatusUpButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_InventoryEquipment_StatusUpButton_C_BndEvt__WBP_InventoryEquipment_StatusUpButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventoryEquipment_StatusUpButton_C_BndEvt__WBP_InventoryEquipment_StatusUpButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_InventoryEquipment_StatusUpButton_C_BndEvt__WBP_InventoryEquipment_StatusUpButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_InventoryEquipment_StatusUpButton_C_BndEvt__WBP_InventoryEquipment_StatusUpButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_InventoryEquipment_StatusUpButton_C_BndEvt__WBP_InventoryEquipment_StatusUpButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_InventoryEquipment_StatusUpButton_C_BndEvt__WBP_InventoryEquipment_StatusUpButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_InventoryEquipment_StatusUpButton_C_BndEvt__WBP_InventoryEquipment_StatusUpButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_InventoryEquipment_StatusUpButton.WBP_InventoryEquipment_StatusUpButton_C.ExecuteUbergraph_WBP_InventoryEquipment_StatusUpButton
// 0x0028 (0x0028 - 0x0000)
struct WBP_InventoryEquipment_StatusUpButton_C_ExecuteUbergraph_WBP_InventoryEquipment_StatusUpButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CDB[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventoryEquipment_StatusUpButton_C_ExecuteUbergraph_WBP_InventoryEquipment_StatusUpButton) == 0x000008, "Wrong alignment on WBP_InventoryEquipment_StatusUpButton_C_ExecuteUbergraph_WBP_InventoryEquipment_StatusUpButton");
static_assert(sizeof(WBP_InventoryEquipment_StatusUpButton_C_ExecuteUbergraph_WBP_InventoryEquipment_StatusUpButton) == 0x000028, "Wrong size on WBP_InventoryEquipment_StatusUpButton_C_ExecuteUbergraph_WBP_InventoryEquipment_StatusUpButton");
static_assert(offsetof(WBP_InventoryEquipment_StatusUpButton_C_ExecuteUbergraph_WBP_InventoryEquipment_StatusUpButton, EntryPoint) == 0x000000, "Member 'WBP_InventoryEquipment_StatusUpButton_C_ExecuteUbergraph_WBP_InventoryEquipment_StatusUpButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_StatusUpButton_C_ExecuteUbergraph_WBP_InventoryEquipment_StatusUpButton, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_InventoryEquipment_StatusUpButton_C_ExecuteUbergraph_WBP_InventoryEquipment_StatusUpButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_StatusUpButton_C_ExecuteUbergraph_WBP_InventoryEquipment_StatusUpButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_InventoryEquipment_StatusUpButton_C_ExecuteUbergraph_WBP_InventoryEquipment_StatusUpButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_StatusUpButton_C_ExecuteUbergraph_WBP_InventoryEquipment_StatusUpButton, CallFunc_PlayAnimation_ReturnValue_2) == 0x000018, "Member 'WBP_InventoryEquipment_StatusUpButton_C_ExecuteUbergraph_WBP_InventoryEquipment_StatusUpButton::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_StatusUpButton_C_ExecuteUbergraph_WBP_InventoryEquipment_StatusUpButton, K2Node_ComponentBoundEvent_Button) == 0x000020, "Member 'WBP_InventoryEquipment_StatusUpButton_C_ExecuteUbergraph_WBP_InventoryEquipment_StatusUpButton::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

}

