#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Notice_Deathlog

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Notice_Deathlog.WBP_Notice_Deathlog_C.ExecuteUbergraph_WBP_Notice_Deathlog
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2241[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_LogText;                        // 0x0008(0x0018)()
	TSoftObjectPtr<class UTexture2D>              K2Node_CustomEvent_Icon;                           // 0x0020(0x0030)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2242[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2243[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x006C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2244[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_ShortDisplayTime;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_LongDisplayTime;                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsShort;                        // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2245[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x00C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2246[0x5];                                     // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2247[0x3];                                     // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1;  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog) == 0x000008, "Wrong alignment on WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog");
static_assert(sizeof(WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog) == 0x0000F8, "Wrong size on WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog");
static_assert(offsetof(WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog, EntryPoint) == 0x000000, "Member 'WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog, Temp_bool_Has_Been_Initd_Variable_1) == 0x000006, "Member 'WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog, K2Node_CustomEvent_LogText) == 0x000008, "Member 'WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog::K2Node_CustomEvent_LogText' has a wrong offset!");
static_assert(offsetof(WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog, K2Node_CustomEvent_Icon) == 0x000020, "Member 'WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog::K2Node_CustomEvent_Icon' has a wrong offset!");
static_assert(offsetof(WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000050, "Member 'WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000058, "Member 'WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog, K2Node_DynamicCast_AsTexture_2D) == 0x000060, "Member 'WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog, K2Node_CreateDelegate_OutputDelegate) == 0x00006C, "Member 'WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog, CallFunc_PlayAnimation_ReturnValue) == 0x000080, "Member 'WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog, K2Node_CustomEvent_ShortDisplayTime) == 0x000088, "Member 'WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog::K2Node_CustomEvent_ShortDisplayTime' has a wrong offset!");
static_assert(offsetof(WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog, K2Node_CustomEvent_LongDisplayTime) == 0x000090, "Member 'WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog::K2Node_CustomEvent_LongDisplayTime' has a wrong offset!");
static_assert(offsetof(WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog, K2Node_CreateDelegate_OutputDelegate_1) == 0x000098, "Member 'WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog, K2Node_CustomEvent_IsShort) == 0x0000A8, "Member 'WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog::K2Node_CustomEvent_IsShort' has a wrong offset!");
static_assert(offsetof(WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000B0, "Member 'WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000B8, "Member 'WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0000C8, "Member 'WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog, CallFunc_BooleanAND_ReturnValue) == 0x0000D0, "Member 'WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog, CallFunc_BooleanOR_ReturnValue) == 0x0000D1, "Member 'WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog, Temp_bool_IsClosed_Variable_1) == 0x0000D2, "Member 'WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x0000D8, "Member 'WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x0000E0, "Member 'WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog, CallFunc_IsValid_ReturnValue) == 0x0000E8, "Member 'WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x0000EC, "Member 'WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1) == 0x0000F0, "Member 'WBP_Notice_Deathlog_C_ExecuteUbergraph_WBP_Notice_Deathlog::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1' has a wrong offset!");

// Function WBP_Notice_Deathlog.WBP_Notice_Deathlog_C.OnDeathLogEnd__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Notice_Deathlog_C_OnDeathLogEnd__DelegateSignature final
{
public:
	class UWBP_Notice_Deathlog_C*                 EndedLog;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notice_Deathlog_C_OnDeathLogEnd__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Notice_Deathlog_C_OnDeathLogEnd__DelegateSignature");
static_assert(sizeof(WBP_Notice_Deathlog_C_OnDeathLogEnd__DelegateSignature) == 0x000008, "Wrong size on WBP_Notice_Deathlog_C_OnDeathLogEnd__DelegateSignature");
static_assert(offsetof(WBP_Notice_Deathlog_C_OnDeathLogEnd__DelegateSignature, EndedLog) == 0x000000, "Member 'WBP_Notice_Deathlog_C_OnDeathLogEnd__DelegateSignature::EndedLog' has a wrong offset!");

// Function WBP_Notice_Deathlog.WBP_Notice_Deathlog_C.SetDeathLog
// 0x0048 (0x0048 - 0x0000)
struct WBP_Notice_Deathlog_C_SetDeathLog final
{
public:
	class FText                                   LogText;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0018(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notice_Deathlog_C_SetDeathLog) == 0x000008, "Wrong alignment on WBP_Notice_Deathlog_C_SetDeathLog");
static_assert(sizeof(WBP_Notice_Deathlog_C_SetDeathLog) == 0x000048, "Wrong size on WBP_Notice_Deathlog_C_SetDeathLog");
static_assert(offsetof(WBP_Notice_Deathlog_C_SetDeathLog, LogText) == 0x000000, "Member 'WBP_Notice_Deathlog_C_SetDeathLog::LogText' has a wrong offset!");
static_assert(offsetof(WBP_Notice_Deathlog_C_SetDeathLog, Icon) == 0x000018, "Member 'WBP_Notice_Deathlog_C_SetDeathLog::Icon' has a wrong offset!");

// Function WBP_Notice_Deathlog.WBP_Notice_Deathlog_C.SetDisplayTime
// 0x0010 (0x0010 - 0x0000)
struct WBP_Notice_Deathlog_C_SetDisplayTime final
{
public:
	double                                        ShortDisplayTime;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LongDisplayTime;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notice_Deathlog_C_SetDisplayTime) == 0x000008, "Wrong alignment on WBP_Notice_Deathlog_C_SetDisplayTime");
static_assert(sizeof(WBP_Notice_Deathlog_C_SetDisplayTime) == 0x000010, "Wrong size on WBP_Notice_Deathlog_C_SetDisplayTime");
static_assert(offsetof(WBP_Notice_Deathlog_C_SetDisplayTime, ShortDisplayTime) == 0x000000, "Member 'WBP_Notice_Deathlog_C_SetDisplayTime::ShortDisplayTime' has a wrong offset!");
static_assert(offsetof(WBP_Notice_Deathlog_C_SetDisplayTime, LongDisplayTime) == 0x000008, "Member 'WBP_Notice_Deathlog_C_SetDisplayTime::LongDisplayTime' has a wrong offset!");

// Function WBP_Notice_Deathlog.WBP_Notice_Deathlog_C.SetDisplayTimeType
// 0x0001 (0x0001 - 0x0000)
struct WBP_Notice_Deathlog_C_SetDisplayTimeType final
{
public:
	bool                                          IsShort;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notice_Deathlog_C_SetDisplayTimeType) == 0x000001, "Wrong alignment on WBP_Notice_Deathlog_C_SetDisplayTimeType");
static_assert(sizeof(WBP_Notice_Deathlog_C_SetDisplayTimeType) == 0x000001, "Wrong size on WBP_Notice_Deathlog_C_SetDisplayTimeType");
static_assert(offsetof(WBP_Notice_Deathlog_C_SetDisplayTimeType, IsShort) == 0x000000, "Member 'WBP_Notice_Deathlog_C_SetDisplayTimeType::IsShort' has a wrong offset!");

}

