#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IngameMenuConstruction_Radial

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Pal_structs.hpp"
#include "Pal_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_IngameMenuConstruction_Radial.WBP_IngameMenuConstruction_Radial_C
// 0x0280 (0x0688 - 0x0408)
class UWBP_IngameMenuConstruction_Radial_C final : public UPalUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0408(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anm_Demolish;                                      // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anm_Construction;                                  // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anm_ConstructionToDemolish;                        // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Tab;                                 // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonRadialMenuBase_C*            WBP_CommonRadialMenuBase;                          // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenuConstruction_info_C*     WBP_IngameMenuConstruction_info;                   // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenuConstruction_LR_C*       WBP_IngameMenuConstruction_LR_L;                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenuConstruction_LR_C*       WBP_IngameMenuConstruction_LR_R;                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenuConstruction_Tab_C*      WBP_IngameMenuConstruction_Tab;                    // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenuConstruction_Tab_C*      WBP_IngameMenuConstruction_Tab_1;                  // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenuConstruction_Tab_C*      WBP_IngameMenuConstruction_Tab_2;                  // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenuConstruction_Tab_C*      WBP_IngameMenuConstruction_Tab_3;                  // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenuConstruction_Tab_C*      WBP_IngameMenuConstruction_Tab_4;                  // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenuConstruction_Tab_C*      WBP_IngameMenuConstruction_Tab_5;                  // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenuConstruction_Tab_C*      WBP_IngameMenuConstruction_Tab_6;                  // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenuConstruction_Tab_C*      WBP_IngameMenuConstruction_Tab_7;                  // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenuConstruction_Tab_C*      WBP_IngameMenuConstruction_Tab_8;                  // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameMenuConstruction_Tab_C*      WBP_IngameMenuConstruction_Tab_9;                  // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalKeyGuideIcon_C*                 WBP_PalKeyGuideIcon;                               // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FPalDataTableRowName_UIInputAction     DecideMenuAction;                                  // 0x04A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FPalDataTableRowName_UIInputAction     PrevTabActionName;                                 // 0x04B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FPalDataTableRowName_UIInputAction     PrevTabActionName_Mouse;                           // 0x04B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FPalDataTableRowName_UIInputAction     NextTabActionName;                                 // 0x04C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FPalDataTableRowName_UIInputAction     NextTabActionName_Mouse;                           // 0x04C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<EPalBuildObjectTypeA, bool>              BuildObjectDataListMap;                            // 0x04D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UBP_InGameMenuBuildModel_C*             Model;                                             // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<EPalBuildObjectTypeA, class UWBP_IngameMenuConstruction_Tab_C*> Tabs;                                              // 0x0528(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         CurrentPageIndex;                                  // 0x0578(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalBuildObjectTypeA                          CurrentCategory;                                   // 0x057C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_592E[0x3];                                     // 0x057D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectedIndex;                                     // 0x0580(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_592F[0x4];                                     // 0x0584(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPalBuildObjectData>            CurrentPageObjects;                                // 0x0588(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnBuildModeStart;                                  // 0x0598(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FPalDataTableRowName_UIInputAction     OpenDismantling;                                   // 0x05A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPalUIActionBindData>           ActionBindList;                                    // 0x05B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FPalDataTableRowName_UIInputAction     PrevCategoryAction;                                // 0x05C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FPalDataTableRowName_UIInputAction     NextCategoryAction;                                // 0x05C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   Flag_Name;                                         // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EPalBuildObjectTypeA, struct FPalRadialCatalog> Catalogs;                                          // 0x05D8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EPalBuildObjectTypeA, int32>             CatagoryIndex;                                     // 0x0628(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FPalBuildObjectData>            CurrentNewObjects;                                 // 0x0678(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void CanConstructiBuildObject(const struct FPalBuildObjectData& BuildObjectData, bool* CanConstruct);
	void Close(class UPalUserWidget* ParentWidget);
	void Construct();
	void CreateModel();
	void CreateTab_Internal(EPalBuildObjectTypeA TypeA);
	void ExecuteUbergraph_WBP_IngameMenuConstruction_Radial(int32 EntryPoint);
	void Find_Selected_Index_By_Map_Object_Name(class FName SelectMapObjectName, int32* Page, int32* Param_Index);
	bool Get_Build_Object_Data(int32 Param_Index, struct FPalBuildObjectData* Output);
	bool Get_Selected_Build_Object_Data(struct FPalBuildObjectData* Output);
	void GetPageCount(int32* PageCount);
	bool IsExistsMaterialForBuildObject(const struct FPalBuildObjectData& BuildObjectData);
	void On_Current_Page_Changed(EPalBuildObjectTypeA BuildObjectTypeA, int32 Tab);
	void On_Dicide_Radial_Menu(int32 Param_Index);
	void On_Update_Inventory();
	void OnBuildModeStart__DelegateSignature();
	void OnInitialized();
	void OnNextCategoryAction();
	void OnNextTabAction();
	void OnPrevCategoryAction();
	void OnPrevTabAction();
	void OnSelectedIndexChanged(int32 NewIndex, int32 PrevIndex);
	void Open(class UPalUserWidget* ParentWidget);
	void Select_Map_Object(class FName MapObjectId);
	void Select_Page_and_Index(int32 Page, int32 Param_Index);
	void Select_Page_by_Map_Object(class FName MapObjectId);
	void SelectTab(EPalBuildObjectTypeA TypeA);
	void Set_Current_Page_Index(int32 Page);
	void SetDisablePlayerAction(bool Disable);
	void Setup_Page_Num();
	void Setup_Tab();
	void SetupLR();
	void SetupUIInputAction(class UPalUserWidget* ParentWidget);
	void Start_Dismantle_Mode();
	void Terminate_UIInput_Action(class UPalUserWidget* ParentWidget);
	void Update_New_Flag();
	void Update_Radial_Menu_Center();
	void Update_Radial_Menu_Icon();
	void UpdateConstructionInfo();
	void UpdateTabNewFlag(EPalBuildObjectTypeA TypeA);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_IngameMenuConstruction_Radial_C">();
	}
	static class UWBP_IngameMenuConstruction_Radial_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_IngameMenuConstruction_Radial_C>();
	}
};
static_assert(alignof(UWBP_IngameMenuConstruction_Radial_C) == 0x000008, "Wrong alignment on UWBP_IngameMenuConstruction_Radial_C");
static_assert(sizeof(UWBP_IngameMenuConstruction_Radial_C) == 0x000688, "Wrong size on UWBP_IngameMenuConstruction_Radial_C");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, UberGraphFrame) == 0x000408, "Member 'UWBP_IngameMenuConstruction_Radial_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, Anm_Demolish) == 0x000410, "Member 'UWBP_IngameMenuConstruction_Radial_C::Anm_Demolish' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, Anm_Construction) == 0x000418, "Member 'UWBP_IngameMenuConstruction_Radial_C::Anm_Construction' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, Anm_ConstructionToDemolish) == 0x000420, "Member 'UWBP_IngameMenuConstruction_Radial_C::Anm_ConstructionToDemolish' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, HorizontalBox_Tab) == 0x000428, "Member 'UWBP_IngameMenuConstruction_Radial_C::HorizontalBox_Tab' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, WBP_CommonRadialMenuBase) == 0x000430, "Member 'UWBP_IngameMenuConstruction_Radial_C::WBP_CommonRadialMenuBase' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, WBP_IngameMenuConstruction_info) == 0x000438, "Member 'UWBP_IngameMenuConstruction_Radial_C::WBP_IngameMenuConstruction_info' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, WBP_IngameMenuConstruction_LR_L) == 0x000440, "Member 'UWBP_IngameMenuConstruction_Radial_C::WBP_IngameMenuConstruction_LR_L' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, WBP_IngameMenuConstruction_LR_R) == 0x000448, "Member 'UWBP_IngameMenuConstruction_Radial_C::WBP_IngameMenuConstruction_LR_R' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, WBP_IngameMenuConstruction_Tab) == 0x000450, "Member 'UWBP_IngameMenuConstruction_Radial_C::WBP_IngameMenuConstruction_Tab' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, WBP_IngameMenuConstruction_Tab_1) == 0x000458, "Member 'UWBP_IngameMenuConstruction_Radial_C::WBP_IngameMenuConstruction_Tab_1' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, WBP_IngameMenuConstruction_Tab_2) == 0x000460, "Member 'UWBP_IngameMenuConstruction_Radial_C::WBP_IngameMenuConstruction_Tab_2' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, WBP_IngameMenuConstruction_Tab_3) == 0x000468, "Member 'UWBP_IngameMenuConstruction_Radial_C::WBP_IngameMenuConstruction_Tab_3' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, WBP_IngameMenuConstruction_Tab_4) == 0x000470, "Member 'UWBP_IngameMenuConstruction_Radial_C::WBP_IngameMenuConstruction_Tab_4' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, WBP_IngameMenuConstruction_Tab_5) == 0x000478, "Member 'UWBP_IngameMenuConstruction_Radial_C::WBP_IngameMenuConstruction_Tab_5' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, WBP_IngameMenuConstruction_Tab_6) == 0x000480, "Member 'UWBP_IngameMenuConstruction_Radial_C::WBP_IngameMenuConstruction_Tab_6' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, WBP_IngameMenuConstruction_Tab_7) == 0x000488, "Member 'UWBP_IngameMenuConstruction_Radial_C::WBP_IngameMenuConstruction_Tab_7' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, WBP_IngameMenuConstruction_Tab_8) == 0x000490, "Member 'UWBP_IngameMenuConstruction_Radial_C::WBP_IngameMenuConstruction_Tab_8' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, WBP_IngameMenuConstruction_Tab_9) == 0x000498, "Member 'UWBP_IngameMenuConstruction_Radial_C::WBP_IngameMenuConstruction_Tab_9' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, WBP_PalKeyGuideIcon) == 0x0004A0, "Member 'UWBP_IngameMenuConstruction_Radial_C::WBP_PalKeyGuideIcon' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, DecideMenuAction) == 0x0004A8, "Member 'UWBP_IngameMenuConstruction_Radial_C::DecideMenuAction' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, PrevTabActionName) == 0x0004B0, "Member 'UWBP_IngameMenuConstruction_Radial_C::PrevTabActionName' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, PrevTabActionName_Mouse) == 0x0004B8, "Member 'UWBP_IngameMenuConstruction_Radial_C::PrevTabActionName_Mouse' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, NextTabActionName) == 0x0004C0, "Member 'UWBP_IngameMenuConstruction_Radial_C::NextTabActionName' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, NextTabActionName_Mouse) == 0x0004C8, "Member 'UWBP_IngameMenuConstruction_Radial_C::NextTabActionName_Mouse' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, BuildObjectDataListMap) == 0x0004D0, "Member 'UWBP_IngameMenuConstruction_Radial_C::BuildObjectDataListMap' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, Model) == 0x000520, "Member 'UWBP_IngameMenuConstruction_Radial_C::Model' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, Tabs) == 0x000528, "Member 'UWBP_IngameMenuConstruction_Radial_C::Tabs' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, CurrentPageIndex) == 0x000578, "Member 'UWBP_IngameMenuConstruction_Radial_C::CurrentPageIndex' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, CurrentCategory) == 0x00057C, "Member 'UWBP_IngameMenuConstruction_Radial_C::CurrentCategory' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, SelectedIndex) == 0x000580, "Member 'UWBP_IngameMenuConstruction_Radial_C::SelectedIndex' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, CurrentPageObjects) == 0x000588, "Member 'UWBP_IngameMenuConstruction_Radial_C::CurrentPageObjects' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, OnBuildModeStart) == 0x000598, "Member 'UWBP_IngameMenuConstruction_Radial_C::OnBuildModeStart' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, OpenDismantling) == 0x0005A8, "Member 'UWBP_IngameMenuConstruction_Radial_C::OpenDismantling' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, ActionBindList) == 0x0005B0, "Member 'UWBP_IngameMenuConstruction_Radial_C::ActionBindList' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, PrevCategoryAction) == 0x0005C0, "Member 'UWBP_IngameMenuConstruction_Radial_C::PrevCategoryAction' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, NextCategoryAction) == 0x0005C8, "Member 'UWBP_IngameMenuConstruction_Radial_C::NextCategoryAction' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, Flag_Name) == 0x0005D0, "Member 'UWBP_IngameMenuConstruction_Radial_C::Flag_Name' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, Catalogs) == 0x0005D8, "Member 'UWBP_IngameMenuConstruction_Radial_C::Catalogs' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, CatagoryIndex) == 0x000628, "Member 'UWBP_IngameMenuConstruction_Radial_C::CatagoryIndex' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenuConstruction_Radial_C, CurrentNewObjects) == 0x000678, "Member 'UWBP_IngameMenuConstruction_Radial_C::CurrentNewObjects' has a wrong offset!");

}

