#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenu_Tab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "EPalUIInGameMainMenuTabType_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MainMenu_Tab.WBP_MainMenu_Tab_C
// 0x00B0 (0x0328 - 0x0278)
class UWBP_MainMenu_Tab_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anm_Open_normal;                                   // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anm_Normal;                                        // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anm_Focus;                                         // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anm_Open_focus;                                    // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_Main;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MainMenu_NewDot_C*                 WBP_MainMenu_NewDot;                               // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalCommonButton_C*                 WBP_PalCommonButton;                               // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalCommonNewMark_0_C*              WBP_PalCommonNewMark_0;                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnClicked;                                         // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	EPalUIInGameMainMenuTabType                   BindMainMenuType;                                  // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FAC[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EPalUIInGameMainMenuTabType, struct FDataTableRowHandle> MsgIDMap;                                          // 0x02D8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AnmEvent_FirstOpen(bool IsFocused);
	void AnmEvent_FocusToNormal();
	void AnmEvent_NormalToFocus();
	void BndEvt__WBP_MainMenu_Tab_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WBP_MainMenu_Tab(int32 EntryPoint);
	void OnClicked__DelegateSignature(class UWBP_MainMenu_Tab_C* SelfWidget);
	void OnInitialized();
	void SetEnableAttentionDot(bool IsEnable);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MainMenu_Tab_C">();
	}
	static class UWBP_MainMenu_Tab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MainMenu_Tab_C>();
	}
};
static_assert(alignof(UWBP_MainMenu_Tab_C) == 0x000008, "Wrong alignment on UWBP_MainMenu_Tab_C");
static_assert(sizeof(UWBP_MainMenu_Tab_C) == 0x000328, "Wrong size on UWBP_MainMenu_Tab_C");
static_assert(offsetof(UWBP_MainMenu_Tab_C, UberGraphFrame) == 0x000278, "Member 'UWBP_MainMenu_Tab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Tab_C, Anm_Open_normal) == 0x000280, "Member 'UWBP_MainMenu_Tab_C::Anm_Open_normal' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Tab_C, Anm_Normal) == 0x000288, "Member 'UWBP_MainMenu_Tab_C::Anm_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Tab_C, Anm_Focus) == 0x000290, "Member 'UWBP_MainMenu_Tab_C::Anm_Focus' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Tab_C, Anm_Open_focus) == 0x000298, "Member 'UWBP_MainMenu_Tab_C::Anm_Open_focus' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Tab_C, Text_Main) == 0x0002A0, "Member 'UWBP_MainMenu_Tab_C::Text_Main' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Tab_C, WBP_MainMenu_NewDot) == 0x0002A8, "Member 'UWBP_MainMenu_Tab_C::WBP_MainMenu_NewDot' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Tab_C, WBP_PalCommonButton) == 0x0002B0, "Member 'UWBP_MainMenu_Tab_C::WBP_PalCommonButton' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Tab_C, WBP_PalCommonNewMark_0) == 0x0002B8, "Member 'UWBP_MainMenu_Tab_C::WBP_PalCommonNewMark_0' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Tab_C, OnClicked) == 0x0002C0, "Member 'UWBP_MainMenu_Tab_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Tab_C, BindMainMenuType) == 0x0002D0, "Member 'UWBP_MainMenu_Tab_C::BindMainMenuType' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Tab_C, MsgIDMap) == 0x0002D8, "Member 'UWBP_MainMenu_Tab_C::MsgIDMap' has a wrong offset!");

}

