#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IngameConstruction

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Pal_structs.hpp"


namespace SDK::Params
{

// Function WBP_IngameConstruction.WBP_IngameConstruction_C.UpdateDisplayContent
// 0x0018 (0x0018 - 0x0000)
struct WBP_IngameConstruction_C_UpdateDisplayContent final
{
public:
	class UPalUIBuildingModel*                    Model;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldDisplayWarningForBuildObject_ReturnValue; // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsExistBaseCamp_ReturnValue;              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOutsideBaseCamp_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldDisplayChangeBuildingModeGuide_ReturnValue; // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameConstruction_C_UpdateDisplayContent) == 0x000008, "Wrong alignment on WBP_IngameConstruction_C_UpdateDisplayContent");
static_assert(sizeof(WBP_IngameConstruction_C_UpdateDisplayContent) == 0x000018, "Wrong size on WBP_IngameConstruction_C_UpdateDisplayContent");
static_assert(offsetof(WBP_IngameConstruction_C_UpdateDisplayContent, Model) == 0x000000, "Member 'WBP_IngameConstruction_C_UpdateDisplayContent::Model' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_UpdateDisplayContent, Temp_bool_Variable) == 0x000008, "Member 'WBP_IngameConstruction_C_UpdateDisplayContent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_UpdateDisplayContent, Temp_byte_Variable) == 0x000009, "Member 'WBP_IngameConstruction_C_UpdateDisplayContent::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_UpdateDisplayContent, Temp_byte_Variable_1) == 0x00000A, "Member 'WBP_IngameConstruction_C_UpdateDisplayContent::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_UpdateDisplayContent, Temp_bool_Variable_1) == 0x00000B, "Member 'WBP_IngameConstruction_C_UpdateDisplayContent::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_UpdateDisplayContent, Temp_byte_Variable_2) == 0x00000C, "Member 'WBP_IngameConstruction_C_UpdateDisplayContent::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_UpdateDisplayContent, Temp_byte_Variable_3) == 0x00000D, "Member 'WBP_IngameConstruction_C_UpdateDisplayContent::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_UpdateDisplayContent, CallFunc_ShouldDisplayWarningForBuildObject_ReturnValue) == 0x00000E, "Member 'WBP_IngameConstruction_C_UpdateDisplayContent::CallFunc_ShouldDisplayWarningForBuildObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_UpdateDisplayContent, CallFunc_IsExistBaseCamp_ReturnValue) == 0x00000F, "Member 'WBP_IngameConstruction_C_UpdateDisplayContent::CallFunc_IsExistBaseCamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_UpdateDisplayContent, CallFunc_IsOutsideBaseCamp_ReturnValue) == 0x000010, "Member 'WBP_IngameConstruction_C_UpdateDisplayContent::CallFunc_IsOutsideBaseCamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_UpdateDisplayContent, CallFunc_BooleanAND_ReturnValue) == 0x000011, "Member 'WBP_IngameConstruction_C_UpdateDisplayContent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_UpdateDisplayContent, CallFunc_ShouldDisplayChangeBuildingModeGuide_ReturnValue) == 0x000012, "Member 'WBP_IngameConstruction_C_UpdateDisplayContent::CallFunc_ShouldDisplayChangeBuildingModeGuide_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_UpdateDisplayContent, CallFunc_BooleanAND_ReturnValue_1) == 0x000013, "Member 'WBP_IngameConstruction_C_UpdateDisplayContent::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_UpdateDisplayContent, K2Node_Select_Default) == 0x000014, "Member 'WBP_IngameConstruction_C_UpdateDisplayContent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_UpdateDisplayContent, K2Node_Select_Default_1) == 0x000015, "Member 'WBP_IngameConstruction_C_UpdateDisplayContent::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_IngameConstruction.WBP_IngameConstruction_C.SetWarningText
// 0x0020 (0x0020 - 0x0000)
struct WBP_IngameConstruction_C_SetWarningText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameConstruction_C_SetWarningText) == 0x000008, "Wrong alignment on WBP_IngameConstruction_C_SetWarningText");
static_assert(sizeof(WBP_IngameConstruction_C_SetWarningText) == 0x000020, "Wrong size on WBP_IngameConstruction_C_SetWarningText");
static_assert(offsetof(WBP_IngameConstruction_C_SetWarningText, InText) == 0x000000, "Member 'WBP_IngameConstruction_C_SetWarningText::InText' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetWarningText, CallFunc_TextIsEmpty_ReturnValue) == 0x000018, "Member 'WBP_IngameConstruction_C_SetWarningText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");

// Function WBP_IngameConstruction.WBP_IngameConstruction_C.SetVisibilityOutSideBaseCampWarning
// 0x0001 (0x0001 - 0x0000)
struct WBP_IngameConstruction_C_SetVisibilityOutSideBaseCampWarning final
{
public:
	ESlateVisibility                              NewVisibility;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameConstruction_C_SetVisibilityOutSideBaseCampWarning) == 0x000001, "Wrong alignment on WBP_IngameConstruction_C_SetVisibilityOutSideBaseCampWarning");
static_assert(sizeof(WBP_IngameConstruction_C_SetVisibilityOutSideBaseCampWarning) == 0x000001, "Wrong size on WBP_IngameConstruction_C_SetVisibilityOutSideBaseCampWarning");
static_assert(offsetof(WBP_IngameConstruction_C_SetVisibilityOutSideBaseCampWarning, NewVisibility) == 0x000000, "Member 'WBP_IngameConstruction_C_SetVisibilityOutSideBaseCampWarning::NewVisibility' has a wrong offset!");

// Function WBP_IngameConstruction.WBP_IngameConstruction_C.SetupKeyGuide
// 0x0130 (0x0130 - 0x0000)
struct WBP_IngameConstruction_C_SetupKeyGuide final
{
public:
	class UPalUIBuildingModel*                    Model;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizedText_ReturnValue;             // 0x0008(0x0018)()
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizedText_ReturnValue_1;           // 0x0048(0x0018)()
	TArray<class FName>                           K2Node_MakeArray_Array_1;                          // 0x0060(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_3;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_4;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array_2;                          // 0x0080(0x0010)(ReferenceParm)
	TArray<class FName>                           K2Node_MakeArray_Array_3;                          // 0x0090(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_5;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_6;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array_4;                          // 0x00B0(0x0010)(ReferenceParm)
	TArray<class FName>                           K2Node_MakeArray_Array_5;                          // 0x00C0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_GetLocalizedText_ReturnValue_2;           // 0x00D0(0x0018)()
	class FText                                   CallFunc_GetLocalizedText_ReturnValue_3;           // 0x00E8(0x0018)()
	class FText                                   CallFunc_GetLocalizedText_ReturnValue_4;           // 0x0100(0x0018)()
	class FText                                   CallFunc_GetLocalizedText_ReturnValue_5;           // 0x0118(0x0018)()
};
static_assert(alignof(WBP_IngameConstruction_C_SetupKeyGuide) == 0x000008, "Wrong alignment on WBP_IngameConstruction_C_SetupKeyGuide");
static_assert(sizeof(WBP_IngameConstruction_C_SetupKeyGuide) == 0x000130, "Wrong size on WBP_IngameConstruction_C_SetupKeyGuide");
static_assert(offsetof(WBP_IngameConstruction_C_SetupKeyGuide, Model) == 0x000000, "Member 'WBP_IngameConstruction_C_SetupKeyGuide::Model' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetupKeyGuide, CallFunc_GetLocalizedText_ReturnValue) == 0x000008, "Member 'WBP_IngameConstruction_C_SetupKeyGuide::CallFunc_GetLocalizedText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetupKeyGuide, CallFunc_Conv_StringToName_ReturnValue) == 0x000020, "Member 'WBP_IngameConstruction_C_SetupKeyGuide::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetupKeyGuide, K2Node_MakeArray_Array) == 0x000028, "Member 'WBP_IngameConstruction_C_SetupKeyGuide::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetupKeyGuide, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000038, "Member 'WBP_IngameConstruction_C_SetupKeyGuide::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetupKeyGuide, CallFunc_Conv_StringToName_ReturnValue_2) == 0x000040, "Member 'WBP_IngameConstruction_C_SetupKeyGuide::CallFunc_Conv_StringToName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetupKeyGuide, CallFunc_GetLocalizedText_ReturnValue_1) == 0x000048, "Member 'WBP_IngameConstruction_C_SetupKeyGuide::CallFunc_GetLocalizedText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetupKeyGuide, K2Node_MakeArray_Array_1) == 0x000060, "Member 'WBP_IngameConstruction_C_SetupKeyGuide::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetupKeyGuide, CallFunc_Conv_StringToName_ReturnValue_3) == 0x000070, "Member 'WBP_IngameConstruction_C_SetupKeyGuide::CallFunc_Conv_StringToName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetupKeyGuide, CallFunc_Conv_StringToName_ReturnValue_4) == 0x000078, "Member 'WBP_IngameConstruction_C_SetupKeyGuide::CallFunc_Conv_StringToName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetupKeyGuide, K2Node_MakeArray_Array_2) == 0x000080, "Member 'WBP_IngameConstruction_C_SetupKeyGuide::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetupKeyGuide, K2Node_MakeArray_Array_3) == 0x000090, "Member 'WBP_IngameConstruction_C_SetupKeyGuide::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetupKeyGuide, CallFunc_Conv_StringToName_ReturnValue_5) == 0x0000A0, "Member 'WBP_IngameConstruction_C_SetupKeyGuide::CallFunc_Conv_StringToName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetupKeyGuide, CallFunc_Conv_StringToName_ReturnValue_6) == 0x0000A8, "Member 'WBP_IngameConstruction_C_SetupKeyGuide::CallFunc_Conv_StringToName_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetupKeyGuide, K2Node_MakeArray_Array_4) == 0x0000B0, "Member 'WBP_IngameConstruction_C_SetupKeyGuide::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetupKeyGuide, K2Node_MakeArray_Array_5) == 0x0000C0, "Member 'WBP_IngameConstruction_C_SetupKeyGuide::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetupKeyGuide, CallFunc_GetLocalizedText_ReturnValue_2) == 0x0000D0, "Member 'WBP_IngameConstruction_C_SetupKeyGuide::CallFunc_GetLocalizedText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetupKeyGuide, CallFunc_GetLocalizedText_ReturnValue_3) == 0x0000E8, "Member 'WBP_IngameConstruction_C_SetupKeyGuide::CallFunc_GetLocalizedText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetupKeyGuide, CallFunc_GetLocalizedText_ReturnValue_4) == 0x000100, "Member 'WBP_IngameConstruction_C_SetupKeyGuide::CallFunc_GetLocalizedText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetupKeyGuide, CallFunc_GetLocalizedText_ReturnValue_5) == 0x000118, "Member 'WBP_IngameConstruction_C_SetupKeyGuide::CallFunc_GetLocalizedText_ReturnValue_5' has a wrong offset!");

// Function WBP_IngameConstruction.WBP_IngameConstruction_C.Setup
// 0x0098 (0x0098 - 0x0000)
struct WBP_IngameConstruction_C_Setup final
{
public:
	struct FPalBuildObjectData                    InBuildObjectData;                                 // 0x0000(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_GetMapObjectName_outName;                 // 0x0080(0x0018)()
};
static_assert(alignof(WBP_IngameConstruction_C_Setup) == 0x000008, "Wrong alignment on WBP_IngameConstruction_C_Setup");
static_assert(sizeof(WBP_IngameConstruction_C_Setup) == 0x000098, "Wrong size on WBP_IngameConstruction_C_Setup");
static_assert(offsetof(WBP_IngameConstruction_C_Setup, InBuildObjectData) == 0x000000, "Member 'WBP_IngameConstruction_C_Setup::InBuildObjectData' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_Setup, CallFunc_GetMapObjectName_outName) == 0x000080, "Member 'WBP_IngameConstruction_C_Setup::CallFunc_GetMapObjectName_outName' has a wrong offset!");

// Function WBP_IngameConstruction.WBP_IngameConstruction_C.SetMaterial
// 0x0090 (0x0090 - 0x0000)
struct WBP_IngameConstruction_C_SetMaterial final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   StaticItemId;                                      // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemCount;                                         // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxNum;                                            // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4341[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PalCommonItemIcon_C*               TargetIcon;                                        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_IngameConstruction_Num_C*          TargetNum;                                         // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
	TArray<struct FPalStaticItemIdAndNum>         CallFunc_CollectLocalPlayerControllableItemInfos_OutItemInfos; // 0x0038(0x0010)(ReferenceParm)
	struct FPalStaticItemIdAndNum                 CallFunc_Array_Get_Item;                           // 0x0048(0x000C)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4342[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PalCommonItemIcon_C*               CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_IngameConstruction_Num_C*          CallFunc_Array_Get_Item_2;                         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPalItemIDManager*                      CallFunc_GetItemIDManager_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4343[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalStaticItemDataBase*                 CallFunc_GetStaticItemData_ReturnValue;            // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameConstruction_C_SetMaterial) == 0x000008, "Wrong alignment on WBP_IngameConstruction_C_SetMaterial");
static_assert(sizeof(WBP_IngameConstruction_C_SetMaterial) == 0x000090, "Wrong size on WBP_IngameConstruction_C_SetMaterial");
static_assert(offsetof(WBP_IngameConstruction_C_SetMaterial, Param_Index) == 0x000000, "Member 'WBP_IngameConstruction_C_SetMaterial::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetMaterial, StaticItemId) == 0x000004, "Member 'WBP_IngameConstruction_C_SetMaterial::StaticItemId' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetMaterial, ItemCount) == 0x00000C, "Member 'WBP_IngameConstruction_C_SetMaterial::ItemCount' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetMaterial, MaxNum) == 0x000010, "Member 'WBP_IngameConstruction_C_SetMaterial::MaxNum' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetMaterial, TargetIcon) == 0x000018, "Member 'WBP_IngameConstruction_C_SetMaterial::TargetIcon' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetMaterial, TargetNum) == 0x000020, "Member 'WBP_IngameConstruction_C_SetMaterial::TargetNum' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetMaterial, K2Node_MakeArray_Array) == 0x000028, "Member 'WBP_IngameConstruction_C_SetMaterial::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetMaterial, CallFunc_CollectLocalPlayerControllableItemInfos_OutItemInfos) == 0x000038, "Member 'WBP_IngameConstruction_C_SetMaterial::CallFunc_CollectLocalPlayerControllableItemInfos_OutItemInfos' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetMaterial, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_IngameConstruction_C_SetMaterial::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetMaterial, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'WBP_IngameConstruction_C_SetMaterial::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetMaterial, CallFunc_Greater_IntInt_ReturnValue) == 0x000058, "Member 'WBP_IngameConstruction_C_SetMaterial::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetMaterial, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'WBP_IngameConstruction_C_SetMaterial::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetMaterial, CallFunc_Array_Get_Item_2) == 0x000068, "Member 'WBP_IngameConstruction_C_SetMaterial::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetMaterial, CallFunc_GetItemIDManager_ReturnValue) == 0x000070, "Member 'WBP_IngameConstruction_C_SetMaterial::CallFunc_GetItemIDManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetMaterial, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'WBP_IngameConstruction_C_SetMaterial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetMaterial, CallFunc_GetStaticItemData_ReturnValue) == 0x000080, "Member 'WBP_IngameConstruction_C_SetMaterial::CallFunc_GetStaticItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_SetMaterial, CallFunc_IsValid_ReturnValue_1) == 0x000088, "Member 'WBP_IngameConstruction_C_SetMaterial::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_IngameConstruction.WBP_IngameConstruction_C.SetEnableWarning
// 0x0001 (0x0001 - 0x0000)
struct WBP_IngameConstruction_C_SetEnableWarning final
{
public:
	bool                                          IsEnable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameConstruction_C_SetEnableWarning) == 0x000001, "Wrong alignment on WBP_IngameConstruction_C_SetEnableWarning");
static_assert(sizeof(WBP_IngameConstruction_C_SetEnableWarning) == 0x000001, "Wrong size on WBP_IngameConstruction_C_SetEnableWarning");
static_assert(offsetof(WBP_IngameConstruction_C_SetEnableWarning, IsEnable) == 0x000000, "Member 'WBP_IngameConstruction_C_SetEnableWarning::IsEnable' has a wrong offset!");

// Function WBP_IngameConstruction.WBP_IngameConstruction_C.SetBuildObjectName
// 0x0018 (0x0018 - 0x0000)
struct WBP_IngameConstruction_C_SetBuildObjectName final
{
public:
	class FText                                   InName;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_IngameConstruction_C_SetBuildObjectName) == 0x000008, "Wrong alignment on WBP_IngameConstruction_C_SetBuildObjectName");
static_assert(sizeof(WBP_IngameConstruction_C_SetBuildObjectName) == 0x000018, "Wrong size on WBP_IngameConstruction_C_SetBuildObjectName");
static_assert(offsetof(WBP_IngameConstruction_C_SetBuildObjectName, InName) == 0x000000, "Member 'WBP_IngameConstruction_C_SetBuildObjectName::InName' has a wrong offset!");

// Function WBP_IngameConstruction.WBP_IngameConstruction_C.ResetAllUI
// 0x0008 (0x0008 - 0x0000)
struct WBP_IngameConstruction_C_ResetAllUI final
{
public:
	class UPalUIBuildingModel*                    Model;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameConstruction_C_ResetAllUI) == 0x000008, "Wrong alignment on WBP_IngameConstruction_C_ResetAllUI");
static_assert(sizeof(WBP_IngameConstruction_C_ResetAllUI) == 0x000008, "Wrong size on WBP_IngameConstruction_C_ResetAllUI");
static_assert(offsetof(WBP_IngameConstruction_C_ResetAllUI, Model) == 0x000000, "Member 'WBP_IngameConstruction_C_ResetAllUI::Model' has a wrong offset!");

// Function WBP_IngameConstruction.WBP_IngameConstruction_C.ExecuteUbergraph_WBP_IngameConstruction
// 0x0030 (0x0030 - 0x0000)
struct WBP_IngameConstruction_C_ExecuteUbergraph_WBP_IngameConstruction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4344[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_PalCommonItemIcon_C*>       K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_IngameConstruction_Num_C*>  K2Node_MakeArray_Array_1;                          // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_IngameConstruction_C_ExecuteUbergraph_WBP_IngameConstruction) == 0x000008, "Wrong alignment on WBP_IngameConstruction_C_ExecuteUbergraph_WBP_IngameConstruction");
static_assert(sizeof(WBP_IngameConstruction_C_ExecuteUbergraph_WBP_IngameConstruction) == 0x000030, "Wrong size on WBP_IngameConstruction_C_ExecuteUbergraph_WBP_IngameConstruction");
static_assert(offsetof(WBP_IngameConstruction_C_ExecuteUbergraph_WBP_IngameConstruction, EntryPoint) == 0x000000, "Member 'WBP_IngameConstruction_C_ExecuteUbergraph_WBP_IngameConstruction::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_IngameConstruction_C_ExecuteUbergraph_WBP_IngameConstruction, K2Node_MakeArray_Array) == 0x000008, "Member 'WBP_IngameConstruction_C_ExecuteUbergraph_WBP_IngameConstruction::K2Node_MakeArray_Array' has a wrong offset!");
