#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RecoverPalStateIndicator

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_RecoverPalStateIndicator.WBP_RecoverPalStateIndicator_C.ExecuteUbergraph_WBP_RecoverPalStateIndicator
// 0x0004 (0x0004 - 0x0000)
struct WBP_RecoverPalStateIndicator_C_ExecuteUbergraph_WBP_RecoverPalStateIndicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RecoverPalStateIndicator_C_ExecuteUbergraph_WBP_RecoverPalStateIndicator) == 0x000004, "Wrong alignment on WBP_RecoverPalStateIndicator_C_ExecuteUbergraph_WBP_RecoverPalStateIndicator");
static_assert(sizeof(WBP_RecoverPalStateIndicator_C_ExecuteUbergraph_WBP_RecoverPalStateIndicator) == 0x000004, "Wrong size on WBP_RecoverPalStateIndicator_C_ExecuteUbergraph_WBP_RecoverPalStateIndicator");
static_assert(offsetof(WBP_RecoverPalStateIndicator_C_ExecuteUbergraph_WBP_RecoverPalStateIndicator, EntryPoint) == 0x000000, "Member 'WBP_RecoverPalStateIndicator_C_ExecuteUbergraph_WBP_RecoverPalStateIndicator::EntryPoint' has a wrong offset!");

// Function WBP_RecoverPalStateIndicator.WBP_RecoverPalStateIndicator_C.GetSlotWidget
// 0x0020 (0x0020 - 0x0000)
struct WBP_RecoverPalStateIndicator_C_GetSlotWidget final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A32[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PalCommonCharacterSlotButton_C*    SlotWidget;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A33[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PalCommonCharacterSlotButton_C*    K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RecoverPalStateIndicator_C_GetSlotWidget) == 0x000008, "Wrong alignment on WBP_RecoverPalStateIndicator_C_GetSlotWidget");
static_assert(sizeof(WBP_RecoverPalStateIndicator_C_GetSlotWidget) == 0x000020, "Wrong size on WBP_RecoverPalStateIndicator_C_GetSlotWidget");
static_assert(offsetof(WBP_RecoverPalStateIndicator_C_GetSlotWidget, Param_Index) == 0x000000, "Member 'WBP_RecoverPalStateIndicator_C_GetSlotWidget::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_RecoverPalStateIndicator_C_GetSlotWidget, SlotWidget) == 0x000008, "Member 'WBP_RecoverPalStateIndicator_C_GetSlotWidget::SlotWidget' has a wrong offset!");
static_assert(offsetof(WBP_RecoverPalStateIndicator_C_GetSlotWidget, Temp_int_Variable) == 0x000010, "Member 'WBP_RecoverPalStateIndicator_C_GetSlotWidget::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RecoverPalStateIndicator_C_GetSlotWidget, K2Node_Select_Default) == 0x000018, "Member 'WBP_RecoverPalStateIndicator_C_GetSlotWidget::K2Node_Select_Default' has a wrong offset!");

// Function WBP_RecoverPalStateIndicator.WBP_RecoverPalStateIndicator_C.Initialize
// 0x0088 (0x0088 - 0x0000)
struct WBP_RecoverPalStateIndicator_C_Initialize final
{
public:
	class UPalIndividualCharacterContainer*       CharacterContainer;                                // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalMapObjectRecoverOtomoModel*         ConcreteModel;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A34[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PalCommonCharacterSlotButton_C*    CallFunc_GetSlotWidget_SlotWidget;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPalMapObjectCharacterContainerModule*  CallFunc_GetCharacterContainerModule_ReturnValue;  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterContainer*       CallFunc_GetContainer_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A35[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UPalIndividualCharacterSlot*>    CallFunc_GetSlots_ReturnValue;                     // 0x0038(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A36[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterSlot*            CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A37[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalMapObjectRecoverOtomoModel*         CallFunc_TryGetConcreteModel_ConcreteModel;        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetConcreteModel_ReturnValue;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A38[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDDispatchParameterBase*           CallFunc_GetParam_ReturnValue;                     // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalUIRecoverPalStatusIndicatorParameter* K2Node_DynamicCast_AsPal_UIRecover_Pal_Status_Indicator_Parameter; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RecoverPalStateIndicator_C_Initialize) == 0x000008, "Wrong alignment on WBP_RecoverPalStateIndicator_C_Initialize");
static_assert(sizeof(WBP_RecoverPalStateIndicator_C_Initialize) == 0x000088, "Wrong size on WBP_RecoverPalStateIndicator_C_Initialize");
static_assert(offsetof(WBP_RecoverPalStateIndicator_C_Initialize, CharacterContainer) == 0x000000, "Member 'WBP_RecoverPalStateIndicator_C_Initialize::CharacterContainer' has a wrong offset!");
static_assert(offsetof(WBP_RecoverPalStateIndicator_C_Initialize, ConcreteModel) == 0x000008, "Member 'WBP_RecoverPalStateIndicator_C_Initialize::ConcreteModel' has a wrong offset!");
static_assert(offsetof(WBP_RecoverPalStateIndicator_C_Initialize, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_RecoverPalStateIndicator_C_Initialize::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RecoverPalStateIndicator_C_Initialize, CallFunc_GetSlotWidget_SlotWidget) == 0x000018, "Member 'WBP_RecoverPalStateIndicator_C_Initialize::CallFunc_GetSlotWidget_SlotWidget' has a wrong offset!");
static_assert(offsetof(WBP_RecoverPalStateIndicator_C_Initialize, CallFunc_GetCharacterContainerModule_ReturnValue) == 0x000020, "Member 'WBP_RecoverPalStateIndicator_C_Initialize::CallFunc_GetCharacterContainerModule_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RecoverPalStateIndicator_C_Initialize, CallFunc_GetContainer_ReturnValue) == 0x000028, "Member 'WBP_RecoverPalStateIndicator_C_Initialize::CallFunc_GetContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RecoverPalStateIndicator_C_Initialize, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_RecoverPalStateIndicator_C_Initialize::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RecoverPalStateIndicator_C_Initialize, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'WBP_RecoverPalStateIndicator_C_Initialize::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RecoverPalStateIndicator_C_Initialize, CallFunc_GetSlots_ReturnValue) == 0x000038, "Member 'WBP_RecoverPalStateIndicator_C_Initialize::CallFunc_GetSlots_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RecoverPalStateIndicator_C_Initialize, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'WBP_RecoverPalStateIndicator_C_Initialize::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RecoverPalStateIndicator_C_Initialize, CallFunc_Array_Get_Item) == 0x000050, "Member 'WBP_RecoverPalStateIndicator_C_Initialize::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_RecoverPalStateIndicator_C_Initialize, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'WBP_RecoverPalStateIndicator_C_Initialize::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RecoverPalStateIndicator_C_Initialize, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'WBP_RecoverPalStateIndicator_C_Initialize::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RecoverPalStateIndicator_C_Initialize, CallFunc_TryGetConcreteModel_ConcreteModel) == 0x000060, "Member 'WBP_RecoverPalStateIndicator_C_Initialize::CallFunc_TryGetConcreteModel_ConcreteModel' has a wrong offset!");
static_assert(offsetof(WBP_RecoverPalStateIndicator_C_Initialize, CallFunc_TryGetConcreteModel_ReturnValue) == 0x000068, "Member 'WBP_RecoverPalStateIndicator_C_Initialize::CallFunc_TryGetConcreteModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RecoverPalStateIndicator_C_Initialize, CallFunc_GetParam_ReturnValue) == 0x000070, "Member 'WBP_RecoverPalStateIndicator_C_Initialize::CallFunc_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RecoverPalStateIndicator_C_Initialize, K2Node_DynamicCast_AsPal_UIRecover_Pal_Status_Indicator_Parameter) == 0x000078, "Member 'WBP_RecoverPalStateIndicator_C_Initialize::K2Node_DynamicCast_AsPal_UIRecover_Pal_Status_Indicator_Parameter' has a wrong offset!");
static_assert(offsetof(WBP_RecoverPalStateIndicator_C_Initialize, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'WBP_RecoverPalStateIndicator_C_Initialize::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

