#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IngameMenu_Chest_LockNumInput

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_IngameMenu_Chest_LockNumInput.WBP_IngameMenu_Chest_LockNumInput_C
// 0x0028 (0x02A0 - 0x0278)
class UWBP_IngameMenu_Chest_LockNumInput_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anm_Wrong;                                         // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anm_Correct;                                       // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 InputBase;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 On;                                                // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_IngameMenu_Chest_LockNumInput(int32 EntryPoint);
	void PlayAuthAnm(bool PlayPass);
	void SetOn(bool IsOn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_IngameMenu_Chest_LockNumInput_C">();
	}
	static class UWBP_IngameMenu_Chest_LockNumInput_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_IngameMenu_Chest_LockNumInput_C>();
	}
};
static_assert(alignof(UWBP_IngameMenu_Chest_LockNumInput_C) == 0x000008, "Wrong alignment on UWBP_IngameMenu_Chest_LockNumInput_C");
static_assert(sizeof(UWBP_IngameMenu_Chest_LockNumInput_C) == 0x0002A0, "Wrong size on UWBP_IngameMenu_Chest_LockNumInput_C");
static_assert(offsetof(UWBP_IngameMenu_Chest_LockNumInput_C, UberGraphFrame) == 0x000278, "Member 'UWBP_IngameMenu_Chest_LockNumInput_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_LockNumInput_C, Anm_Wrong) == 0x000280, "Member 'UWBP_IngameMenu_Chest_LockNumInput_C::Anm_Wrong' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_LockNumInput_C, Anm_Correct) == 0x000288, "Member 'UWBP_IngameMenu_Chest_LockNumInput_C::Anm_Correct' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_LockNumInput_C, InputBase) == 0x000290, "Member 'UWBP_IngameMenu_Chest_LockNumInput_C::InputBase' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_LockNumInput_C, On) == 0x000298, "Member 'UWBP_IngameMenu_Chest_LockNumInput_C::On' has a wrong offset!");

}

