#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Paldex_tabset

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_PanelWidgetChildrenSelectorBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Paldex_tabset.WBP_Paldex_tabset_C
// 0x0050 (0x04B0 - 0x0460)
class UWBP_Paldex_tabset_C final : public UWBP_PanelWidgetChildrenSelectorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_Paldex_tabset_C;                // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBox_Tab;                                 // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Main_Menu_Tab_Key_C*               WBP_Main_Menu_Tab_Key_L;                           // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Main_Menu_Tab_Key_C*               WBP_Main_Menu_Tab_Key_R;                           // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Paldex_tab_C*                      WBP_Paldex_tab_Distribution;                       // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Paldex_tab_C*                      WBP_Paldex_tab_Model;                              // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnSelectedModelTab;                                // 0x0490(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnSelectedDistributionTab;                         // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_Paldex_tabset_WBP_Main_Menu_Tab_Key_L_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature();
	void BndEvt__WBP_Paldex_tabset_WBP_Main_Menu_Tab_Key_R_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();
	void BndEvt__WBP_Paldex_tabset_WBP_Paldex_tab_Distribution_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void BndEvt__WBP_Paldex_tabset_WBP_Paldex_tab_Model_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void ExecuteUbergraph_WBP_Paldex_tabset(int32 EntryPoint);
	void OnChangedIndexEvent(int32 OldIndex, int32 NewIndex, class UWidget* FocusTargetWidget);
	void OnNextEvent(int32 OldIndex, int32 NewIndex);
	void OnPrevEvent(int32 OldIndex, int32 NewIndex);
	void OnSelectedDistributionTab__DelegateSignature();
	void OnSelectedModelTab__DelegateSignature();
	void OnInitialized();
	void RegisterPanelWidget(class UPanelWidget** PanelWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Paldex_tabset_C">();
	}
	static class UWBP_Paldex_tabset_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Paldex_tabset_C>();
	}
};
static_assert(alignof(UWBP_Paldex_tabset_C) == 0x000008, "Wrong alignment on UWBP_Paldex_tabset_C");
static_assert(sizeof(UWBP_Paldex_tabset_C) == 0x0004B0, "Wrong size on UWBP_Paldex_tabset_C");
static_assert(offsetof(UWBP_Paldex_tabset_C, UberGraphFrame_WBP_Paldex_tabset_C) == 0x000460, "Member 'UWBP_Paldex_tabset_C::UberGraphFrame_WBP_Paldex_tabset_C' has a wrong offset!");
static_assert(offsetof(UWBP_Paldex_tabset_C, HorizontalBox_Tab) == 0x000468, "Member 'UWBP_Paldex_tabset_C::HorizontalBox_Tab' has a wrong offset!");
static_assert(offsetof(UWBP_Paldex_tabset_C, WBP_Main_Menu_Tab_Key_L) == 0x000470, "Member 'UWBP_Paldex_tabset_C::WBP_Main_Menu_Tab_Key_L' has a wrong offset!");
static_assert(offsetof(UWBP_Paldex_tabset_C, WBP_Main_Menu_Tab_Key_R) == 0x000478, "Member 'UWBP_Paldex_tabset_C::WBP_Main_Menu_Tab_Key_R' has a wrong offset!");
static_assert(offsetof(UWBP_Paldex_tabset_C, WBP_Paldex_tab_Distribution) == 0x000480, "Member 'UWBP_Paldex_tabset_C::WBP_Paldex_tab_Distribution' has a wrong offset!");
static_assert(offsetof(UWBP_Paldex_tabset_C, WBP_Paldex_tab_Model) == 0x000488, "Member 'UWBP_Paldex_tabset_C::WBP_Paldex_tab_Model' has a wrong offset!");
static_assert(offsetof(UWBP_Paldex_tabset_C, OnSelectedModelTab) == 0x000490, "Member 'UWBP_Paldex_tabset_C::OnSelectedModelTab' has a wrong offset!");
static_assert(offsetof(UWBP_Paldex_tabset_C, OnSelectedDistributionTab) == 0x0004A0, "Member 'UWBP_Paldex_tabset_C::OnSelectedDistributionTab' has a wrong offset!");

}

