#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ConvertItemMenuScrollListBlock

#include "Basic.hpp"

#include "Pal_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ConvertItemMenuScrollListBlock.WBP_ConvertItemMenuScrollListBlock_C
// 0x0038 (0x0440 - 0x0408)
class UWBP_ConvertItemMenuScrollListBlock_C final : public UPalUserWidget
{
public:
	class UWrapBox*                               WrapBox;                                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnClickedAnyContent;                               // 0x0410(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnHoveredAnyContent;                               // 0x0420(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnUnhoveredAnyContent;                             // 0x0430(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void AddRecipeList(TArray<class FName>& RecipeIDArray);
	void CreateRecipeIconWidget(class FName RecipeID, class UWBP_PalConvertItemMenu_RecipeSlotButton_C** CreatedWidget);
	void FocusTopContent();
	void GetFocusTarget(class UWidget** Target);
	void OnClicked_Internal(class UWBP_PalConvertItemMenu_RecipeSlotButton_C* Widget);
	void OnClickedAnyContent__DelegateSignature(class UWBP_PalConvertItemMenu_RecipeSlotButton_C* Widget);
	void OnHovered_Internal(class UWBP_PalConvertItemMenu_RecipeSlotButton_C* SelfWidget);
	void OnHoveredAnyContent__DelegateSignature(class UWBP_PalConvertItemMenu_RecipeSlotButton_C* Widget);
	void OnUnhovered_Internal(class UWBP_PalConvertItemMenu_RecipeSlotButton_C* SelftWidget);
	void OnUnhoveredAnyContent__DelegateSignature(class UWBP_PalConvertItemMenu_RecipeSlotButton_C* Widget);
	void SetCategoryName(const class FText& CategoryNameText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ConvertItemMenuScrollListBlock_C">();
	}
	static class UWBP_ConvertItemMenuScrollListBlock_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ConvertItemMenuScrollListBlock_C>();
	}
};
static_assert(alignof(UWBP_ConvertItemMenuScrollListBlock_C) == 0x000008, "Wrong alignment on UWBP_ConvertItemMenuScrollListBlock_C");
static_assert(sizeof(UWBP_ConvertItemMenuScrollListBlock_C) == 0x000440, "Wrong size on UWBP_ConvertItemMenuScrollListBlock_C");
static_assert(offsetof(UWBP_ConvertItemMenuScrollListBlock_C, WrapBox) == 0x000408, "Member 'UWBP_ConvertItemMenuScrollListBlock_C::WrapBox' has a wrong offset!");
static_assert(offsetof(UWBP_ConvertItemMenuScrollListBlock_C, OnClickedAnyContent) == 0x000410, "Member 'UWBP_ConvertItemMenuScrollListBlock_C::OnClickedAnyContent' has a wrong offset!");
static_assert(offsetof(UWBP_ConvertItemMenuScrollListBlock_C, OnHoveredAnyContent) == 0x000420, "Member 'UWBP_ConvertItemMenuScrollListBlock_C::OnHoveredAnyContent' has a wrong offset!");
static_assert(offsetof(UWBP_ConvertItemMenuScrollListBlock_C, OnUnhoveredAnyContent) == 0x000430, "Member 'UWBP_ConvertItemMenuScrollListBlock_C::OnUnhoveredAnyContent' has a wrong offset!");

}

