#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Ingame_InteractDurability

#include "Basic.hpp"

#include "Pal_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Ingame_InteractDurability.WBP_Ingame_InteractDurability_C.ExecuteUbergraph_WBP_Ingame_InteractDurability
// 0x0100 (0x0100 - 0x0000)
struct WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C0[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalHUDDispatchParameterBase*           CallFunc_GetParam_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APalMapObject* Self, EPalHUDDisplayType DisplayType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalMapObjectHPWorldHUDParameter*       K2Node_DynamicCast_AsPal_Map_Object_HPWorld_HUDParameter; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C1[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalMapObject*                          K2Node_CustomEvent_MapObject;                      // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPalHUDDisplayType                            K2Node_CustomEvent_DisplayType;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C2[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalMapObjectModel*                     CallFunc_GetModel_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C3[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalMapObjectModel*                     K2Node_CustomEvent_Model;                          // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalMapObjectStatusValue               CallFunc_GetHP_ReturnValue;                        // 0x0068(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0078(0x0018)()
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C4[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalGameSetting*                        CallFunc_GetGameSetting_ReturnValue;               // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C5[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x00B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C6[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x00D0(0x0018)()
	TDelegate<void(class UPalMapObjectModel* Model)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability) == 0x000008, "Wrong alignment on WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability");
static_assert(sizeof(WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability) == 0x000100, "Wrong size on WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability, EntryPoint) == 0x000000, "Member 'WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability, Temp_bool_Variable) == 0x000005, "Member 'WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability, Temp_object_Variable) == 0x000008, "Member 'WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability, Temp_object_Variable_1) == 0x000010, "Member 'WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability, CallFunc_GetParam_ReturnValue) == 0x000018, "Member 'WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability::CallFunc_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability, K2Node_DynamicCast_AsPal_Map_Object_HPWorld_HUDParameter) == 0x000030, "Member 'WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability::K2Node_DynamicCast_AsPal_Map_Object_HPWorld_HUDParameter' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability, K2Node_CustomEvent_MapObject) == 0x000040, "Member 'WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability::K2Node_CustomEvent_MapObject' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability, K2Node_CustomEvent_DisplayType) == 0x000048, "Member 'WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability::K2Node_CustomEvent_DisplayType' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability, K2Node_SwitchEnum_CmpSuccess) == 0x000049, "Member 'WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability, CallFunc_GetModel_ReturnValue) == 0x000050, "Member 'WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability::CallFunc_GetModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability, K2Node_CustomEvent_Model) == 0x000060, "Member 'WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability::K2Node_CustomEvent_Model' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability, CallFunc_GetHP_ReturnValue) == 0x000068, "Member 'WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability::CallFunc_GetHP_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000070, "Member 'WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability, CallFunc_Conv_IntToText_ReturnValue) == 0x000078, "Member 'WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000090, "Member 'WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability, CallFunc_GetGameSetting_ReturnValue) == 0x000098, "Member 'WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability::CallFunc_GetGameSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x0000A0, "Member 'WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000A8, "Member 'WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability, CallFunc_SelectColor_ReturnValue) == 0x0000B4, "Member 'WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability, K2Node_Select_Default) == 0x0000C8, "Member 'WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability, CallFunc_Conv_IntToText_ReturnValue_1) == 0x0000D0, "Member 'WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000E8, "Member 'WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x0000F8, "Member 'WBP_Ingame_InteractDurability_C_ExecuteUbergraph_WBP_Ingame_InteractDurability::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function WBP_Ingame_InteractDurability.WBP_Ingame_InteractDurability_C.ShowHP
// 0x0010 (0x0010 - 0x0000)
struct WBP_Ingame_InteractDurability_C_ShowHP final
{
public:
	class APalMapObject*                          MapObject;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPalHUDDisplayType                            DisplayType;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Ingame_InteractDurability_C_ShowHP) == 0x000008, "Wrong alignment on WBP_Ingame_InteractDurability_C_ShowHP");
static_assert(sizeof(WBP_Ingame_InteractDurability_C_ShowHP) == 0x000010, "Wrong size on WBP_Ingame_InteractDurability_C_ShowHP");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_ShowHP, MapObject) == 0x000000, "Member 'WBP_Ingame_InteractDurability_C_ShowHP::MapObject' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_ShowHP, DisplayType) == 0x000008, "Member 'WBP_Ingame_InteractDurability_C_ShowHP::DisplayType' has a wrong offset!");

// Function WBP_Ingame_InteractDurability.WBP_Ingame_InteractDurability_C.UpdateHP
// 0x0008 (0x0008 - 0x0000)
struct WBP_Ingame_InteractDurability_C_UpdateHP final
{
public:
	class UPalMapObjectModel*                     Param_Model;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Ingame_InteractDurability_C_UpdateHP) == 0x000008, "Wrong alignment on WBP_Ingame_InteractDurability_C_UpdateHP");
static_assert(sizeof(WBP_Ingame_InteractDurability_C_UpdateHP) == 0x000008, "Wrong size on WBP_Ingame_InteractDurability_C_UpdateHP");
static_assert(offsetof(WBP_Ingame_InteractDurability_C_UpdateHP, Param_Model) == 0x000000, "Member 'WBP_Ingame_InteractDurability_C_UpdateHP::Param_Model' has a wrong offset!");

}

