#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Buildup_Pal_Item

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Buildup_Pal_Item.WBP_Buildup_Pal_Item_C.ExecuteUbergraph_WBP_Buildup_Pal_Item
// 0x0048 (0x0048 - 0x0000)
struct WBP_Buildup_Pal_Item_C_ExecuteUbergraph_WBP_Buildup_Pal_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_IconIndex;                      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Num;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0018)()
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Buildup_Pal_Item_C_ExecuteUbergraph_WBP_Buildup_Pal_Item) == 0x000008, "Wrong alignment on WBP_Buildup_Pal_Item_C_ExecuteUbergraph_WBP_Buildup_Pal_Item");
static_assert(sizeof(WBP_Buildup_Pal_Item_C_ExecuteUbergraph_WBP_Buildup_Pal_Item) == 0x000048, "Wrong size on WBP_Buildup_Pal_Item_C_ExecuteUbergraph_WBP_Buildup_Pal_Item");
static_assert(offsetof(WBP_Buildup_Pal_Item_C_ExecuteUbergraph_WBP_Buildup_Pal_Item, EntryPoint) == 0x000000, "Member 'WBP_Buildup_Pal_Item_C_ExecuteUbergraph_WBP_Buildup_Pal_Item::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Item_C_ExecuteUbergraph_WBP_Buildup_Pal_Item, Temp_int_Variable) == 0x000004, "Member 'WBP_Buildup_Pal_Item_C_ExecuteUbergraph_WBP_Buildup_Pal_Item::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Item_C_ExecuteUbergraph_WBP_Buildup_Pal_Item, Temp_object_Variable) == 0x000008, "Member 'WBP_Buildup_Pal_Item_C_ExecuteUbergraph_WBP_Buildup_Pal_Item::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Item_C_ExecuteUbergraph_WBP_Buildup_Pal_Item, Temp_object_Variable_1) == 0x000010, "Member 'WBP_Buildup_Pal_Item_C_ExecuteUbergraph_WBP_Buildup_Pal_Item::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Item_C_ExecuteUbergraph_WBP_Buildup_Pal_Item, Temp_object_Variable_2) == 0x000018, "Member 'WBP_Buildup_Pal_Item_C_ExecuteUbergraph_WBP_Buildup_Pal_Item::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Item_C_ExecuteUbergraph_WBP_Buildup_Pal_Item, K2Node_CustomEvent_IconIndex) == 0x000020, "Member 'WBP_Buildup_Pal_Item_C_ExecuteUbergraph_WBP_Buildup_Pal_Item::K2Node_CustomEvent_IconIndex' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Item_C_ExecuteUbergraph_WBP_Buildup_Pal_Item, K2Node_CustomEvent_Num) == 0x000024, "Member 'WBP_Buildup_Pal_Item_C_ExecuteUbergraph_WBP_Buildup_Pal_Item::K2Node_CustomEvent_Num' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Item_C_ExecuteUbergraph_WBP_Buildup_Pal_Item, CallFunc_Conv_IntToText_ReturnValue) == 0x000028, "Member 'WBP_Buildup_Pal_Item_C_ExecuteUbergraph_WBP_Buildup_Pal_Item::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buildup_Pal_Item_C_ExecuteUbergraph_WBP_Buildup_Pal_Item, K2Node_Select_Default) == 0x000040, "Member 'WBP_Buildup_Pal_Item_C_ExecuteUbergraph_WBP_Buildup_Pal_Item::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Buildup_Pal_Item.WBP_Buildup_Pal_Item_C.SetIcon
// 0x0004 (0x0004 - 0x0000)
struct WBP_Buildup_Pal_Item_C_SetIcon final
{
public:
	int32                                         IconIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Buildup_Pal_Item_C_SetIcon) == 0x000004, "Wrong alignment on WBP_Buildup_Pal_Item_C_SetIcon");
static_assert(sizeof(WBP_Buildup_Pal_Item_C_SetIcon) == 0x000004, "Wrong size on WBP_Buildup_Pal_Item_C_SetIcon");
static_assert(offsetof(WBP_Buildup_Pal_Item_C_SetIcon, IconIndex) == 0x000000, "Member 'WBP_Buildup_Pal_Item_C_SetIcon::IconIndex' has a wrong offset!");

// Function WBP_Buildup_Pal_Item.WBP_Buildup_Pal_Item_C.SetNum
// 0x0004 (0x0004 - 0x0000)
struct WBP_Buildup_Pal_Item_C_SetNum final
{
public:
	int32                                         Num;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Buildup_Pal_Item_C_SetNum) == 0x000004, "Wrong alignment on WBP_Buildup_Pal_Item_C_SetNum");
static_assert(sizeof(WBP_Buildup_Pal_Item_C_SetNum) == 0x000004, "Wrong size on WBP_Buildup_Pal_Item_C_SetNum");
static_assert(offsetof(WBP_Buildup_Pal_Item_C_SetNum, Num) == 0x000000, "Member 'WBP_Buildup_Pal_Item_C_SetNum::Num' has a wrong offset!");

}

