#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IngameMenu_Monitoring_WorkButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_IngameMenu_Monitoring_WorkButton.WBP_IngameMenu_Monitoring_WorkButton_C.ActiveSelect
// 0x0001 (0x0001 - 0x0000)
struct WBP_IngameMenu_Monitoring_WorkButton_C_ActiveSelect final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_Monitoring_WorkButton_C_ActiveSelect) == 0x000001, "Wrong alignment on WBP_IngameMenu_Monitoring_WorkButton_C_ActiveSelect");
static_assert(sizeof(WBP_IngameMenu_Monitoring_WorkButton_C_ActiveSelect) == 0x000001, "Wrong size on WBP_IngameMenu_Monitoring_WorkButton_C_ActiveSelect");
static_assert(offsetof(WBP_IngameMenu_Monitoring_WorkButton_C_ActiveSelect, Active) == 0x000000, "Member 'WBP_IngameMenu_Monitoring_WorkButton_C_ActiveSelect::Active' has a wrong offset!");

// Function WBP_IngameMenu_Monitoring_WorkButton.WBP_IngameMenu_Monitoring_WorkButton_C.BndEvt__WBP_IngameMenu_Monitoring_WorkButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_IngameMenu_Monitoring_WorkButton_C_BndEvt__WBP_IngameMenu_Monitoring_WorkButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_Monitoring_WorkButton_C_BndEvt__WBP_IngameMenu_Monitoring_WorkButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_IngameMenu_Monitoring_WorkButton_C_BndEvt__WBP_IngameMenu_Monitoring_WorkButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_IngameMenu_Monitoring_WorkButton_C_BndEvt__WBP_IngameMenu_Monitoring_WorkButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_IngameMenu_Monitoring_WorkButton_C_BndEvt__WBP_IngameMenu_Monitoring_WorkButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_IngameMenu_Monitoring_WorkButton_C_BndEvt__WBP_IngameMenu_Monitoring_WorkButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_IngameMenu_Monitoring_WorkButton_C_BndEvt__WBP_IngameMenu_Monitoring_WorkButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_IngameMenu_Monitoring_WorkButton.WBP_IngameMenu_Monitoring_WorkButton_C.BndEvt__WBP_IngameMenu_Monitoring_WorkButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_IngameMenu_Monitoring_WorkButton_C_BndEvt__WBP_IngameMenu_Monitoring_WorkButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_Monitoring_WorkButton_C_BndEvt__WBP_IngameMenu_Monitoring_WorkButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_IngameMenu_Monitoring_WorkButton_C_BndEvt__WBP_IngameMenu_Monitoring_WorkButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_IngameMenu_Monitoring_WorkButton_C_BndEvt__WBP_IngameMenu_Monitoring_WorkButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_IngameMenu_Monitoring_WorkButton_C_BndEvt__WBP_IngameMenu_Monitoring_WorkButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_IngameMenu_Monitoring_WorkButton_C_BndEvt__WBP_IngameMenu_Monitoring_WorkButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_IngameMenu_Monitoring_WorkButton_C_BndEvt__WBP_IngameMenu_Monitoring_WorkButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_IngameMenu_Monitoring_WorkButton.WBP_IngameMenu_Monitoring_WorkButton_C.BndEvt__WBP_IngameMenu_Monitoring_WorkButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_IngameMenu_Monitoring_WorkButton_C_BndEvt__WBP_IngameMenu_Monitoring_WorkButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_Monitoring_WorkButton_C_BndEvt__WBP_IngameMenu_Monitoring_WorkButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_IngameMenu_Monitoring_WorkButton_C_BndEvt__WBP_IngameMenu_Monitoring_WorkButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_IngameMenu_Monitoring_WorkButton_C_BndEvt__WBP_IngameMenu_Monitoring_WorkButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_IngameMenu_Monitoring_WorkButton_C_BndEvt__WBP_IngameMenu_Monitoring_WorkButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_IngameMenu_Monitoring_WorkButton_C_BndEvt__WBP_IngameMenu_Monitoring_WorkButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_IngameMenu_Monitoring_WorkButton_C_BndEvt__WBP_IngameMenu_Monitoring_WorkButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_IngameMenu_Monitoring_WorkButton.WBP_IngameMenu_Monitoring_WorkButton_C.ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton
// 0x0080 (0x0080 - 0x0000)
struct WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_3;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57B3[0x5];                                     // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    CallFunc_Array_Get_Item;                           // 0x0050(0x0010)(NoDestructor)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text;          // 0x0060(0x0018)()
	bool                                          K2Node_CustomEvent_Active;                         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton) == 0x000008, "Wrong alignment on WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton");
static_assert(sizeof(WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton) == 0x000080, "Wrong size on WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton");
static_assert(offsetof(WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton, EntryPoint) == 0x000000, "Member 'WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton, Temp_int_Variable) == 0x000004, "Member 'WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton, Temp_object_Variable) == 0x000008, "Member 'WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton, Temp_object_Variable_1) == 0x000010, "Member 'WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton, Temp_object_Variable_2) == 0x000018, "Member 'WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton, Temp_object_Variable_3) == 0x000020, "Member 'WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton, Temp_bool_Variable) == 0x000028, "Member 'WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton, Temp_byte_Variable) == 0x000029, "Member 'WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton, Temp_byte_Variable_1) == 0x00002A, "Member 'WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton, K2Node_ComponentBoundEvent_Button_2) == 0x000030, "Member 'WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton, K2Node_Select_Default) == 0x000038, "Member 'WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton, K2Node_ComponentBoundEvent_Button_1) == 0x000040, "Member 'WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton, K2Node_ComponentBoundEvent_Button) == 0x000048, "Member 'WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton, CallFunc_Array_Get_Item) == 0x000050, "Member 'WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton, CallFunc_GetLocalizedTextFromHandle_Text) == 0x000060, "Member 'WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton::CallFunc_GetLocalizedTextFromHandle_Text' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton, K2Node_CustomEvent_Active) == 0x000078, "Member 'WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton::K2Node_CustomEvent_Active' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton, K2Node_Select_Default_1) == 0x000079, "Member 'WBP_IngameMenu_Monitoring_WorkButton_C_ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkButton::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_IngameMenu_Monitoring_WorkButton.WBP_IngameMenu_Monitoring_WorkButton_C.OnChangeHardWorkLevel__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_IngameMenu_Monitoring_WorkButton_C_OnChangeHardWorkLevel__DelegateSignature final
{
public:
	int32                                         WorkLevel;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_Monitoring_WorkButton_C_OnChangeHardWorkLevel__DelegateSignature) == 0x000004, "Wrong alignment on WBP_IngameMenu_Monitoring_WorkButton_C_OnChangeHardWorkLevel__DelegateSignature");
static_assert(sizeof(WBP_IngameMenu_Monitoring_WorkButton_C_OnChangeHardWorkLevel__DelegateSignature) == 0x000004, "Wrong size on WBP_IngameMenu_Monitoring_WorkButton_C_OnChangeHardWorkLevel__DelegateSignature");
static_assert(offsetof(WBP_IngameMenu_Monitoring_WorkButton_C_OnChangeHardWorkLevel__DelegateSignature, WorkLevel) == 0x000000, "Member 'WBP_IngameMenu_Monitoring_WorkButton_C_OnChangeHardWorkLevel__DelegateSignature::WorkLevel' has a wrong offset!");

// Function WBP_IngameMenu_Monitoring_WorkButton.WBP_IngameMenu_Monitoring_WorkButton_C.OnHover__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_IngameMenu_Monitoring_WorkButton_C_OnHover__DelegateSignature final
{
public:
	int32                                         Param_WorkHardLevel;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_Monitoring_WorkButton_C_OnHover__DelegateSignature) == 0x000004, "Wrong alignment on WBP_IngameMenu_Monitoring_WorkButton_C_OnHover__DelegateSignature");
static_assert(sizeof(WBP_IngameMenu_Monitoring_WorkButton_C_OnHover__DelegateSignature) == 0x000004, "Wrong size on WBP_IngameMenu_Monitoring_WorkButton_C_OnHover__DelegateSignature");
static_assert(offsetof(WBP_IngameMenu_Monitoring_WorkButton_C_OnHover__DelegateSignature, Param_WorkHardLevel) == 0x000000, "Member 'WBP_IngameMenu_Monitoring_WorkButton_C_OnHover__DelegateSignature::Param_WorkHardLevel' has a wrong offset!");

}

