#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WorlSuitabilityPreference_PalList

#include "Basic.hpp"

#include "Pal_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_WorlSuitabilityPreference_PalList.WBP_WorlSuitabilityPreference_PalList_C.ArrangeHorizontalSlot_ForCheckBox
// 0x0020 (0x0020 - 0x0000)
struct WBP_WorlSuitabilityPreference_PalList_C_ArrangeHorizontalSlot_ForCheckBox final
{
public:
	class UHorizontalBoxSlot*                     Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x0018(0x0008)(NoDestructor)
};
static_assert(alignof(WBP_WorlSuitabilityPreference_PalList_C_ArrangeHorizontalSlot_ForCheckBox) == 0x000008, "Wrong alignment on WBP_WorlSuitabilityPreference_PalList_C_ArrangeHorizontalSlot_ForCheckBox");
static_assert(sizeof(WBP_WorlSuitabilityPreference_PalList_C_ArrangeHorizontalSlot_ForCheckBox) == 0x000020, "Wrong size on WBP_WorlSuitabilityPreference_PalList_C_ArrangeHorizontalSlot_ForCheckBox");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_ArrangeHorizontalSlot_ForCheckBox, Param_Slot) == 0x000000, "Member 'WBP_WorlSuitabilityPreference_PalList_C_ArrangeHorizontalSlot_ForCheckBox::Param_Slot' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_ArrangeHorizontalSlot_ForCheckBox, K2Node_MakeStruct_Margin) == 0x000008, "Member 'WBP_WorlSuitabilityPreference_PalList_C_ArrangeHorizontalSlot_ForCheckBox::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_ArrangeHorizontalSlot_ForCheckBox, K2Node_MakeStruct_SlateChildSize) == 0x000018, "Member 'WBP_WorlSuitabilityPreference_PalList_C_ArrangeHorizontalSlot_ForCheckBox::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");

// Function WBP_WorlSuitabilityPreference_PalList.WBP_WorlSuitabilityPreference_PalList_C.BindFromSlot
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot final
{
public:
	class UPalIndividualCharacterSlot*            TargetSlot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4214[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UPalIndividualCharacterSlot> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0010(0x0030)(UObjectWrapper, HasGetValueTypeHash)
	class UPalIndividualCharacterHandle*          CallFunc_GetHandle_ReturnValue;                    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4215[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterParameter*       CallFunc_TryGetIndividualParameter_ReturnValue;    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4216[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCharacterID_ReturnValue;               // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTribeIDNameFromCharacterID_outTribeIDName; // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4217[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalDatabaseCharacterParameter*         CallFunc_GetDatabaseCharacterParameter_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNocturnal_ReturnValue;                 // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4218[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetCharacterIconTexture_ReturnValue;      // 0x0080(0x0030)(UObjectWrapper, HasGetValueTypeHash)
	TDelegate<void(class UPalIndividualCharacterSlot* Slot, class UPalIndividualCharacterHandle* LastHandle)> K2Node_CreateDelegate_OutputDelegate;              // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot) == 0x000008, "Wrong alignment on WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot");
static_assert(sizeof(WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot) == 0x0000C8, "Wrong size on WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot, TargetSlot) == 0x000000, "Member 'WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot::TargetSlot' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot, Temp_bool_Variable) == 0x000008, "Member 'WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000010, "Member 'WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot, CallFunc_GetHandle_ReturnValue) == 0x000040, "Member 'WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot::CallFunc_GetHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot, CallFunc_TryGetIndividualParameter_ReturnValue) == 0x000050, "Member 'WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot::CallFunc_TryGetIndividualParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot, CallFunc_GetCharacterID_ReturnValue) == 0x00005C, "Member 'WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot::CallFunc_GetCharacterID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot, CallFunc_GetTribeIDNameFromCharacterID_outTribeIDName) == 0x000064, "Member 'WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot::CallFunc_GetTribeIDNameFromCharacterID_outTribeIDName' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot, CallFunc_IsValid_ReturnValue_2) == 0x00006C, "Member 'WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot, CallFunc_GetDatabaseCharacterParameter_ReturnValue) == 0x000070, "Member 'WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot::CallFunc_GetDatabaseCharacterParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot, CallFunc_GetNocturnal_ReturnValue) == 0x000078, "Member 'WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot::CallFunc_GetNocturnal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot, CallFunc_GetCharacterIconTexture_ReturnValue) == 0x000080, "Member 'WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot::CallFunc_GetCharacterIconTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot, K2Node_CreateDelegate_OutputDelegate) == 0x0000B0, "Member 'WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot, Temp_byte_Variable) == 0x0000C0, "Member 'WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot, Temp_byte_Variable_1) == 0x0000C1, "Member 'WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot, K2Node_Select_Default) == 0x0000C2, "Member 'WBP_WorlSuitabilityPreference_PalList_C_BindFromSlot::K2Node_Select_Default' has a wrong offset!");

// Function WBP_WorlSuitabilityPreference_PalList.WBP_WorlSuitabilityPreference_PalList_C.ExecuteUbergraph_WBP_WorlSuitabilityPreference_PalList
// 0x0080 (0x0080 - 0x0000)
struct WBP_WorlSuitabilityPreference_PalList_C_ExecuteUbergraph_WBP_WorlSuitabilityPreference_PalList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(double NowSanity, double NowMaxSanity)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPalWorkSuitabilityPreferenceInfo& Info)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& NewNickName)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4219[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_MainMenu_Pal_State_C*>      K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 NewLevel)>               K2Node_CreateDelegate_OutputDelegate_5;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorlSuitabilityPreference_PalList_C_ExecuteUbergraph_WBP_WorlSuitabilityPreference_PalList) == 0x000008, "Wrong alignment on WBP_WorlSuitabilityPreference_PalList_C_ExecuteUbergraph_WBP_WorlSuitabilityPreference_PalList");
static_assert(sizeof(WBP_WorlSuitabilityPreference_PalList_C_ExecuteUbergraph_WBP_WorlSuitabilityPreference_PalList) == 0x000080, "Wrong size on WBP_WorlSuitabilityPreference_PalList_C_ExecuteUbergraph_WBP_WorlSuitabilityPreference_PalList");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_ExecuteUbergraph_WBP_WorlSuitabilityPreference_PalList, EntryPoint) == 0x000000, "Member 'WBP_WorlSuitabilityPreference_PalList_C_ExecuteUbergraph_WBP_WorlSuitabilityPreference_PalList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_ExecuteUbergraph_WBP_WorlSuitabilityPreference_PalList, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_WorlSuitabilityPreference_PalList_C_ExecuteUbergraph_WBP_WorlSuitabilityPreference_PalList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_ExecuteUbergraph_WBP_WorlSuitabilityPreference_PalList, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_WorlSuitabilityPreference_PalList_C_ExecuteUbergraph_WBP_WorlSuitabilityPreference_PalList::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_ExecuteUbergraph_WBP_WorlSuitabilityPreference_PalList, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'WBP_WorlSuitabilityPreference_PalList_C_ExecuteUbergraph_WBP_WorlSuitabilityPreference_PalList::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_ExecuteUbergraph_WBP_WorlSuitabilityPreference_PalList, K2Node_CreateDelegate_OutputDelegate_3) == 0x000034, "Member 'WBP_WorlSuitabilityPreference_PalList_C_ExecuteUbergraph_WBP_WorlSuitabilityPreference_PalList::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_ExecuteUbergraph_WBP_WorlSuitabilityPreference_PalList, K2Node_MakeArray_Array) == 0x000048, "Member 'WBP_WorlSuitabilityPreference_PalList_C_ExecuteUbergraph_WBP_WorlSuitabilityPreference_PalList::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_ExecuteUbergraph_WBP_WorlSuitabilityPreference_PalList, K2Node_CreateDelegate_OutputDelegate_4) == 0x000058, "Member 'WBP_WorlSuitabilityPreference_PalList_C_ExecuteUbergraph_WBP_WorlSuitabilityPreference_PalList::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_ExecuteUbergraph_WBP_WorlSuitabilityPreference_PalList, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000068, "Member 'WBP_WorlSuitabilityPreference_PalList_C_ExecuteUbergraph_WBP_WorlSuitabilityPreference_PalList::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_ExecuteUbergraph_WBP_WorlSuitabilityPreference_PalList, K2Node_CreateDelegate_OutputDelegate_5) == 0x000070, "Member 'WBP_WorlSuitabilityPreference_PalList_C_ExecuteUbergraph_WBP_WorlSuitabilityPreference_PalList::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");

// Function WBP_WorlSuitabilityPreference_PalList.WBP_WorlSuitabilityPreference_PalList_C.GetFocusTargetByCheckBoxIndex
// 0x0040 (0x0040 - 0x0000)
struct WBP_WorlSuitabilityPreference_PalList_C_GetFocusTargetByCheckBoxIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                TargetWidget;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               K2Node_DynamicCast_AsSize_Box;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421B[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_WorkSuitabilityPreference_CheckBox_0_C* K2Node_DynamicCast_AsWBP_Work_Suitability_Preference_Check_Box_0; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorlSuitabilityPreference_PalList_C_GetFocusTargetByCheckBoxIndex) == 0x000008, "Wrong alignment on WBP_WorlSuitabilityPreference_PalList_C_GetFocusTargetByCheckBoxIndex");
static_assert(sizeof(WBP_WorlSuitabilityPreference_PalList_C_GetFocusTargetByCheckBoxIndex) == 0x000040, "Wrong size on WBP_WorlSuitabilityPreference_PalList_C_GetFocusTargetByCheckBoxIndex");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_GetFocusTargetByCheckBoxIndex, Param_Index) == 0x000000, "Member 'WBP_WorlSuitabilityPreference_PalList_C_GetFocusTargetByCheckBoxIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_GetFocusTargetByCheckBoxIndex, TargetWidget) == 0x000008, "Member 'WBP_WorlSuitabilityPreference_PalList_C_GetFocusTargetByCheckBoxIndex::TargetWidget' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_GetFocusTargetByCheckBoxIndex, CallFunc_GetChildAt_ReturnValue) == 0x000010, "Member 'WBP_WorlSuitabilityPreference_PalList_C_GetFocusTargetByCheckBoxIndex::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_GetFocusTargetByCheckBoxIndex, K2Node_DynamicCast_AsSize_Box) == 0x000018, "Member 'WBP_WorlSuitabilityPreference_PalList_C_GetFocusTargetByCheckBoxIndex::K2Node_DynamicCast_AsSize_Box' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_GetFocusTargetByCheckBoxIndex, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_WorlSuitabilityPreference_PalList_C_GetFocusTargetByCheckBoxIndex::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_GetFocusTargetByCheckBoxIndex, CallFunc_GetChildAt_ReturnValue_1) == 0x000028, "Member 'WBP_WorlSuitabilityPreference_PalList_C_GetFocusTargetByCheckBoxIndex::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_GetFocusTargetByCheckBoxIndex, K2Node_DynamicCast_AsWBP_Work_Suitability_Preference_Check_Box_0) == 0x000030, "Member 'WBP_WorlSuitabilityPreference_PalList_C_GetFocusTargetByCheckBoxIndex::K2Node_DynamicCast_AsWBP_Work_Suitability_Preference_Check_Box_0' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_GetFocusTargetByCheckBoxIndex, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'WBP_WorlSuitabilityPreference_PalList_C_GetFocusTargetByCheckBoxIndex::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function WBP_WorlSuitabilityPreference_PalList.WBP_WorlSuitabilityPreference_PalList_C.GetLastHoveredCheckBoxIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_WorlSuitabilityPreference_PalList_C_GetLastHoveredCheckBoxIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorlSuitabilityPreference_PalList_C_GetLastHoveredCheckBoxIndex) == 0x000004, "Wrong alignment on WBP_WorlSuitabilityPreference_PalList_C_GetLastHoveredCheckBoxIndex");
static_assert(sizeof(WBP_WorlSuitabilityPreference_PalList_C_GetLastHoveredCheckBoxIndex) == 0x000004, "Wrong size on WBP_WorlSuitabilityPreference_PalList_C_GetLastHoveredCheckBoxIndex");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_GetLastHoveredCheckBoxIndex, Param_Index) == 0x000000, "Member 'WBP_WorlSuitabilityPreference_PalList_C_GetLastHoveredCheckBoxIndex::Param_Index' has a wrong offset!");

// Function WBP_WorlSuitabilityPreference_PalList.WBP_WorlSuitabilityPreference_PalList_C.GetTopFocusTarget
// 0x0038 (0x0038 - 0x0000)
struct WBP_WorlSuitabilityPreference_PalList_C_GetTopFocusTarget final
{
public:
	class UWidget*                                Target;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               K2Node_DynamicCast_AsSize_Box;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421C[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_WorkSuitabilityPreference_CheckBox_0_C* K2Node_DynamicCast_AsWBP_Work_Suitability_Preference_Check_Box_0; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorlSuitabilityPreference_PalList_C_GetTopFocusTarget) == 0x000008, "Wrong alignment on WBP_WorlSuitabilityPreference_PalList_C_GetTopFocusTarget");
static_assert(sizeof(WBP_WorlSuitabilityPreference_PalList_C_GetTopFocusTarget) == 0x000038, "Wrong size on WBP_WorlSuitabilityPreference_PalList_C_GetTopFocusTarget");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_GetTopFocusTarget, Target) == 0x000000, "Member 'WBP_WorlSuitabilityPreference_PalList_C_GetTopFocusTarget::Target' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_GetTopFocusTarget, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'WBP_WorlSuitabilityPreference_PalList_C_GetTopFocusTarget::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_GetTopFocusTarget, K2Node_DynamicCast_AsSize_Box) == 0x000010, "Member 'WBP_WorlSuitabilityPreference_PalList_C_GetTopFocusTarget::K2Node_DynamicCast_AsSize_Box' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_GetTopFocusTarget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_WorlSuitabilityPreference_PalList_C_GetTopFocusTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_GetTopFocusTarget, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'WBP_WorlSuitabilityPreference_PalList_C_GetTopFocusTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_GetTopFocusTarget, CallFunc_GetChildAt_ReturnValue_1) == 0x000020, "Member 'WBP_WorlSuitabilityPreference_PalList_C_GetTopFocusTarget::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_GetTopFocusTarget, K2Node_DynamicCast_AsWBP_Work_Suitability_Preference_Check_Box_0) == 0x000028, "Member 'WBP_WorlSuitabilityPreference_PalList_C_GetTopFocusTarget::K2Node_DynamicCast_AsWBP_Work_Suitability_Preference_Check_Box_0' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_GetTopFocusTarget, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'WBP_WorlSuitabilityPreference_PalList_C_GetTopFocusTarget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function WBP_WorlSuitabilityPreference_PalList.WBP_WorlSuitabilityPreference_PalList_C.OnChangedBattleModeCheck__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_WorlSuitabilityPreference_PalList_C_OnChangedBattleModeCheck__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421D[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterSlot*            TargetSlot;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorlSuitabilityPreference_PalList_C_OnChangedBattleModeCheck__DelegateSignature) == 0x000008, "Wrong alignment on WBP_WorlSuitabilityPreference_PalList_C_OnChangedBattleModeCheck__DelegateSignature");
static_assert(sizeof(WBP_WorlSuitabilityPreference_PalList_C_OnChangedBattleModeCheck__DelegateSignature) == 0x000010, "Wrong size on WBP_WorlSuitabilityPreference_PalList_C_OnChangedBattleModeCheck__DelegateSignature");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnChangedBattleModeCheck__DelegateSignature, IsChecked) == 0x000000, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnChangedBattleModeCheck__DelegateSignature::IsChecked' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnChangedBattleModeCheck__DelegateSignature, TargetSlot) == 0x000008, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnChangedBattleModeCheck__DelegateSignature::TargetSlot' has a wrong offset!");

// Function WBP_WorlSuitabilityPreference_PalList.WBP_WorlSuitabilityPreference_PalList_C.OnChangedBattleModeCheckState_Internal
// 0x0020 (0x0020 - 0x0000)
struct WBP_WorlSuitabilityPreference_PalList_C_OnChangedBattleModeCheckState_Internal final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalWorkSuitability                           Suitability;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421E[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterSlot*            K2Node_DynamicCast_AsPal_Individual_Character_Slot; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorlSuitabilityPreference_PalList_C_OnChangedBattleModeCheckState_Internal) == 0x000008, "Wrong alignment on WBP_WorlSuitabilityPreference_PalList_C_OnChangedBattleModeCheckState_Internal");
static_assert(sizeof(WBP_WorlSuitabilityPreference_PalList_C_OnChangedBattleModeCheckState_Internal) == 0x000020, "Wrong size on WBP_WorlSuitabilityPreference_PalList_C_OnChangedBattleModeCheckState_Internal");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnChangedBattleModeCheckState_Internal, IsChecked) == 0x000000, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnChangedBattleModeCheckState_Internal::IsChecked' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnChangedBattleModeCheckState_Internal, Suitability) == 0x000001, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnChangedBattleModeCheckState_Internal::Suitability' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnChangedBattleModeCheckState_Internal, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000008, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnChangedBattleModeCheckState_Internal::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnChangedBattleModeCheckState_Internal, K2Node_DynamicCast_AsPal_Individual_Character_Slot) == 0x000010, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnChangedBattleModeCheckState_Internal::K2Node_DynamicCast_AsPal_Individual_Character_Slot' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnChangedBattleModeCheckState_Internal, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnChangedBattleModeCheckState_Internal::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_WorlSuitabilityPreference_PalList.WBP_WorlSuitabilityPreference_PalList_C.OnChangedSuitabilityCheck__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_WorlSuitabilityPreference_PalList_C_OnChangedSuitabilityCheck__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalWorkSuitability                           Suitability;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421F[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterSlot*            TargetSlot;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorlSuitabilityPreference_PalList_C_OnChangedSuitabilityCheck__DelegateSignature) == 0x000008, "Wrong alignment on WBP_WorlSuitabilityPreference_PalList_C_OnChangedSuitabilityCheck__DelegateSignature");
static_assert(sizeof(WBP_WorlSuitabilityPreference_PalList_C_OnChangedSuitabilityCheck__DelegateSignature) == 0x000010, "Wrong size on WBP_WorlSuitabilityPreference_PalList_C_OnChangedSuitabilityCheck__DelegateSignature");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnChangedSuitabilityCheck__DelegateSignature, IsChecked) == 0x000000, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnChangedSuitabilityCheck__DelegateSignature::IsChecked' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnChangedSuitabilityCheck__DelegateSignature, Suitability) == 0x000001, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnChangedSuitabilityCheck__DelegateSignature::Suitability' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnChangedSuitabilityCheck__DelegateSignature, TargetSlot) == 0x000008, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnChangedSuitabilityCheck__DelegateSignature::TargetSlot' has a wrong offset!");

// Function WBP_WorlSuitabilityPreference_PalList.WBP_WorlSuitabilityPreference_PalList_C.OnChangedSuitabilityCheckState_Internal
// 0x0020 (0x0020 - 0x0000)
struct WBP_WorlSuitabilityPreference_PalList_C_OnChangedSuitabilityCheckState_Internal final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalWorkSuitability                           Suitability;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4220[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterSlot*            K2Node_DynamicCast_AsPal_Individual_Character_Slot; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorlSuitabilityPreference_PalList_C_OnChangedSuitabilityCheckState_Internal) == 0x000008, "Wrong alignment on WBP_WorlSuitabilityPreference_PalList_C_OnChangedSuitabilityCheckState_Internal");
static_assert(sizeof(WBP_WorlSuitabilityPreference_PalList_C_OnChangedSuitabilityCheckState_Internal) == 0x000020, "Wrong size on WBP_WorlSuitabilityPreference_PalList_C_OnChangedSuitabilityCheckState_Internal");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnChangedSuitabilityCheckState_Internal, IsChecked) == 0x000000, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnChangedSuitabilityCheckState_Internal::IsChecked' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnChangedSuitabilityCheckState_Internal, Suitability) == 0x000001, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnChangedSuitabilityCheckState_Internal::Suitability' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnChangedSuitabilityCheckState_Internal, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000008, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnChangedSuitabilityCheckState_Internal::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnChangedSuitabilityCheckState_Internal, K2Node_DynamicCast_AsPal_Individual_Character_Slot) == 0x000010, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnChangedSuitabilityCheckState_Internal::K2Node_DynamicCast_AsPal_Individual_Character_Slot' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnChangedSuitabilityCheckState_Internal, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnChangedSuitabilityCheckState_Internal::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_WorlSuitabilityPreference_PalList.WBP_WorlSuitabilityPreference_PalList_C.OnHoveredCheckBox__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_WorlSuitabilityPreference_PalList_C_OnHoveredCheckBox__DelegateSignature final
{
public:
	class UWBP_WorlSuitabilityPreference_PalList_C* SelfWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorlSuitabilityPreference_PalList_C_OnHoveredCheckBox__DelegateSignature) == 0x000008, "Wrong alignment on WBP_WorlSuitabilityPreference_PalList_C_OnHoveredCheckBox__DelegateSignature");
static_assert(sizeof(WBP_WorlSuitabilityPreference_PalList_C_OnHoveredCheckBox__DelegateSignature) == 0x000008, "Wrong size on WBP_WorlSuitabilityPreference_PalList_C_OnHoveredCheckBox__DelegateSignature");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnHoveredCheckBox__DelegateSignature, SelfWidget) == 0x000000, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnHoveredCheckBox__DelegateSignature::SelfWidget' has a wrong offset!");

// Function WBP_WorlSuitabilityPreference_PalList.WBP_WorlSuitabilityPreference_PalList_C.OnHoveredCheckBox_Internal
// 0x0018 (0x0018 - 0x0000)
struct WBP_WorlSuitabilityPreference_PalList_C_OnHoveredCheckBox_Internal final
{
public:
	class UWBP_WorkSuitabilityPreference_CheckBox_0_C* CheckBox;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildIndex_ReturnValue;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorlSuitabilityPreference_PalList_C_OnHoveredCheckBox_Internal) == 0x000008, "Wrong alignment on WBP_WorlSuitabilityPreference_PalList_C_OnHoveredCheckBox_Internal");
static_assert(sizeof(WBP_WorlSuitabilityPreference_PalList_C_OnHoveredCheckBox_Internal) == 0x000018, "Wrong size on WBP_WorlSuitabilityPreference_PalList_C_OnHoveredCheckBox_Internal");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnHoveredCheckBox_Internal, CheckBox) == 0x000000, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnHoveredCheckBox_Internal::CheckBox' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnHoveredCheckBox_Internal, CallFunc_GetParent_ReturnValue) == 0x000008, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnHoveredCheckBox_Internal::CallFunc_GetParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnHoveredCheckBox_Internal, CallFunc_GetChildIndex_ReturnValue) == 0x000010, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnHoveredCheckBox_Internal::CallFunc_GetChildIndex_ReturnValue' has a wrong offset!");

// Function WBP_WorlSuitabilityPreference_PalList.WBP_WorlSuitabilityPreference_PalList_C.OnUpdateCondition_Binded
// 0x0020 (0x0020 - 0x0000)
struct WBP_WorlSuitabilityPreference_PalList_C_OnUpdateCondition_Binded final
{
public:
	class UPalIndividualCharacterHandle*          CallFunc_GetBindedHandle_targetHandle;             // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4221[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EPalUIConditionType>                   CallFunc_GetUIDisplayPalCondition_outArray;        // 0x0010(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateCondition_Binded) == 0x000008, "Wrong alignment on WBP_WorlSuitabilityPreference_PalList_C_OnUpdateCondition_Binded");
static_assert(sizeof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateCondition_Binded) == 0x000020, "Wrong size on WBP_WorlSuitabilityPreference_PalList_C_OnUpdateCondition_Binded");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateCondition_Binded, CallFunc_GetBindedHandle_targetHandle) == 0x000000, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnUpdateCondition_Binded::CallFunc_GetBindedHandle_targetHandle' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateCondition_Binded, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnUpdateCondition_Binded::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateCondition_Binded, CallFunc_GetUIDisplayPalCondition_outArray) == 0x000010, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnUpdateCondition_Binded::CallFunc_GetUIDisplayPalCondition_outArray' has a wrong offset!");

// Function WBP_WorlSuitabilityPreference_PalList.WBP_WorlSuitabilityPreference_PalList_C.OnUpdateLevel_binded
// 0x0020 (0x0020 - 0x0000)
struct WBP_WorlSuitabilityPreference_PalList_C_OnUpdateLevel_binded final
{
public:
	int32                                         NewLevel;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4222[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateLevel_binded) == 0x000008, "Wrong alignment on WBP_WorlSuitabilityPreference_PalList_C_OnUpdateLevel_binded");
static_assert(sizeof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateLevel_binded) == 0x000020, "Wrong size on WBP_WorlSuitabilityPreference_PalList_C_OnUpdateLevel_binded");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateLevel_binded, NewLevel) == 0x000000, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnUpdateLevel_binded::NewLevel' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateLevel_binded, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnUpdateLevel_binded::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_WorlSuitabilityPreference_PalList.WBP_WorlSuitabilityPreference_PalList_C.OnUpdateNickName_Binded
// 0x0028 (0x0028 - 0x0000)
struct WBP_WorlSuitabilityPreference_PalList_C_OnUpdateNickName_Binded final
{
public:
	class FString                                 NewNickName;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
};
static_assert(alignof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateNickName_Binded) == 0x000008, "Wrong alignment on WBP_WorlSuitabilityPreference_PalList_C_OnUpdateNickName_Binded");
static_assert(sizeof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateNickName_Binded) == 0x000028, "Wrong size on WBP_WorlSuitabilityPreference_PalList_C_OnUpdateNickName_Binded");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateNickName_Binded, NewNickName) == 0x000000, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnUpdateNickName_Binded::NewNickName' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateNickName_Binded, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnUpdateNickName_Binded::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_WorlSuitabilityPreference_PalList.WBP_WorlSuitabilityPreference_PalList_C.OnUpdateSanity_Binded
// 0x0010 (0x0010 - 0x0000)
struct WBP_WorlSuitabilityPreference_PalList_C_OnUpdateSanity_Binded final
{
public:
	double                                        NowSanity;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NowMaxSanity;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateSanity_Binded) == 0x000008, "Wrong alignment on WBP_WorlSuitabilityPreference_PalList_C_OnUpdateSanity_Binded");
static_assert(sizeof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateSanity_Binded) == 0x000010, "Wrong size on WBP_WorlSuitabilityPreference_PalList_C_OnUpdateSanity_Binded");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateSanity_Binded, NowSanity) == 0x000000, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnUpdateSanity_Binded::NowSanity' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateSanity_Binded, NowMaxSanity) == 0x000008, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnUpdateSanity_Binded::NowMaxSanity' has a wrong offset!");

// Function WBP_WorlSuitabilityPreference_PalList.WBP_WorlSuitabilityPreference_PalList_C.OnUpdateSlotHandle
// 0x0010 (0x0010 - 0x0000)
struct WBP_WorlSuitabilityPreference_PalList_C_OnUpdateSlotHandle final
{
public:
	class UPalIndividualCharacterSlot*            Param_Slot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterHandle*          LastHandle;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateSlotHandle) == 0x000008, "Wrong alignment on WBP_WorlSuitabilityPreference_PalList_C_OnUpdateSlotHandle");
static_assert(sizeof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateSlotHandle) == 0x000010, "Wrong size on WBP_WorlSuitabilityPreference_PalList_C_OnUpdateSlotHandle");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateSlotHandle, Param_Slot) == 0x000000, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnUpdateSlotHandle::Param_Slot' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateSlotHandle, LastHandle) == 0x000008, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnUpdateSlotHandle::LastHandle' has a wrong offset!");

// Function WBP_WorlSuitabilityPreference_PalList.WBP_WorlSuitabilityPreference_PalList_C.OnUpdateWorkSuitabilityOption_Binded
// 0x0050 (0x0050 - 0x0000)
struct WBP_WorlSuitabilityPreference_PalList_C_OnUpdateWorkSuitabilityOption_Binded final
{
public:
	struct FPalWorkSuitabilityPreferenceInfo      Info;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4223[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EPalWorkSuitability>                   CallFunc_Map_Keys_Keys;                            // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalWorkSuitability                           CallFunc_Array_Get_Item;                           // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4224[0x2];                                     // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_WorkSuitabilityPreference_CheckBox_0_C* CallFunc_Map_Find_Value;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateWorkSuitabilityOption_Binded) == 0x000008, "Wrong alignment on WBP_WorlSuitabilityPreference_PalList_C_OnUpdateWorkSuitabilityOption_Binded");
static_assert(sizeof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateWorkSuitabilityOption_Binded) == 0x000050, "Wrong size on WBP_WorlSuitabilityPreference_PalList_C_OnUpdateWorkSuitabilityOption_Binded");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateWorkSuitabilityOption_Binded, Info) == 0x000000, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnUpdateWorkSuitabilityOption_Binded::Info' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateWorkSuitabilityOption_Binded, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnUpdateWorkSuitabilityOption_Binded::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateWorkSuitabilityOption_Binded, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnUpdateWorkSuitabilityOption_Binded::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateWorkSuitabilityOption_Binded, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnUpdateWorkSuitabilityOption_Binded::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateWorkSuitabilityOption_Binded, CallFunc_Map_Keys_Keys) == 0x000028, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnUpdateWorkSuitabilityOption_Binded::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateWorkSuitabilityOption_Binded, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnUpdateWorkSuitabilityOption_Binded::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateWorkSuitabilityOption_Binded, CallFunc_Array_Get_Item) == 0x00003C, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnUpdateWorkSuitabilityOption_Binded::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateWorkSuitabilityOption_Binded, CallFunc_Less_IntInt_ReturnValue) == 0x00003D, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnUpdateWorkSuitabilityOption_Binded::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateWorkSuitabilityOption_Binded, CallFunc_Map_Find_Value) == 0x000040, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnUpdateWorkSuitabilityOption_Binded::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateWorkSuitabilityOption_Binded, CallFunc_Map_Find_ReturnValue) == 0x000048, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnUpdateWorkSuitabilityOption_Binded::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateWorkSuitabilityOption_Binded, CallFunc_Array_Contains_ReturnValue) == 0x000049, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnUpdateWorkSuitabilityOption_Binded::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_OnUpdateWorkSuitabilityOption_Binded, CallFunc_Not_PreBool_ReturnValue) == 0x00004A, "Member 'WBP_WorlSuitabilityPreference_PalList_C_OnUpdateWorkSuitabilityOption_Binded::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_WorlSuitabilityPreference_PalList.WBP_WorlSuitabilityPreference_PalList_C.Set Work Suitability
// 0x0090 (0x0090 - 0x0000)
struct WBP_WorlSuitabilityPreference_PalList_C_Set_Work_Suitability final
{
public:
	TMap<EPalWorkSuitability, int32>              WorkSuitabilities;                                 // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4225[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EPalWorkSuitability>                   CallFunc_Map_Keys_Keys;                            // 0x0060(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalWorkSuitability                           CallFunc_Array_Get_Item;                           // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4226[0x2];                                     // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Find_Value;                           // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4227[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_WorkSuitabilityPreference_CheckBox_0_C* CallFunc_Map_Find_Value_1;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorlSuitabilityPreference_PalList_C_Set_Work_Suitability) == 0x000008, "Wrong alignment on WBP_WorlSuitabilityPreference_PalList_C_Set_Work_Suitability");
static_assert(sizeof(WBP_WorlSuitabilityPreference_PalList_C_Set_Work_Suitability) == 0x000090, "Wrong size on WBP_WorlSuitabilityPreference_PalList_C_Set_Work_Suitability");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_Set_Work_Suitability, WorkSuitabilities) == 0x000000, "Member 'WBP_WorlSuitabilityPreference_PalList_C_Set_Work_Suitability::WorkSuitabilities' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_Set_Work_Suitability, Temp_int_Array_Index_Variable) == 0x000050, "Member 'WBP_WorlSuitabilityPreference_PalList_C_Set_Work_Suitability::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_Set_Work_Suitability, Temp_int_Loop_Counter_Variable) == 0x000054, "Member 'WBP_WorlSuitabilityPreference_PalList_C_Set_Work_Suitability::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_Set_Work_Suitability, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'WBP_WorlSuitabilityPreference_PalList_C_Set_Work_Suitability::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_Set_Work_Suitability, CallFunc_Map_Keys_Keys) == 0x000060, "Member 'WBP_WorlSuitabilityPreference_PalList_C_Set_Work_Suitability::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_Set_Work_Suitability, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'WBP_WorlSuitabilityPreference_PalList_C_Set_Work_Suitability::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorlSuitabilityPreference_PalList_C_Set_Work_Suitability, CallFunc_Array_Get_Item) == 0x000074, "Member 'WBP_WorlSuitabilityPreference_PalList_C_Set_Work_Suitability::CallFunc_Array_Get_Item' has a wrong offset!");
