#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WorkerRadialMenu_Overlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Pal_structs.hpp"
#include "Pal_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_WorkerRadialMenu_Overlay.WBP_WorkerRadialMenu_Overlay_C
// 0x0028 (0x0458 - 0x0430)
class UWBP_WorkerRadialMenu_Overlay_C final : public UPalUserWidgetOverlayUI
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_WorkerRadialMenu_C*                WBP_WorkerRadialMenu;                              // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   DisableCrouchFlagName;                             // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPalDataTableRowName_UIInputAction     CloseShortcutINputAction;                          // 0x0448(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FPalDataTableRowName_UIInputAction     DecideMenuAction;                                  // 0x0450(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CancelEvent();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_WorkerRadialMenu_Overlay(int32 EntryPoint);
	void OnAnyUIPushed(const struct FGuid& PushedWidgetID);
	void OnClosed();
	void OnInitialized();
	void OnSelectedEvent(EPalWorkerRadialMenuResult Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_WorkerRadialMenu_Overlay_C">();
	}
	static class UWBP_WorkerRadialMenu_Overlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_WorkerRadialMenu_Overlay_C>();
	}
};
static_assert(alignof(UWBP_WorkerRadialMenu_Overlay_C) == 0x000008, "Wrong alignment on UWBP_WorkerRadialMenu_Overlay_C");
static_assert(sizeof(UWBP_WorkerRadialMenu_Overlay_C) == 0x000458, "Wrong size on UWBP_WorkerRadialMenu_Overlay_C");
static_assert(offsetof(UWBP_WorkerRadialMenu_Overlay_C, UberGraphFrame) == 0x000430, "Member 'UWBP_WorkerRadialMenu_Overlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_WorkerRadialMenu_Overlay_C, WBP_WorkerRadialMenu) == 0x000438, "Member 'UWBP_WorkerRadialMenu_Overlay_C::WBP_WorkerRadialMenu' has a wrong offset!");
static_assert(offsetof(UWBP_WorkerRadialMenu_Overlay_C, DisableCrouchFlagName) == 0x000440, "Member 'UWBP_WorkerRadialMenu_Overlay_C::DisableCrouchFlagName' has a wrong offset!");
static_assert(offsetof(UWBP_WorkerRadialMenu_Overlay_C, CloseShortcutINputAction) == 0x000448, "Member 'UWBP_WorkerRadialMenu_Overlay_C::CloseShortcutINputAction' has a wrong offset!");
static_assert(offsetof(UWBP_WorkerRadialMenu_Overlay_C, DecideMenuAction) == 0x000450, "Member 'UWBP_WorkerRadialMenu_Overlay_C::DecideMenuAction' has a wrong offset!");

}

