#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IngameMenu_Monitoring_WorkInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_IngameMenu_Monitoring_WorkInfo.WBP_IngameMenu_Monitoring_WorkInfo_C
// 0x0048 (0x02C0 - 0x0278)
class UWBP_IngameMenu_Monitoring_WorkInfo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anm_TextColor;                                     // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_Category;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_Category_1;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         EffectID;                                          // 0x0298(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37DD[0x4];                                     // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDataTableRowHandle>            EffectMsgIDs;                                      // 0x02A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FDataTableRowHandle>            EffectLevelMsgIDs;                                 // 0x02B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ChangeLevelText(int32 NewLevel);
	void Construct();
	void ExecuteUbergraph_WBP_IngameMenu_Monitoring_WorkInfo(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_IngameMenu_Monitoring_WorkInfo_C">();
	}
	static class UWBP_IngameMenu_Monitoring_WorkInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_IngameMenu_Monitoring_WorkInfo_C>();
	}
};
static_assert(alignof(UWBP_IngameMenu_Monitoring_WorkInfo_C) == 0x000008, "Wrong alignment on UWBP_IngameMenu_Monitoring_WorkInfo_C");
static_assert(sizeof(UWBP_IngameMenu_Monitoring_WorkInfo_C) == 0x0002C0, "Wrong size on UWBP_IngameMenu_Monitoring_WorkInfo_C");
static_assert(offsetof(UWBP_IngameMenu_Monitoring_WorkInfo_C, UberGraphFrame) == 0x000278, "Member 'UWBP_IngameMenu_Monitoring_WorkInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Monitoring_WorkInfo_C, Anm_TextColor) == 0x000280, "Member 'UWBP_IngameMenu_Monitoring_WorkInfo_C::Anm_TextColor' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Monitoring_WorkInfo_C, Text_Category) == 0x000288, "Member 'UWBP_IngameMenu_Monitoring_WorkInfo_C::Text_Category' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Monitoring_WorkInfo_C, Text_Category_1) == 0x000290, "Member 'UWBP_IngameMenu_Monitoring_WorkInfo_C::Text_Category_1' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Monitoring_WorkInfo_C, EffectID) == 0x000298, "Member 'UWBP_IngameMenu_Monitoring_WorkInfo_C::EffectID' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Monitoring_WorkInfo_C, EffectMsgIDs) == 0x0002A0, "Member 'UWBP_IngameMenu_Monitoring_WorkInfo_C::EffectMsgIDs' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Monitoring_WorkInfo_C, EffectLevelMsgIDs) == 0x0002B0, "Member 'UWBP_IngameMenu_Monitoring_WorkInfo_C::EffectLevelMsgIDs' has a wrong offset!");

}

