#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Paldex_tab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Paldex_tab.WBP_Paldex_tab_C
// 0x0048 (0x02C0 - 0x0278)
class UWBP_Paldex_tab_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anm_Normal;                                        // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anm_Focus;                                         // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_Title;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalCommonButton_C*                 WBP_PalCommonButton;                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    MsgId;                                             // 0x02A0(0x0010)(Edit, BlueprintVisible, NoDestructor)
	FMulticastInlineDelegateProperty_             OnClicked;                                         // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void AnmEvent_Focus();
	void AnmEvent_Unfocus();
	void BndEvt__WBP_Paldex_tab_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WBP_Paldex_tab(int32 EntryPoint);
	void OnClicked__DelegateSignature();
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Paldex_tab_C">();
	}
	static class UWBP_Paldex_tab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Paldex_tab_C>();
	}
};
static_assert(alignof(UWBP_Paldex_tab_C) == 0x000008, "Wrong alignment on UWBP_Paldex_tab_C");
static_assert(sizeof(UWBP_Paldex_tab_C) == 0x0002C0, "Wrong size on UWBP_Paldex_tab_C");
static_assert(offsetof(UWBP_Paldex_tab_C, UberGraphFrame) == 0x000278, "Member 'UWBP_Paldex_tab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Paldex_tab_C, Anm_Normal) == 0x000280, "Member 'UWBP_Paldex_tab_C::Anm_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_Paldex_tab_C, Anm_Focus) == 0x000288, "Member 'UWBP_Paldex_tab_C::Anm_Focus' has a wrong offset!");
static_assert(offsetof(UWBP_Paldex_tab_C, Text_Title) == 0x000290, "Member 'UWBP_Paldex_tab_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UWBP_Paldex_tab_C, WBP_PalCommonButton) == 0x000298, "Member 'UWBP_Paldex_tab_C::WBP_PalCommonButton' has a wrong offset!");
static_assert(offsetof(UWBP_Paldex_tab_C, MsgId) == 0x0002A0, "Member 'UWBP_Paldex_tab_C::MsgId' has a wrong offset!");
static_assert(offsetof(UWBP_Paldex_tab_C, OnClicked) == 0x0002B0, "Member 'UWBP_Paldex_tab_C::OnClicked' has a wrong offset!");

}

