#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Paldex_DropItem

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Paldex_DropItem.WBP_Paldex_DropItem_C
// 0x0038 (0x02B0 - 0x0278)
class UWBP_Paldex_DropItem_C final : public UUserWidget
{
public:
	class UImage*                                 Base;                                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dot_0;                                             // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dot_1;                                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dot_2;                                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dot_3;                                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_ItemDesc;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalCommonItemIcon_C*               WBP_PalCommonItemIcon;                             // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Setup(class FName ItemId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Paldex_DropItem_C">();
	}
	static class UWBP_Paldex_DropItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Paldex_DropItem_C>();
	}
};
static_assert(alignof(UWBP_Paldex_DropItem_C) == 0x000008, "Wrong alignment on UWBP_Paldex_DropItem_C");
static_assert(sizeof(UWBP_Paldex_DropItem_C) == 0x0002B0, "Wrong size on UWBP_Paldex_DropItem_C");
static_assert(offsetof(UWBP_Paldex_DropItem_C, Base) == 0x000278, "Member 'UWBP_Paldex_DropItem_C::Base' has a wrong offset!");
static_assert(offsetof(UWBP_Paldex_DropItem_C, Dot_0) == 0x000280, "Member 'UWBP_Paldex_DropItem_C::Dot_0' has a wrong offset!");
static_assert(offsetof(UWBP_Paldex_DropItem_C, Dot_1) == 0x000288, "Member 'UWBP_Paldex_DropItem_C::Dot_1' has a wrong offset!");
static_assert(offsetof(UWBP_Paldex_DropItem_C, Dot_2) == 0x000290, "Member 'UWBP_Paldex_DropItem_C::Dot_2' has a wrong offset!");
static_assert(offsetof(UWBP_Paldex_DropItem_C, Dot_3) == 0x000298, "Member 'UWBP_Paldex_DropItem_C::Dot_3' has a wrong offset!");
static_assert(offsetof(UWBP_Paldex_DropItem_C, Text_ItemDesc) == 0x0002A0, "Member 'UWBP_Paldex_DropItem_C::Text_ItemDesc' has a wrong offset!");
static_assert(offsetof(UWBP_Paldex_DropItem_C, WBP_PalCommonItemIcon) == 0x0002A8, "Member 'UWBP_Paldex_DropItem_C::WBP_PalCommonItemIcon' has a wrong offset!");

}

