#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PalConvertItemMenu_RecipeSlotButton

#include "Basic.hpp"

#include "Pal_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_PalConvertItemMenu_RecipeSlotButton.WBP_PalConvertItemMenu_RecipeSlotButton_C.BndEvt__WBP_PalConvertItemMenu_RecipeSlotButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PalConvertItemMenu_RecipeSlotButton_C_BndEvt__WBP_PalConvertItemMenu_RecipeSlotButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalConvertItemMenu_RecipeSlotButton_C_BndEvt__WBP_PalConvertItemMenu_RecipeSlotButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PalConvertItemMenu_RecipeSlotButton_C_BndEvt__WBP_PalConvertItemMenu_RecipeSlotButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_PalConvertItemMenu_RecipeSlotButton_C_BndEvt__WBP_PalConvertItemMenu_RecipeSlotButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_PalConvertItemMenu_RecipeSlotButton_C_BndEvt__WBP_PalConvertItemMenu_RecipeSlotButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_BndEvt__WBP_PalConvertItemMenu_RecipeSlotButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_BndEvt__WBP_PalConvertItemMenu_RecipeSlotButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_PalConvertItemMenu_RecipeSlotButton.WBP_PalConvertItemMenu_RecipeSlotButton_C.BndEvt__WBP_PalConvertItemMenu_RecipeSlotButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PalConvertItemMenu_RecipeSlotButton_C_BndEvt__WBP_PalConvertItemMenu_RecipeSlotButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalConvertItemMenu_RecipeSlotButton_C_BndEvt__WBP_PalConvertItemMenu_RecipeSlotButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PalConvertItemMenu_RecipeSlotButton_C_BndEvt__WBP_PalConvertItemMenu_RecipeSlotButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_PalConvertItemMenu_RecipeSlotButton_C_BndEvt__WBP_PalConvertItemMenu_RecipeSlotButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_PalConvertItemMenu_RecipeSlotButton_C_BndEvt__WBP_PalConvertItemMenu_RecipeSlotButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_BndEvt__WBP_PalConvertItemMenu_RecipeSlotButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_BndEvt__WBP_PalConvertItemMenu_RecipeSlotButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_PalConvertItemMenu_RecipeSlotButton.WBP_PalConvertItemMenu_RecipeSlotButton_C.BndEvt__WBP_PalConvertItemMenu_RecipeSlotButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PalConvertItemMenu_RecipeSlotButton_C_BndEvt__WBP_PalConvertItemMenu_RecipeSlotButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalConvertItemMenu_RecipeSlotButton_C_BndEvt__WBP_PalConvertItemMenu_RecipeSlotButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PalConvertItemMenu_RecipeSlotButton_C_BndEvt__WBP_PalConvertItemMenu_RecipeSlotButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_PalConvertItemMenu_RecipeSlotButton_C_BndEvt__WBP_PalConvertItemMenu_RecipeSlotButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_PalConvertItemMenu_RecipeSlotButton_C_BndEvt__WBP_PalConvertItemMenu_RecipeSlotButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_BndEvt__WBP_PalConvertItemMenu_RecipeSlotButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_BndEvt__WBP_PalConvertItemMenu_RecipeSlotButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_PalConvertItemMenu_RecipeSlotButton.WBP_PalConvertItemMenu_RecipeSlotButton_C.ExecuteUbergraph_WBP_PalConvertItemMenu_RecipeSlotButton
// 0x0028 (0x0028 - 0x0000)
struct WBP_PalConvertItemMenu_RecipeSlotButton_C_ExecuteUbergraph_WBP_PalConvertItemMenu_RecipeSlotButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_576C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalConvertItemMenu_RecipeSlotButton_C_ExecuteUbergraph_WBP_PalConvertItemMenu_RecipeSlotButton) == 0x000008, "Wrong alignment on WBP_PalConvertItemMenu_RecipeSlotButton_C_ExecuteUbergraph_WBP_PalConvertItemMenu_RecipeSlotButton");
static_assert(sizeof(WBP_PalConvertItemMenu_RecipeSlotButton_C_ExecuteUbergraph_WBP_PalConvertItemMenu_RecipeSlotButton) == 0x000028, "Wrong size on WBP_PalConvertItemMenu_RecipeSlotButton_C_ExecuteUbergraph_WBP_PalConvertItemMenu_RecipeSlotButton");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_ExecuteUbergraph_WBP_PalConvertItemMenu_RecipeSlotButton, EntryPoint) == 0x000000, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_ExecuteUbergraph_WBP_PalConvertItemMenu_RecipeSlotButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_ExecuteUbergraph_WBP_PalConvertItemMenu_RecipeSlotButton, K2Node_ComponentBoundEvent_Button_2) == 0x000008, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_ExecuteUbergraph_WBP_PalConvertItemMenu_RecipeSlotButton::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_ExecuteUbergraph_WBP_PalConvertItemMenu_RecipeSlotButton, K2Node_ComponentBoundEvent_Button_1) == 0x000010, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_ExecuteUbergraph_WBP_PalConvertItemMenu_RecipeSlotButton::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_ExecuteUbergraph_WBP_PalConvertItemMenu_RecipeSlotButton, K2Node_ComponentBoundEvent_Button) == 0x000018, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_ExecuteUbergraph_WBP_PalConvertItemMenu_RecipeSlotButton::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_ExecuteUbergraph_WBP_PalConvertItemMenu_RecipeSlotButton, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_ExecuteUbergraph_WBP_PalConvertItemMenu_RecipeSlotButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_PalConvertItemMenu_RecipeSlotButton.WBP_PalConvertItemMenu_RecipeSlotButton_C.GetRecipeId
// 0x0008 (0x0008 - 0x0000)
struct WBP_PalConvertItemMenu_RecipeSlotButton_C_GetRecipeId final
{
public:
	class FName                                   Param_RecipeID;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalConvertItemMenu_RecipeSlotButton_C_GetRecipeId) == 0x000004, "Wrong alignment on WBP_PalConvertItemMenu_RecipeSlotButton_C_GetRecipeId");
static_assert(sizeof(WBP_PalConvertItemMenu_RecipeSlotButton_C_GetRecipeId) == 0x000008, "Wrong size on WBP_PalConvertItemMenu_RecipeSlotButton_C_GetRecipeId");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_GetRecipeId, Param_RecipeID) == 0x000000, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_GetRecipeId::Param_RecipeID' has a wrong offset!");

// Function WBP_PalConvertItemMenu_RecipeSlotButton.WBP_PalConvertItemMenu_RecipeSlotButton_C.OnClickSlot__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PalConvertItemMenu_RecipeSlotButton_C_OnClickSlot__DelegateSignature final
{
public:
	class UWBP_PalConvertItemMenu_RecipeSlotButton_C* SelfWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalConvertItemMenu_RecipeSlotButton_C_OnClickSlot__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PalConvertItemMenu_RecipeSlotButton_C_OnClickSlot__DelegateSignature");
static_assert(sizeof(WBP_PalConvertItemMenu_RecipeSlotButton_C_OnClickSlot__DelegateSignature) == 0x000008, "Wrong size on WBP_PalConvertItemMenu_RecipeSlotButton_C_OnClickSlot__DelegateSignature");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_OnClickSlot__DelegateSignature, SelfWidget) == 0x000000, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_OnClickSlot__DelegateSignature::SelfWidget' has a wrong offset!");

// Function WBP_PalConvertItemMenu_RecipeSlotButton.WBP_PalConvertItemMenu_RecipeSlotButton_C.OnHoveredSlot__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PalConvertItemMenu_RecipeSlotButton_C_OnHoveredSlot__DelegateSignature final
{
public:
	class UWBP_PalConvertItemMenu_RecipeSlotButton_C* SelfWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalConvertItemMenu_RecipeSlotButton_C_OnHoveredSlot__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PalConvertItemMenu_RecipeSlotButton_C_OnHoveredSlot__DelegateSignature");
static_assert(sizeof(WBP_PalConvertItemMenu_RecipeSlotButton_C_OnHoveredSlot__DelegateSignature) == 0x000008, "Wrong size on WBP_PalConvertItemMenu_RecipeSlotButton_C_OnHoveredSlot__DelegateSignature");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_OnHoveredSlot__DelegateSignature, SelfWidget) == 0x000000, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_OnHoveredSlot__DelegateSignature::SelfWidget' has a wrong offset!");

// Function WBP_PalConvertItemMenu_RecipeSlotButton.WBP_PalConvertItemMenu_RecipeSlotButton_C.OnUnhoveredSlot__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PalConvertItemMenu_RecipeSlotButton_C_OnUnhoveredSlot__DelegateSignature final
{
public:
	class UWBP_PalConvertItemMenu_RecipeSlotButton_C* SelfWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalConvertItemMenu_RecipeSlotButton_C_OnUnhoveredSlot__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PalConvertItemMenu_RecipeSlotButton_C_OnUnhoveredSlot__DelegateSignature");
static_assert(sizeof(WBP_PalConvertItemMenu_RecipeSlotButton_C_OnUnhoveredSlot__DelegateSignature) == 0x000008, "Wrong size on WBP_PalConvertItemMenu_RecipeSlotButton_C_OnUnhoveredSlot__DelegateSignature");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_OnUnhoveredSlot__DelegateSignature, SelfWidget) == 0x000000, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_OnUnhoveredSlot__DelegateSignature::SelfWidget' has a wrong offset!");

// Function WBP_PalConvertItemMenu_RecipeSlotButton.WBP_PalConvertItemMenu_RecipeSlotButton_C.SetPalGearIcon
// 0x0058 (0x0058 - 0x0000)
struct WBP_PalConvertItemMenu_RecipeSlotButton_C_SetPalGearIcon final
{
public:
	class FName                                   ItemId;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_576D[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_576E[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Split_LeftS;                              // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_576F[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalConvertItemMenu_RecipeSlotButton_C_SetPalGearIcon) == 0x000008, "Wrong alignment on WBP_PalConvertItemMenu_RecipeSlotButton_C_SetPalGearIcon");
static_assert(sizeof(WBP_PalConvertItemMenu_RecipeSlotButton_C_SetPalGearIcon) == 0x000058, "Wrong size on WBP_PalConvertItemMenu_RecipeSlotButton_C_SetPalGearIcon");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_SetPalGearIcon, ItemId) == 0x000000, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_SetPalGearIcon::ItemId' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_SetPalGearIcon, Temp_bool_Variable) == 0x000008, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_SetPalGearIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_SetPalGearIcon, CallFunc_Conv_NameToString_ReturnValue) == 0x000010, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_SetPalGearIcon::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_SetPalGearIcon, Temp_byte_Variable) == 0x000020, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_SetPalGearIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_SetPalGearIcon, CallFunc_Split_LeftS) == 0x000028, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_SetPalGearIcon::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_SetPalGearIcon, CallFunc_Split_RightS) == 0x000038, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_SetPalGearIcon::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_SetPalGearIcon, CallFunc_Split_ReturnValue) == 0x000048, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_SetPalGearIcon::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_SetPalGearIcon, CallFunc_Conv_StringToName_ReturnValue) == 0x00004C, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_SetPalGearIcon::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_SetPalGearIcon, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000054, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_SetPalGearIcon::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_SetPalGearIcon, Temp_byte_Variable_1) == 0x000055, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_SetPalGearIcon::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_SetPalGearIcon, K2Node_Select_Default) == 0x000056, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_SetPalGearIcon::K2Node_Select_Default' has a wrong offset!");

// Function WBP_PalConvertItemMenu_RecipeSlotButton.WBP_PalConvertItemMenu_RecipeSlotButton_C.SetUnselect
// 0x0008 (0x0008 - 0x0000)
struct WBP_PalConvertItemMenu_RecipeSlotButton_C_SetUnselect final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalConvertItemMenu_RecipeSlotButton_C_SetUnselect) == 0x000008, "Wrong alignment on WBP_PalConvertItemMenu_RecipeSlotButton_C_SetUnselect");
static_assert(sizeof(WBP_PalConvertItemMenu_RecipeSlotButton_C_SetUnselect) == 0x000008, "Wrong size on WBP_PalConvertItemMenu_RecipeSlotButton_C_SetUnselect");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_SetUnselect, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_SetUnselect::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_PalConvertItemMenu_RecipeSlotButton.WBP_PalConvertItemMenu_RecipeSlotButton_C.Setup
// 0x0148 (0x0148 - 0x0000)
struct WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup final
{
public:
	class FName                                   Param_RecipeID;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5770[0x1];                                     // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0030(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5771[0x1];                                     // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalMasterDataTableAccess_ItemRecipe*   CallFunc_GetItemRecipeDataTableAccess_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_FindRow_bResult;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5772[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPalItemRecipe                         CallFunc_BP_FindRow_ReturnValue;                   // 0x0060(0x0070)()
	TMap<class FName, int32>                      K2Node_MakeMap_Map;                                // 0x00D0(0x0050)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5773[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0128(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup) == 0x000008, "Wrong alignment on WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup");
static_assert(sizeof(WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup) == 0x000148, "Wrong size on WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup, Param_RecipeID) == 0x000000, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup::Param_RecipeID' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup, Temp_bool_Variable) == 0x000008, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup, Temp_byte_Variable) == 0x000009, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup, Temp_byte_Variable_1) == 0x00000A, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup, CallFunc_Map_Keys_Keys) == 0x000030, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00004C, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup, CallFunc_Less_IntInt_ReturnValue) == 0x00004D, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup, CallFunc_Map_Remove_ReturnValue) == 0x00004E, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup, CallFunc_GetItemRecipeDataTableAccess_ReturnValue) == 0x000050, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup::CallFunc_GetItemRecipeDataTableAccess_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup, CallFunc_BP_FindRow_bResult) == 0x000058, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup::CallFunc_BP_FindRow_bResult' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup, CallFunc_BP_FindRow_ReturnValue) == 0x000060, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup::CallFunc_BP_FindRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup, K2Node_MakeMap_Map) == 0x0000D0, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000120, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup, CallFunc_Conv_IntToText_ReturnValue) == 0x000128, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup, K2Node_Select_Default) == 0x000140, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_Setup::K2Node_Select_Default' has a wrong offset!");

// Function WBP_PalConvertItemMenu_RecipeSlotButton.WBP_PalConvertItemMenu_RecipeSlotButton_C.UpdateSufficient
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_PalConvertItemMenu_RecipeSlotButton_C_UpdateSufficient final
{
public:
	bool                                          Sufficient;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5774[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5775[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5776[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0018(0x0010)(ReferenceParm)
	TArray<struct FPalStaticItemIdAndNum>         CallFunc_CollectLocalPlayerControllableItemInfos_OutItemInfos; // 0x0028(0x0010)(ReferenceParm)
	struct FPalStaticItemIdAndNum                 CallFunc_Array_Get_Item;                           // 0x0038(0x000C)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5777[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Find_Value;                           // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5778[0x1];                                     // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5779[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue_1;           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_577A[0x5];                                     // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalItemIDManager*                      CallFunc_GetItemIDManager_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalStaticItemDataBase*                 CallFunc_GetStaticItemData_ReturnValue;            // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_577B[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue;       // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimationTimeRange_StartAtTime_ImplicitCast; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalConvertItemMenu_RecipeSlotButton_C_UpdateSufficient) == 0x000008, "Wrong alignment on WBP_PalConvertItemMenu_RecipeSlotButton_C_UpdateSufficient");
static_assert(sizeof(WBP_PalConvertItemMenu_RecipeSlotButton_C_UpdateSufficient) == 0x0000A0, "Wrong size on WBP_PalConvertItemMenu_RecipeSlotButton_C_UpdateSufficient");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_UpdateSufficient, Sufficient) == 0x000000, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_UpdateSufficient::Sufficient' has a wrong offset!");
static_assert(offsetof(WBP_PalConvertItemMenu_RecipeSlotButton_C_UpdateSufficient, Temp_bool_True_if_break_was_hit_Variable) == 0x000001, "Member 'WBP_PalConvertItemMenu_RecipeSlotButton_C_UpdateSufficient::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
