#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenu_Money

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MainMenu_Money.WBP_MainMenu_Money_C
// 0x0048 (0x02C0 - 0x0278)
class UWBP_MainMenu_Money_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 CharaHead_Dot_7;                                   // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CharaHead_Dot_8;                                   // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CharaHead_Dot_9;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CharaHead_Dot_10;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CharaHead_Dot_11;                                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CharaHead_Dot_12;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CharaHeadBase_2;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_Money;                                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_MainMenu_Money(int32 EntryPoint);
	void UpdateMoney(const class FString& NowMoney);
	void WBP_MainMenu_Money_AutoGenFunc(int64 NowMoney);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MainMenu_Money_C">();
	}
	static class UWBP_MainMenu_Money_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MainMenu_Money_C>();
	}
};
static_assert(alignof(UWBP_MainMenu_Money_C) == 0x000008, "Wrong alignment on UWBP_MainMenu_Money_C");
static_assert(sizeof(UWBP_MainMenu_Money_C) == 0x0002C0, "Wrong size on UWBP_MainMenu_Money_C");
static_assert(offsetof(UWBP_MainMenu_Money_C, UberGraphFrame) == 0x000278, "Member 'UWBP_MainMenu_Money_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Money_C, CharaHead_Dot_7) == 0x000280, "Member 'UWBP_MainMenu_Money_C::CharaHead_Dot_7' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Money_C, CharaHead_Dot_8) == 0x000288, "Member 'UWBP_MainMenu_Money_C::CharaHead_Dot_8' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Money_C, CharaHead_Dot_9) == 0x000290, "Member 'UWBP_MainMenu_Money_C::CharaHead_Dot_9' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Money_C, CharaHead_Dot_10) == 0x000298, "Member 'UWBP_MainMenu_Money_C::CharaHead_Dot_10' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Money_C, CharaHead_Dot_11) == 0x0002A0, "Member 'UWBP_MainMenu_Money_C::CharaHead_Dot_11' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Money_C, CharaHead_Dot_12) == 0x0002A8, "Member 'UWBP_MainMenu_Money_C::CharaHead_Dot_12' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Money_C, CharaHeadBase_2) == 0x0002B0, "Member 'UWBP_MainMenu_Money_C::CharaHeadBase_2' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Money_C, Text_Money) == 0x0002B8, "Member 'UWBP_MainMenu_Money_C::Text_Money' has a wrong offset!");

}

