#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InventoryEquipment_GrowsPointButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_InventoryEquipment_GrowsPointButton.WBP_InventoryEquipment_GrowsPointButton_C.ExecuteUbergraph_WBP_InventoryEquipment_GrowsPointButton
// 0x0048 (0x0048 - 0x0000)
struct WBP_InventoryEquipment_GrowsPointButton_C_ExecuteUbergraph_WBP_InventoryEquipment_GrowsPointButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5877[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5878[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5879[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventoryEquipment_GrowsPointButton_C_ExecuteUbergraph_WBP_InventoryEquipment_GrowsPointButton) == 0x000008, "Wrong alignment on WBP_InventoryEquipment_GrowsPointButton_C_ExecuteUbergraph_WBP_InventoryEquipment_GrowsPointButton");
static_assert(sizeof(WBP_InventoryEquipment_GrowsPointButton_C_ExecuteUbergraph_WBP_InventoryEquipment_GrowsPointButton) == 0x000048, "Wrong size on WBP_InventoryEquipment_GrowsPointButton_C_ExecuteUbergraph_WBP_InventoryEquipment_GrowsPointButton");
static_assert(offsetof(WBP_InventoryEquipment_GrowsPointButton_C_ExecuteUbergraph_WBP_InventoryEquipment_GrowsPointButton, EntryPoint) == 0x000000, "Member 'WBP_InventoryEquipment_GrowsPointButton_C_ExecuteUbergraph_WBP_InventoryEquipment_GrowsPointButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_GrowsPointButton_C_ExecuteUbergraph_WBP_InventoryEquipment_GrowsPointButton, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_InventoryEquipment_GrowsPointButton_C_ExecuteUbergraph_WBP_InventoryEquipment_GrowsPointButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_GrowsPointButton_C_ExecuteUbergraph_WBP_InventoryEquipment_GrowsPointButton, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_InventoryEquipment_GrowsPointButton_C_ExecuteUbergraph_WBP_InventoryEquipment_GrowsPointButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_GrowsPointButton_C_ExecuteUbergraph_WBP_InventoryEquipment_GrowsPointButton, CallFunc_GetEndTime_ReturnValue) == 0x000020, "Member 'WBP_InventoryEquipment_GrowsPointButton_C_ExecuteUbergraph_WBP_InventoryEquipment_GrowsPointButton::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_GrowsPointButton_C_ExecuteUbergraph_WBP_InventoryEquipment_GrowsPointButton, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000028, "Member 'WBP_InventoryEquipment_GrowsPointButton_C_ExecuteUbergraph_WBP_InventoryEquipment_GrowsPointButton::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_GrowsPointButton_C_ExecuteUbergraph_WBP_InventoryEquipment_GrowsPointButton, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000030, "Member 'WBP_InventoryEquipment_GrowsPointButton_C_ExecuteUbergraph_WBP_InventoryEquipment_GrowsPointButton::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_GrowsPointButton_C_ExecuteUbergraph_WBP_InventoryEquipment_GrowsPointButton, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_InventoryEquipment_GrowsPointButton_C_ExecuteUbergraph_WBP_InventoryEquipment_GrowsPointButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_GrowsPointButton_C_ExecuteUbergraph_WBP_InventoryEquipment_GrowsPointButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000040, "Member 'WBP_InventoryEquipment_GrowsPointButton_C_ExecuteUbergraph_WBP_InventoryEquipment_GrowsPointButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function WBP_InventoryEquipment_GrowsPointButton.WBP_InventoryEquipment_GrowsPointButton_C.SetPoint
// 0x0020 (0x0020 - 0x0000)
struct WBP_InventoryEquipment_GrowsPointButton_C_SetPoint final
{
public:
	int32                                         Point;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_587A[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(WBP_InventoryEquipment_GrowsPointButton_C_SetPoint) == 0x000008, "Wrong alignment on WBP_InventoryEquipment_GrowsPointButton_C_SetPoint");
static_assert(sizeof(WBP_InventoryEquipment_GrowsPointButton_C_SetPoint) == 0x000020, "Wrong size on WBP_InventoryEquipment_GrowsPointButton_C_SetPoint");
static_assert(offsetof(WBP_InventoryEquipment_GrowsPointButton_C_SetPoint, Point) == 0x000000, "Member 'WBP_InventoryEquipment_GrowsPointButton_C_SetPoint::Point' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_GrowsPointButton_C_SetPoint, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'WBP_InventoryEquipment_GrowsPointButton_C_SetPoint::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_GrowsPointButton_C_SetPoint, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_InventoryEquipment_GrowsPointButton_C_SetPoint::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_InventoryEquipment_GrowsPointButton.WBP_InventoryEquipment_GrowsPointButton_C.SetSimulatePoint
// 0x0020 (0x0020 - 0x0000)
struct WBP_InventoryEquipment_GrowsPointButton_C_SetSimulatePoint final
{
public:
	int32                                         Point;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_587B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(WBP_InventoryEquipment_GrowsPointButton_C_SetSimulatePoint) == 0x000008, "Wrong alignment on WBP_InventoryEquipment_GrowsPointButton_C_SetSimulatePoint");
static_assert(sizeof(WBP_InventoryEquipment_GrowsPointButton_C_SetSimulatePoint) == 0x000020, "Wrong size on WBP_InventoryEquipment_GrowsPointButton_C_SetSimulatePoint");
static_assert(offsetof(WBP_InventoryEquipment_GrowsPointButton_C_SetSimulatePoint, Point) == 0x000000, "Member 'WBP_InventoryEquipment_GrowsPointButton_C_SetSimulatePoint::Point' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_GrowsPointButton_C_SetSimulatePoint, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_InventoryEquipment_GrowsPointButton_C_SetSimulatePoint::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

}

