#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PalWorkFarm

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Pal_structs.hpp"
#include "Pal_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PalWorkFarm.WBP_PalWorkFarm_C
// 0x0100 (0x0508 - 0x0408)
class UWBP_PalWorkFarm_C final : public UPalUIMapObjectStatusIndicatorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0408(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anm_Progress_Pre_Loop;                             // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anm_DetailToSimple;                                // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CircleGauge_Progress;                              // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressArrow0;                                    // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressArrow0_1;                                  // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressArrow0_2;                                  // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_ItemName;                                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_Progress_Aft;                                 // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_Progress_Pre;                                 // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalCommonItemIcon_C*               WBP_PalCommonItemIcon;                             // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalCraftInfo_Pal_C*                WBP_PalCraftInfo_Pal;                              // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalCraftInfo_Pal_C*                WBP_PalCraftInfo_Pal_1;                            // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalCraftInfo_Pal_C*                WBP_PalCraftInfo_Pal_2;                            // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalCraftInfo_Pal_C*                WBP_PalCraftInfo_Pal_3;                            // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalCraftInfo_Pal_C*                WBP_PalCraftInfo_Pal_4;                            // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RequirePalInfo_C*                  WBP_RequirePalInfo;                                // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPalMapObjectFarmBlockV2Model*          Model;                                             // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<EPalFarmCropState, struct FDataTableRowHandle> StateMsgIdMap;                                     // 0x0498(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	TArray<class UWBP_PalCraftInfo_Pal_C*>        PalInfos;                                          // 0x04E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FTimerHandle                           DisplayCheckTimer;                                 // 0x04F8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDisplayedDetail;                                 // 0x0500(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HideNextState;                                     // 0x0501(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void CREATEDELEGATE_PROXYFUNCTION_0(float NewValue);
	void Destruct();
	void DisplayCheck();
	void ExecuteUbergraph_WBP_PalWorkFarm(int32 EntryPoint);
	void On_Updated_Worker_Pal(class UPalWorkBase* Work);
	void OnSetup();
	void OnUpdateProgress(double Progress);
	void OnUpdateState(EPalFarmCropState LastState, EPalFarmCropState NextState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PalWorkFarm_C">();
	}
	static class UWBP_PalWorkFarm_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PalWorkFarm_C>();
	}
};
static_assert(alignof(UWBP_PalWorkFarm_C) == 0x000008, "Wrong alignment on UWBP_PalWorkFarm_C");
static_assert(sizeof(UWBP_PalWorkFarm_C) == 0x000508, "Wrong size on UWBP_PalWorkFarm_C");
static_assert(offsetof(UWBP_PalWorkFarm_C, UberGraphFrame) == 0x000408, "Member 'UWBP_PalWorkFarm_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PalWorkFarm_C, Anm_Progress_Pre_Loop) == 0x000410, "Member 'UWBP_PalWorkFarm_C::Anm_Progress_Pre_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_PalWorkFarm_C, Anm_DetailToSimple) == 0x000418, "Member 'UWBP_PalWorkFarm_C::Anm_DetailToSimple' has a wrong offset!");
static_assert(offsetof(UWBP_PalWorkFarm_C, CircleGauge_Progress) == 0x000420, "Member 'UWBP_PalWorkFarm_C::CircleGauge_Progress' has a wrong offset!");
static_assert(offsetof(UWBP_PalWorkFarm_C, ProgressArrow0) == 0x000428, "Member 'UWBP_PalWorkFarm_C::ProgressArrow0' has a wrong offset!");
static_assert(offsetof(UWBP_PalWorkFarm_C, ProgressArrow0_1) == 0x000430, "Member 'UWBP_PalWorkFarm_C::ProgressArrow0_1' has a wrong offset!");
static_assert(offsetof(UWBP_PalWorkFarm_C, ProgressArrow0_2) == 0x000438, "Member 'UWBP_PalWorkFarm_C::ProgressArrow0_2' has a wrong offset!");
static_assert(offsetof(UWBP_PalWorkFarm_C, Text_ItemName) == 0x000440, "Member 'UWBP_PalWorkFarm_C::Text_ItemName' has a wrong offset!");
static_assert(offsetof(UWBP_PalWorkFarm_C, Text_Progress_Aft) == 0x000448, "Member 'UWBP_PalWorkFarm_C::Text_Progress_Aft' has a wrong offset!");
static_assert(offsetof(UWBP_PalWorkFarm_C, Text_Progress_Pre) == 0x000450, "Member 'UWBP_PalWorkFarm_C::Text_Progress_Pre' has a wrong offset!");
static_assert(offsetof(UWBP_PalWorkFarm_C, WBP_PalCommonItemIcon) == 0x000458, "Member 'UWBP_PalWorkFarm_C::WBP_PalCommonItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_PalWorkFarm_C, WBP_PalCraftInfo_Pal) == 0x000460, "Member 'UWBP_PalWorkFarm_C::WBP_PalCraftInfo_Pal' has a wrong offset!");
static_assert(offsetof(UWBP_PalWorkFarm_C, WBP_PalCraftInfo_Pal_1) == 0x000468, "Member 'UWBP_PalWorkFarm_C::WBP_PalCraftInfo_Pal_1' has a wrong offset!");
static_assert(offsetof(UWBP_PalWorkFarm_C, WBP_PalCraftInfo_Pal_2) == 0x000470, "Member 'UWBP_PalWorkFarm_C::WBP_PalCraftInfo_Pal_2' has a wrong offset!");
static_assert(offsetof(UWBP_PalWorkFarm_C, WBP_PalCraftInfo_Pal_3) == 0x000478, "Member 'UWBP_PalWorkFarm_C::WBP_PalCraftInfo_Pal_3' has a wrong offset!");
static_assert(offsetof(UWBP_PalWorkFarm_C, WBP_PalCraftInfo_Pal_4) == 0x000480, "Member 'UWBP_PalWorkFarm_C::WBP_PalCraftInfo_Pal_4' has a wrong offset!");
static_assert(offsetof(UWBP_PalWorkFarm_C, WBP_RequirePalInfo) == 0x000488, "Member 'UWBP_PalWorkFarm_C::WBP_RequirePalInfo' has a wrong offset!");
static_assert(offsetof(UWBP_PalWorkFarm_C, Model) == 0x000490, "Member 'UWBP_PalWorkFarm_C::Model' has a wrong offset!");
static_assert(offsetof(UWBP_PalWorkFarm_C, StateMsgIdMap) == 0x000498, "Member 'UWBP_PalWorkFarm_C::StateMsgIdMap' has a wrong offset!");
static_assert(offsetof(UWBP_PalWorkFarm_C, PalInfos) == 0x0004E8, "Member 'UWBP_PalWorkFarm_C::PalInfos' has a wrong offset!");
static_assert(offsetof(UWBP_PalWorkFarm_C, DisplayCheckTimer) == 0x0004F8, "Member 'UWBP_PalWorkFarm_C::DisplayCheckTimer' has a wrong offset!");
static_assert(offsetof(UWBP_PalWorkFarm_C, IsDisplayedDetail) == 0x000500, "Member 'UWBP_PalWorkFarm_C::IsDisplayedDetail' has a wrong offset!");
static_assert(offsetof(UWBP_PalWorkFarm_C, HideNextState) == 0x000501, "Member 'UWBP_PalWorkFarm_C::HideNextState' has a wrong offset!");

}

