#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IngameMenuConstruction_Radial

#include "Basic.hpp"

#include "Pal_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_IngameMenuConstruction_Radial.WBP_IngameMenuConstruction_Radial_C.CanConstructiBuildObject
// 0x0098 (0x0098 - 0x0000)
struct WBP_IngameMenuConstruction_Radial_C_CanConstructiBuildObject final
{
public:
	struct FPalBuildObjectData                    BuildObjectData;                                   // 0x0000(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CanConstruct;                                      // 0x0080(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsExistsMaterialForBuildObject_ReturnValue; // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5930[0x6];                                     // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalDebugSetting*                       CallFunc_GetPalDebugSetting_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenuConstruction_Radial_C_CanConstructiBuildObject) == 0x000008, "Wrong alignment on WBP_IngameMenuConstruction_Radial_C_CanConstructiBuildObject");
static_assert(sizeof(WBP_IngameMenuConstruction_Radial_C_CanConstructiBuildObject) == 0x000098, "Wrong size on WBP_IngameMenuConstruction_Radial_C_CanConstructiBuildObject");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_CanConstructiBuildObject, BuildObjectData) == 0x000000, "Member 'WBP_IngameMenuConstruction_Radial_C_CanConstructiBuildObject::BuildObjectData' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_CanConstructiBuildObject, CanConstruct) == 0x000080, "Member 'WBP_IngameMenuConstruction_Radial_C_CanConstructiBuildObject::CanConstruct' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_CanConstructiBuildObject, CallFunc_IsExistsMaterialForBuildObject_ReturnValue) == 0x000081, "Member 'WBP_IngameMenuConstruction_Radial_C_CanConstructiBuildObject::CallFunc_IsExistsMaterialForBuildObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_CanConstructiBuildObject, CallFunc_GetPalDebugSetting_ReturnValue) == 0x000088, "Member 'WBP_IngameMenuConstruction_Radial_C_CanConstructiBuildObject::CallFunc_GetPalDebugSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_CanConstructiBuildObject, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'WBP_IngameMenuConstruction_Radial_C_CanConstructiBuildObject::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_IngameMenuConstruction_Radial.WBP_IngameMenuConstruction_Radial_C.Close
// 0x0020 (0x0020 - 0x0000)
struct WBP_IngameMenuConstruction_Radial_C_Close final
{
public:
	class UPalUserWidget*                         ParentWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerController*                   K2Node_DynamicCast_AsPal_Player_Controller;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenuConstruction_Radial_C_Close) == 0x000008, "Wrong alignment on WBP_IngameMenuConstruction_Radial_C_Close");
static_assert(sizeof(WBP_IngameMenuConstruction_Radial_C_Close) == 0x000020, "Wrong size on WBP_IngameMenuConstruction_Radial_C_Close");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Close, ParentWidget) == 0x000000, "Member 'WBP_IngameMenuConstruction_Radial_C_Close::ParentWidget' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Close, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000008, "Member 'WBP_IngameMenuConstruction_Radial_C_Close::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Close, K2Node_DynamicCast_AsPal_Player_Controller) == 0x000010, "Member 'WBP_IngameMenuConstruction_Radial_C_Close::K2Node_DynamicCast_AsPal_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Close, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_IngameMenuConstruction_Radial_C_Close::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Close, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'WBP_IngameMenuConstruction_Radial_C_Close::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_IngameMenuConstruction_Radial.WBP_IngameMenuConstruction_Radial_C.CreateModel
// 0x0018 (0x0018 - 0x0000)
struct WBP_IngameMenuConstruction_Radial_C_CreateModel final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_InGameMenuBuildModel_C*             CallFunc_SpawnObject_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenuConstruction_Radial_C_CreateModel) == 0x000008, "Wrong alignment on WBP_IngameMenuConstruction_Radial_C_CreateModel");
static_assert(sizeof(WBP_IngameMenuConstruction_Radial_C_CreateModel) == 0x000018, "Wrong size on WBP_IngameMenuConstruction_Radial_C_CreateModel");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_CreateModel, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_IngameMenuConstruction_Radial_C_CreateModel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_CreateModel, CallFunc_SpawnObject_ReturnValue) == 0x000010, "Member 'WBP_IngameMenuConstruction_Radial_C_CreateModel::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function WBP_IngameMenuConstruction_Radial.WBP_IngameMenuConstruction_Radial_C.CreateTab_Internal
// 0x0118 (0x0118 - 0x0000)
struct WBP_IngameMenuConstruction_Radial_C_CreateTab_Internal final
{
public:
	EPalBuildObjectTypeA                          TypeA;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5931[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EPalBuildObjectTypeA, TSoftObjectPtr<class UTexture2D>> IconMap;                                           // 0x0008(0x0050)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UTexture2D>              CallFunc_Map_Find_Value;                           // 0x0058(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5932[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetBuildObjectCategoryAName_outName;      // 0x0090(0x0018)()
	TMap<EPalBuildObjectTypeA, TSoftObjectPtr<class UTexture2D>> K2Node_MakeVariable_MakeVariableOutput;            // 0x00A8(0x0050)()
	class UWBP_IngameMenuConstruction_Tab_C*      CallFunc_Create_ReturnValue;                       // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPalBuildObjectTypeA TypeA)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0108(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenuConstruction_Radial_C_CreateTab_Internal) == 0x000008, "Wrong alignment on WBP_IngameMenuConstruction_Radial_C_CreateTab_Internal");
static_assert(sizeof(WBP_IngameMenuConstruction_Radial_C_CreateTab_Internal) == 0x000118, "Wrong size on WBP_IngameMenuConstruction_Radial_C_CreateTab_Internal");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_CreateTab_Internal, TypeA) == 0x000000, "Member 'WBP_IngameMenuConstruction_Radial_C_CreateTab_Internal::TypeA' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_CreateTab_Internal, IconMap) == 0x000008, "Member 'WBP_IngameMenuConstruction_Radial_C_CreateTab_Internal::IconMap' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_CreateTab_Internal, CallFunc_Map_Find_Value) == 0x000058, "Member 'WBP_IngameMenuConstruction_Radial_C_CreateTab_Internal::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_CreateTab_Internal, CallFunc_Map_Find_ReturnValue) == 0x000088, "Member 'WBP_IngameMenuConstruction_Radial_C_CreateTab_Internal::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_CreateTab_Internal, CallFunc_GetBuildObjectCategoryAName_outName) == 0x000090, "Member 'WBP_IngameMenuConstruction_Radial_C_CreateTab_Internal::CallFunc_GetBuildObjectCategoryAName_outName' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_CreateTab_Internal, K2Node_MakeVariable_MakeVariableOutput) == 0x0000A8, "Member 'WBP_IngameMenuConstruction_Radial_C_CreateTab_Internal::K2Node_MakeVariable_MakeVariableOutput' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_CreateTab_Internal, CallFunc_Create_ReturnValue) == 0x0000F8, "Member 'WBP_IngameMenuConstruction_Radial_C_CreateTab_Internal::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_CreateTab_Internal, CallFunc_AddChild_ReturnValue) == 0x000100, "Member 'WBP_IngameMenuConstruction_Radial_C_CreateTab_Internal::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_CreateTab_Internal, K2Node_CreateDelegate_OutputDelegate) == 0x000108, "Member 'WBP_IngameMenuConstruction_Radial_C_CreateTab_Internal::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_IngameMenuConstruction_Radial.WBP_IngameMenuConstruction_Radial_C.ExecuteUbergraph_WBP_IngameMenuConstruction_Radial
// 0x0004 (0x0004 - 0x0000)
struct WBP_IngameMenuConstruction_Radial_C_ExecuteUbergraph_WBP_IngameMenuConstruction_Radial final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenuConstruction_Radial_C_ExecuteUbergraph_WBP_IngameMenuConstruction_Radial) == 0x000004, "Wrong alignment on WBP_IngameMenuConstruction_Radial_C_ExecuteUbergraph_WBP_IngameMenuConstruction_Radial");
static_assert(sizeof(WBP_IngameMenuConstruction_Radial_C_ExecuteUbergraph_WBP_IngameMenuConstruction_Radial) == 0x000004, "Wrong size on WBP_IngameMenuConstruction_Radial_C_ExecuteUbergraph_WBP_IngameMenuConstruction_Radial");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_ExecuteUbergraph_WBP_IngameMenuConstruction_Radial, EntryPoint) == 0x000000, "Member 'WBP_IngameMenuConstruction_Radial_C_ExecuteUbergraph_WBP_IngameMenuConstruction_Radial::EntryPoint' has a wrong offset!");

// Function WBP_IngameMenuConstruction_Radial.WBP_IngameMenuConstruction_Radial_C.Find Selected Index By Map Object Name
// 0x0138 (0x0138 - 0x0000)
struct WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name final
{
public:
	class FName                                   SelectMapObjectName;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Page;                                              // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPageChanged;                                      // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5933[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SlotIndex;                                         // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PageIndex;                                         // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5934[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5935[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EPalBuildObjectTypeA>                  CallFunc_Map_Keys_Keys;                            // 0x0048(0x0010)(ReferenceParm)
	EPalBuildObjectTypeA                          CallFunc_Array_Get_Item;                           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5936[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5937[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5938[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5939[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPalBuildObjectDataSetTypeB>    CallFunc_GetBuildObjectDataArrayForTypeAByTypeB_OutArray; // 0x0078(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_593A[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPalBuildObjectDataSetTypeB            CallFunc_Array_Get_Item_1;                         // 0x0090(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_593B[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPalBuildObjectData                    CallFunc_Array_Get_Item_2;                         // 0x00B0(0x0080)()
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name) == 0x000008, "Wrong alignment on WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name");
static_assert(sizeof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name) == 0x000138, "Wrong size on WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, SelectMapObjectName) == 0x000000, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::SelectMapObjectName' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, Page) == 0x000008, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::Page' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, Param_Index) == 0x00000C, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, bPageChanged) == 0x000010, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::bPageChanged' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, SlotIndex) == 0x000014, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::SlotIndex' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, PageIndex) == 0x000018, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::PageIndex' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, CallFunc_NotEqual_NameName_ReturnValue) == 0x00001C, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, Temp_int_Array_Index_Variable_1) == 0x000024, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, Temp_int_Array_Index_Variable_2) == 0x000030, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, Temp_int_Loop_Counter_Variable_1) == 0x000034, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, CallFunc_Add_IntInt_ReturnValue_2) == 0x00003C, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, CallFunc_Add_IntInt_ReturnValue_3) == 0x000040, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, CallFunc_Map_Keys_Keys) == 0x000048, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, CallFunc_Array_Get_Item) == 0x000058, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, CallFunc_Array_Length_ReturnValue) == 0x00005C, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000060, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, CallFunc_Add_IntInt_ReturnValue_4) == 0x000064, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, Temp_int_Loop_Counter_Variable_2) == 0x000068, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, CallFunc_Less_IntInt_ReturnValue) == 0x00006C, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, CallFunc_Add_IntInt_ReturnValue_5) == 0x000070, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, CallFunc_GetBuildObjectDataArrayForTypeAByTypeB_OutArray) == 0x000078, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::CallFunc_GetBuildObjectDataArrayForTypeAByTypeB_OutArray' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, CallFunc_Array_Length_ReturnValue_1) == 0x000088, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, CallFunc_Array_Get_Item_1) == 0x000090, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A8, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, CallFunc_Array_Get_Item_2) == 0x0000B0, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, CallFunc_Array_Length_ReturnValue_2) == 0x000130, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, CallFunc_Less_IntInt_ReturnValue_2) == 0x000134, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000135, "Member 'WBP_IngameMenuConstruction_Radial_C_Find_Selected_Index_By_Map_Object_Name::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function WBP_IngameMenuConstruction_Radial.WBP_IngameMenuConstruction_Radial_C.Get Build Object Data
// 0x0128 (0x0128 - 0x0000)
struct WBP_IngameMenuConstruction_Radial_C_Get_Build_Object_Data final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_593C[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPalBuildObjectData                    Output;                                            // 0x0008(0x0080)(Parm, OutParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_593D[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPalBuildObjectData                    CallFunc_Array_Get_Item;                           // 0x0098(0x0080)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_593E[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenuConstruction_Radial_C_Get_Build_Object_Data) == 0x000008, "Wrong alignment on WBP_IngameMenuConstruction_Radial_C_Get_Build_Object_Data");
static_assert(sizeof(WBP_IngameMenuConstruction_Radial_C_Get_Build_Object_Data) == 0x000128, "Wrong size on WBP_IngameMenuConstruction_Radial_C_Get_Build_Object_Data");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Get_Build_Object_Data, Param_Index) == 0x000000, "Member 'WBP_IngameMenuConstruction_Radial_C_Get_Build_Object_Data::Param_Index' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Get_Build_Object_Data, ReturnValue) == 0x000004, "Member 'WBP_IngameMenuConstruction_Radial_C_Get_Build_Object_Data::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Get_Build_Object_Data, Output) == 0x000008, "Member 'WBP_IngameMenuConstruction_Radial_C_Get_Build_Object_Data::Output' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Get_Build_Object_Data, Temp_int_Array_Index_Variable) == 0x000088, "Member 'WBP_IngameMenuConstruction_Radial_C_Get_Build_Object_Data::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Get_Build_Object_Data, Temp_int_Loop_Counter_Variable) == 0x00008C, "Member 'WBP_IngameMenuConstruction_Radial_C_Get_Build_Object_Data::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Get_Build_Object_Data, CallFunc_Add_IntInt_ReturnValue) == 0x000090, "Member 'WBP_IngameMenuConstruction_Radial_C_Get_Build_Object_Data::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Get_Build_Object_Data, CallFunc_Array_Get_Item) == 0x000098, "Member 'WBP_IngameMenuConstruction_Radial_C_Get_Build_Object_Data::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Get_Build_Object_Data, CallFunc_Array_Length_ReturnValue) == 0x000118, "Member 'WBP_IngameMenuConstruction_Radial_C_Get_Build_Object_Data::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Get_Build_Object_Data, CallFunc_Less_IntInt_ReturnValue) == 0x00011C, "Member 'WBP_IngameMenuConstruction_Radial_C_Get_Build_Object_Data::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Get_Build_Object_Data, CallFunc_Percent_IntInt_ReturnValue) == 0x000120, "Member 'WBP_IngameMenuConstruction_Radial_C_Get_Build_Object_Data::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Get_Build_Object_Data, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000124, "Member 'WBP_IngameMenuConstruction_Radial_C_Get_Build_Object_Data::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_IngameMenuConstruction_Radial.WBP_IngameMenuConstruction_Radial_C.Get Selected Build Object Data
// 0x0110 (0x0110 - 0x0000)
struct WBP_IngameMenuConstruction_Radial_C_Get_Selected_Build_Object_Data final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_593F[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPalBuildObjectData                    Output;                                            // 0x0008(0x0080)(Parm, OutParm)
	bool                                          CallFunc_Get_Build_Object_Data_ReturnValue;        // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5940[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPalBuildObjectData                    CallFunc_Get_Build_Object_Data_Output;             // 0x0090(0x0080)()
};
static_assert(alignof(WBP_IngameMenuConstruction_Radial_C_Get_Selected_Build_Object_Data) == 0x000008, "Wrong alignment on WBP_IngameMenuConstruction_Radial_C_Get_Selected_Build_Object_Data");
static_assert(sizeof(WBP_IngameMenuConstruction_Radial_C_Get_Selected_Build_Object_Data) == 0x000110, "Wrong size on WBP_IngameMenuConstruction_Radial_C_Get_Selected_Build_Object_Data");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Get_Selected_Build_Object_Data, ReturnValue) == 0x000000, "Member 'WBP_IngameMenuConstruction_Radial_C_Get_Selected_Build_Object_Data::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Get_Selected_Build_Object_Data, Output) == 0x000008, "Member 'WBP_IngameMenuConstruction_Radial_C_Get_Selected_Build_Object_Data::Output' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Get_Selected_Build_Object_Data, CallFunc_Get_Build_Object_Data_ReturnValue) == 0x000088, "Member 'WBP_IngameMenuConstruction_Radial_C_Get_Selected_Build_Object_Data::CallFunc_Get_Build_Object_Data_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_Get_Selected_Build_Object_Data, CallFunc_Get_Build_Object_Data_Output) == 0x000090, "Member 'WBP_IngameMenuConstruction_Radial_C_Get_Selected_Build_Object_Data::CallFunc_Get_Build_Object_Data_Output' has a wrong offset!");

// Function WBP_IngameMenuConstruction_Radial.WBP_IngameMenuConstruction_Radial_C.GetPageCount
// 0x0048 (0x0048 - 0x0000)
struct WBP_IngameMenuConstruction_Radial_C_GetPageCount final
{
public:
	int32                                         PageCount;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5941[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EPalBuildObjectTypeA>                  CallFunc_Map_Keys_Keys;                            // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalBuildObjectTypeA                          CallFunc_Array_Get_Item;                           // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5942[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_IngameMenuConstruction_Tab_C*      CallFunc_Map_Find_Value;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5943[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTabNum_TabNum;                         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenuConstruction_Radial_C_GetPageCount) == 0x000008, "Wrong alignment on WBP_IngameMenuConstruction_Radial_C_GetPageCount");
static_assert(sizeof(WBP_IngameMenuConstruction_Radial_C_GetPageCount) == 0x000048, "Wrong size on WBP_IngameMenuConstruction_Radial_C_GetPageCount");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_GetPageCount, PageCount) == 0x000000, "Member 'WBP_IngameMenuConstruction_Radial_C_GetPageCount::PageCount' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_GetPageCount, Count) == 0x000004, "Member 'WBP_IngameMenuConstruction_Radial_C_GetPageCount::Count' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_GetPageCount, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_IngameMenuConstruction_Radial_C_GetPageCount::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_GetPageCount, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_IngameMenuConstruction_Radial_C_GetPageCount::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_GetPageCount, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_IngameMenuConstruction_Radial_C_GetPageCount::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_GetPageCount, CallFunc_Map_Keys_Keys) == 0x000018, "Member 'WBP_IngameMenuConstruction_Radial_C_GetPageCount::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_GetPageCount, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_IngameMenuConstruction_Radial_C_GetPageCount::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_GetPageCount, CallFunc_Array_Get_Item) == 0x00002C, "Member 'WBP_IngameMenuConstruction_Radial_C_GetPageCount::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_GetPageCount, CallFunc_Less_IntInt_ReturnValue) == 0x00002D, "Member 'WBP_IngameMenuConstruction_Radial_C_GetPageCount::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_GetPageCount, CallFunc_Map_Find_Value) == 0x000030, "Member 'WBP_IngameMenuConstruction_Radial_C_GetPageCount::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_GetPageCount, CallFunc_Map_Find_ReturnValue) == 0x000038, "Member 'WBP_IngameMenuConstruction_Radial_C_GetPageCount::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_GetPageCount, CallFunc_GetTabNum_TabNum) == 0x00003C, "Member 'WBP_IngameMenuConstruction_Radial_C_GetPageCount::CallFunc_GetTabNum_TabNum' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_GetPageCount, CallFunc_Add_IntInt_ReturnValue_1) == 0x000040, "Member 'WBP_IngameMenuConstruction_Radial_C_GetPageCount::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_IngameMenuConstruction_Radial.WBP_IngameMenuConstruction_Radial_C.IsExistsMaterialForBuildObject
// 0x0098 (0x0098 - 0x0000)
struct WBP_IngameMenuConstruction_Radial_C_IsExistsMaterialForBuildObject final
{
public:
	struct FPalBuildObjectData                    BuildObjectData;                                   // 0x0000(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          ReturnValue;                                       // 0x0080(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5944[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsExistsMaterialForBuildObject_ReturnValue; // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenuConstruction_Radial_C_IsExistsMaterialForBuildObject) == 0x000008, "Wrong alignment on WBP_IngameMenuConstruction_Radial_C_IsExistsMaterialForBuildObject");
static_assert(sizeof(WBP_IngameMenuConstruction_Radial_C_IsExistsMaterialForBuildObject) == 0x000098, "Wrong size on WBP_IngameMenuConstruction_Radial_C_IsExistsMaterialForBuildObject");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_IsExistsMaterialForBuildObject, BuildObjectData) == 0x000000, "Member 'WBP_IngameMenuConstruction_Radial_C_IsExistsMaterialForBuildObject::BuildObjectData' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_IsExistsMaterialForBuildObject, ReturnValue) == 0x000080, "Member 'WBP_IngameMenuConstruction_Radial_C_IsExistsMaterialForBuildObject::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_IsExistsMaterialForBuildObject, CallFunc_GetPalmi_ReturnValue) == 0x000088, "Member 'WBP_IngameMenuConstruction_Radial_C_IsExistsMaterialForBuildObject::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_IsExistsMaterialForBuildObject, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'WBP_IngameMenuConstruction_Radial_C_IsExistsMaterialForBuildObject::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_IsExistsMaterialForBuildObject, CallFunc_IsValid_ReturnValue_1) == 0x000091, "Member 'WBP_IngameMenuConstruction_Radial_C_IsExistsMaterialForBuildObject::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_IsExistsMaterialForBuildObject, CallFunc_IsExistsMaterialForBuildObject_ReturnValue) == 0x000092, "Member 'WBP_IngameMenuConstruction_Radial_C_IsExistsMaterialForBuildObject::CallFunc_IsExistsMaterialForBuildObject_ReturnValue' has a wrong offset!");

// Function WBP_IngameMenuConstruction_Radial.WBP_IngameMenuConstruction_Radial_C.On Current Page Changed
// 0x0160 (0x0160 - 0x0000)
struct WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed final
{
public:
	EPalBuildObjectTypeA                          BuildObjectTypeA;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5945[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Tab;                                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPalBuildObjectDataSetTypeB>    Temp;                                              // 0x0008(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5946[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5947[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPalRadialCatalog                      CallFunc_Map_Find_Value;                           // 0x0030(0x0050)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5948[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Find_Value_1;                         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5949[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPalBuildObjectDataSetTypeB            CallFunc_Array_Get_Item;                           // 0x0090(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_594A[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPalBuildObjectData                    CallFunc_Array_Get_Item_1;                         // 0x00B0(0x0080)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_594B[0x3];                                     // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_594C[0x3];                                     // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_594D[0x3];                                     // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPalBuildObjectDataSetTypeB>    CallFunc_GetBuildObjectDataArrayForTypeAByTypeB_OutArray; // 0x0150(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed) == 0x000008, "Wrong alignment on WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed");
static_assert(sizeof(WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed) == 0x000160, "Wrong size on WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed, BuildObjectTypeA) == 0x000000, "Member 'WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed::BuildObjectTypeA' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed, Tab) == 0x000004, "Member 'WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed::Tab' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed, Temp) == 0x000008, "Member 'WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed::Temp' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed, Temp_bool_True_if_break_was_hit_Variable) == 0x000024, "Member 'WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed, Temp_int_Array_Index_Variable_1) == 0x000028, "Member 'WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed, CallFunc_Not_PreBool_ReturnValue) == 0x00002C, "Member 'WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed, CallFunc_Map_Find_Value) == 0x000030, "Member 'WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed, CallFunc_Map_Find_ReturnValue) == 0x000080, "Member 'WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed, CallFunc_Map_Find_Value_1) == 0x000084, "Member 'WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed, CallFunc_Map_Find_ReturnValue_1) == 0x000088, "Member 'WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed, CallFunc_Array_Get_Item) == 0x000090, "Member 'WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed, CallFunc_Less_IntInt_ReturnValue) == 0x0000AC, "Member 'WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed, CallFunc_Array_Get_Item_1) == 0x0000B0, "Member 'WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed, CallFunc_BooleanAND_ReturnValue) == 0x000130, "Member 'WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed, CallFunc_Divide_IntInt_ReturnValue) == 0x000134, "Member 'WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed, CallFunc_Array_Length_ReturnValue_1) == 0x000138, "Member 'WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00013C, "Member 'WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed, Temp_int_Loop_Counter_Variable_1) == 0x000140, "Member 'WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed, CallFunc_Less_IntInt_ReturnValue_1) == 0x000144, "Member 'WBP_IngameMenuConstruction_Radial_C_On_Current_Page_Changed::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
