#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IngameProgress

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_IngameProgress.WBP_IngameProgress_C.Change Non Worker Mode
// 0x0009 (0x0009 - 0x0000)
struct WBP_IngameProgress_C_Change_Non_Worker_Mode final
{
public:
	bool                                          IsNonWorker;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameProgress_C_Change_Non_Worker_Mode) == 0x000001, "Wrong alignment on WBP_IngameProgress_C_Change_Non_Worker_Mode");
static_assert(sizeof(WBP_IngameProgress_C_Change_Non_Worker_Mode) == 0x000009, "Wrong size on WBP_IngameProgress_C_Change_Non_Worker_Mode");
static_assert(offsetof(WBP_IngameProgress_C_Change_Non_Worker_Mode, IsNonWorker) == 0x000000, "Member 'WBP_IngameProgress_C_Change_Non_Worker_Mode::IsNonWorker' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Change_Non_Worker_Mode, Temp_bool_Variable) == 0x000001, "Member 'WBP_IngameProgress_C_Change_Non_Worker_Mode::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Change_Non_Worker_Mode, Temp_byte_Variable) == 0x000002, "Member 'WBP_IngameProgress_C_Change_Non_Worker_Mode::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Change_Non_Worker_Mode, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_IngameProgress_C_Change_Non_Worker_Mode::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Change_Non_Worker_Mode, Temp_bool_Variable_1) == 0x000004, "Member 'WBP_IngameProgress_C_Change_Non_Worker_Mode::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Change_Non_Worker_Mode, K2Node_Select_Default) == 0x000005, "Member 'WBP_IngameProgress_C_Change_Non_Worker_Mode::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Change_Non_Worker_Mode, Temp_byte_Variable_2) == 0x000006, "Member 'WBP_IngameProgress_C_Change_Non_Worker_Mode::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Change_Non_Worker_Mode, Temp_byte_Variable_3) == 0x000007, "Member 'WBP_IngameProgress_C_Change_Non_Worker_Mode::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Change_Non_Worker_Mode, K2Node_Select_Default_1) == 0x000008, "Member 'WBP_IngameProgress_C_Change_Non_Worker_Mode::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_IngameProgress.WBP_IngameProgress_C.ExecuteUbergraph_WBP_IngameProgress
// 0x0030 (0x0030 - 0x0000)
struct WBP_IngameProgress_C_ExecuteUbergraph_WBP_IngameProgress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55E6[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_PalCraftInfo_Pal_C*>        K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_IngameProgress_C_ExecuteUbergraph_WBP_IngameProgress) == 0x000008, "Wrong alignment on WBP_IngameProgress_C_ExecuteUbergraph_WBP_IngameProgress");
static_assert(sizeof(WBP_IngameProgress_C_ExecuteUbergraph_WBP_IngameProgress) == 0x000030, "Wrong size on WBP_IngameProgress_C_ExecuteUbergraph_WBP_IngameProgress");
static_assert(offsetof(WBP_IngameProgress_C_ExecuteUbergraph_WBP_IngameProgress, EntryPoint) == 0x000000, "Member 'WBP_IngameProgress_C_ExecuteUbergraph_WBP_IngameProgress::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_ExecuteUbergraph_WBP_IngameProgress, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_IngameProgress_C_ExecuteUbergraph_WBP_IngameProgress::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_ExecuteUbergraph_WBP_IngameProgress, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_IngameProgress_C_ExecuteUbergraph_WBP_IngameProgress::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_ExecuteUbergraph_WBP_IngameProgress, CallFunc_PlayAnimation_ReturnValue_2) == 0x000018, "Member 'WBP_IngameProgress_C_ExecuteUbergraph_WBP_IngameProgress::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_ExecuteUbergraph_WBP_IngameProgress, K2Node_MakeArray_Array) == 0x000020, "Member 'WBP_IngameProgress_C_ExecuteUbergraph_WBP_IngameProgress::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_IngameProgress.WBP_IngameProgress_C.Set Second
// 0x02A8 (0x02A8 - 0x0000)
struct WBP_IngameProgress_C_Set_Second final
{
public:
	int32                                         RemainingSecond;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55E7[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55E8[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_1;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_2;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55E9[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0040(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_2;             // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_3;             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0080(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x0098(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_3;              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_4;              // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_4;             // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55EA[0x3];                                     // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55EB[0x4];                                     // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55EC[0x3];                                     // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55ED[0x4];                                     // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue_1;               // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55EE[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55EF[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0138(0x0018)()
	class FString                                 CallFunc_SelectString_ReturnValue_2;               // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55F0[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue_1;                    // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue_3;               // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0188(0x0018)()
	class FString                                 CallFunc_Replace_ReturnValue_2;                    // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x01B0(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55F1[0x7];                                     // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_4;             // 0x01D0(0x0018)()
	class FString                                 CallFunc_SelectString_ReturnValue_4;               // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_4;          // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_3;                    // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_4;                    // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0228(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0240(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_5;             // 0x0258(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_5;          // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_5;                    // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_5;          // 0x0290(0x0018)()
};
static_assert(alignof(WBP_IngameProgress_C_Set_Second) == 0x000008, "Wrong alignment on WBP_IngameProgress_C_Set_Second");
static_assert(sizeof(WBP_IngameProgress_C_Set_Second) == 0x0002A8, "Wrong size on WBP_IngameProgress_C_Set_Second");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, RemainingSecond) == 0x000000, "Member 'WBP_IngameProgress_C_Set_Second::RemainingSecond' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Less_IntInt_ReturnValue) == 0x000004, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_SelectInt_ReturnValue) == 0x000008, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Percent_IntInt_ReturnValue) == 0x000010, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Percent_IntInt_ReturnValue_1) == 0x000014, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Divide_IntInt_ReturnValue) == 0x000018, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Divide_IntInt_ReturnValue_1) == 0x00001C, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Divide_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Divide_IntInt_ReturnValue_2) == 0x000020, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Divide_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Conv_IntToText_ReturnValue) == 0x000028, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000040, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Conv_TextToString_ReturnValue) == 0x000058, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000068, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Percent_IntInt_ReturnValue_2) == 0x000078, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Percent_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Percent_IntInt_ReturnValue_3) == 0x00007C, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Percent_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000080, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Conv_IntToText_ReturnValue_3) == 0x000098, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Conv_IntToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Conv_TextToString_ReturnValue_2) == 0x0000B0, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Conv_TextToString_ReturnValue_3) == 0x0000C0, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Divide_IntInt_ReturnValue_3) == 0x0000D0, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Divide_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Divide_IntInt_ReturnValue_4) == 0x0000D4, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Divide_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Percent_IntInt_ReturnValue_4) == 0x0000D8, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Percent_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000DC, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Add_IntInt_ReturnValue) == 0x0000E0, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_SelectString_ReturnValue) == 0x0000E8, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000F8, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000FC, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Add_IntInt_ReturnValue_2) == 0x000100, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_SelectString_ReturnValue_1) == 0x000108, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_SelectString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Add_IntInt_ReturnValue_3) == 0x000118, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Replace_ReturnValue) == 0x000120, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000130, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Conv_StringToText_ReturnValue) == 0x000138, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_SelectString_ReturnValue_2) == 0x000150, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_SelectString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x000160, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Replace_ReturnValue_1) == 0x000168, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Replace_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_SelectString_ReturnValue_3) == 0x000178, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_SelectString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000188, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Replace_ReturnValue_2) == 0x0001A0, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Replace_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0001B0, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_EqualEqual_IntInt_ReturnValue_4) == 0x0001C8, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_EqualEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Conv_IntToText_ReturnValue_4) == 0x0001D0, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Conv_IntToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_SelectString_ReturnValue_4) == 0x0001E8, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_SelectString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Conv_TextToString_ReturnValue_4) == 0x0001F8, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Conv_TextToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Replace_ReturnValue_3) == 0x000208, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Replace_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Replace_ReturnValue_4) == 0x000218, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Replace_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000228, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Conv_StringToText_ReturnValue_4) == 0x000240, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Conv_IntToText_ReturnValue_5) == 0x000258, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Conv_IntToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Conv_TextToString_ReturnValue_5) == 0x000270, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Conv_TextToString_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Replace_ReturnValue_5) == 0x000280, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Replace_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Second, CallFunc_Conv_StringToText_ReturnValue_5) == 0x000290, "Member 'WBP_IngameProgress_C_Set_Second::CallFunc_Conv_StringToText_ReturnValue_5' has a wrong offset!");

// Function WBP_IngameProgress.WBP_IngameProgress_C.Set Visible Number
// 0x0001 (0x0001 - 0x0000)
struct WBP_IngameProgress_C_Set_Visible_Number final
{
public:
	ESlateVisibility                              NewVisibility;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameProgress_C_Set_Visible_Number) == 0x000001, "Wrong alignment on WBP_IngameProgress_C_Set_Visible_Number");
static_assert(sizeof(WBP_IngameProgress_C_Set_Visible_Number) == 0x000001, "Wrong size on WBP_IngameProgress_C_Set_Visible_Number");
static_assert(offsetof(WBP_IngameProgress_C_Set_Visible_Number, NewVisibility) == 0x000000, "Member 'WBP_IngameProgress_C_Set_Visible_Number::NewVisibility' has a wrong offset!");

// Function WBP_IngameProgress.WBP_IngameProgress_C.Set Work Amount
// 0x0038 (0x0038 - 0x0000)
struct WBP_IngameProgress_C_Set_Work_Amount final
{
public:
	double                                        WorkAmount;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_WorkAmountToManMonth_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55F2[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0010(0x0018)()
	float                                         CallFunc_WorkAmountToManMonth_WorkAmount_ImplicitCast; // 0x0028(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55F3[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameProgress_C_Set_Work_Amount) == 0x000008, "Wrong alignment on WBP_IngameProgress_C_Set_Work_Amount");
static_assert(sizeof(WBP_IngameProgress_C_Set_Work_Amount) == 0x000038, "Wrong size on WBP_IngameProgress_C_Set_Work_Amount");
static_assert(offsetof(WBP_IngameProgress_C_Set_Work_Amount, WorkAmount) == 0x000000, "Member 'WBP_IngameProgress_C_Set_Work_Amount::WorkAmount' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Work_Amount, CallFunc_WorkAmountToManMonth_ReturnValue) == 0x000008, "Member 'WBP_IngameProgress_C_Set_Work_Amount::CallFunc_WorkAmountToManMonth_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Work_Amount, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000010, "Member 'WBP_IngameProgress_C_Set_Work_Amount::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Work_Amount, CallFunc_WorkAmountToManMonth_WorkAmount_ImplicitCast) == 0x000028, "Member 'WBP_IngameProgress_C_Set_Work_Amount::CallFunc_WorkAmountToManMonth_WorkAmount_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_Set_Work_Amount, CallFunc_Conv_DoubleToText_Value_ImplicitCast) == 0x000030, "Member 'WBP_IngameProgress_C_Set_Work_Amount::CallFunc_Conv_DoubleToText_Value_ImplicitCast' has a wrong offset!");

// Function WBP_IngameProgress.WBP_IngameProgress_C.SetWorkerPal
// 0x0068 (0x0068 - 0x0000)
struct WBP_IngameProgress_C_SetWorkerPal final
{
public:
	TArray<class UPalIndividualCharacterSlot*>    Slots;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55F4[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_PalCraftInfo_Pal_C*                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterSlot*            CallFunc_Array_Get_Item_1;                         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55F5[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PalCraftInfo_Pal_C*                CallFunc_Array_Get_Item_2;                         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55F6[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameProgress_C_SetWorkerPal) == 0x000008, "Wrong alignment on WBP_IngameProgress_C_SetWorkerPal");
static_assert(sizeof(WBP_IngameProgress_C_SetWorkerPal) == 0x000068, "Wrong size on WBP_IngameProgress_C_SetWorkerPal");
static_assert(offsetof(WBP_IngameProgress_C_SetWorkerPal, Slots) == 0x000000, "Member 'WBP_IngameProgress_C_SetWorkerPal::Slots' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_SetWorkerPal, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_IngameProgress_C_SetWorkerPal::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameProgress_C_SetWorkerPal, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_IngameProgress_C_SetWorkerPal::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
