#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ConvertItemMenuScrollListBlock

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_ConvertItemMenuScrollListBlock.WBP_ConvertItemMenuScrollListBlock_C.AddRecipeList
// 0x0040 (0x0040 - 0x0000)
struct WBP_ConvertItemMenuScrollListBlock_C_AddRecipeList final
{
public:
	TArray<class FName>                           RecipeIDArray;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5760[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PalConvertItemMenu_RecipeSlotButton_C* CallFunc_CreateRecipeIconWidget_createdWidget;     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5761[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWrapBoxSlot*                           CallFunc_AddChildToWrapBox_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConvertItemMenuScrollListBlock_C_AddRecipeList) == 0x000008, "Wrong alignment on WBP_ConvertItemMenuScrollListBlock_C_AddRecipeList");
static_assert(sizeof(WBP_ConvertItemMenuScrollListBlock_C_AddRecipeList) == 0x000040, "Wrong size on WBP_ConvertItemMenuScrollListBlock_C_AddRecipeList");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_AddRecipeList, RecipeIDArray) == 0x000000, "Member 'WBP_ConvertItemMenuScrollListBlock_C_AddRecipeList::RecipeIDArray' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_AddRecipeList, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_ConvertItemMenuScrollListBlock_C_AddRecipeList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_AddRecipeList, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WBP_ConvertItemMenuScrollListBlock_C_AddRecipeList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_AddRecipeList, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'WBP_ConvertItemMenuScrollListBlock_C_AddRecipeList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_AddRecipeList, CallFunc_Array_Get_Item) == 0x00001C, "Member 'WBP_ConvertItemMenuScrollListBlock_C_AddRecipeList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_AddRecipeList, CallFunc_CreateRecipeIconWidget_createdWidget) == 0x000028, "Member 'WBP_ConvertItemMenuScrollListBlock_C_AddRecipeList::CallFunc_CreateRecipeIconWidget_createdWidget' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_AddRecipeList, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_ConvertItemMenuScrollListBlock_C_AddRecipeList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_AddRecipeList, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'WBP_ConvertItemMenuScrollListBlock_C_AddRecipeList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_AddRecipeList, CallFunc_AddChildToWrapBox_ReturnValue) == 0x000038, "Member 'WBP_ConvertItemMenuScrollListBlock_C_AddRecipeList::CallFunc_AddChildToWrapBox_ReturnValue' has a wrong offset!");

// Function WBP_ConvertItemMenuScrollListBlock.WBP_ConvertItemMenuScrollListBlock_C.CreateRecipeIconWidget
// 0x0050 (0x0050 - 0x0000)
struct WBP_ConvertItemMenuScrollListBlock_C_CreateRecipeIconWidget final
{
public:
	class FName                                   RecipeID;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_PalConvertItemMenu_RecipeSlotButton_C* CreatedWidget;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_PalConvertItemMenu_RecipeSlotButton_C* SelfWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_PalConvertItemMenu_RecipeSlotButton_C* SelfWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_PalConvertItemMenu_RecipeSlotButton_C* SelfWidget)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_PalConvertItemMenu_RecipeSlotButton_C* CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConvertItemMenuScrollListBlock_C_CreateRecipeIconWidget) == 0x000008, "Wrong alignment on WBP_ConvertItemMenuScrollListBlock_C_CreateRecipeIconWidget");
static_assert(sizeof(WBP_ConvertItemMenuScrollListBlock_C_CreateRecipeIconWidget) == 0x000050, "Wrong size on WBP_ConvertItemMenuScrollListBlock_C_CreateRecipeIconWidget");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_CreateRecipeIconWidget, RecipeID) == 0x000000, "Member 'WBP_ConvertItemMenuScrollListBlock_C_CreateRecipeIconWidget::RecipeID' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_CreateRecipeIconWidget, CreatedWidget) == 0x000008, "Member 'WBP_ConvertItemMenuScrollListBlock_C_CreateRecipeIconWidget::CreatedWidget' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_CreateRecipeIconWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_ConvertItemMenuScrollListBlock_C_CreateRecipeIconWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_CreateRecipeIconWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'WBP_ConvertItemMenuScrollListBlock_C_CreateRecipeIconWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_CreateRecipeIconWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x000030, "Member 'WBP_ConvertItemMenuScrollListBlock_C_CreateRecipeIconWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_CreateRecipeIconWidget, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000040, "Member 'WBP_ConvertItemMenuScrollListBlock_C_CreateRecipeIconWidget::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_CreateRecipeIconWidget, CallFunc_Create_ReturnValue) == 0x000048, "Member 'WBP_ConvertItemMenuScrollListBlock_C_CreateRecipeIconWidget::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WBP_ConvertItemMenuScrollListBlock.WBP_ConvertItemMenuScrollListBlock_C.FocusTopContent
// 0x0018 (0x0018 - 0x0000)
struct WBP_ConvertItemMenuScrollListBlock_C_FocusTopContent final
{
public:
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PalConvertItemMenu_RecipeSlotButton_C* K2Node_DynamicCast_AsWBP_Pal_Convert_Item_Menu_Recipe_Slot_Button; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConvertItemMenuScrollListBlock_C_FocusTopContent) == 0x000008, "Wrong alignment on WBP_ConvertItemMenuScrollListBlock_C_FocusTopContent");
static_assert(sizeof(WBP_ConvertItemMenuScrollListBlock_C_FocusTopContent) == 0x000018, "Wrong size on WBP_ConvertItemMenuScrollListBlock_C_FocusTopContent");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_FocusTopContent, CallFunc_GetChildAt_ReturnValue) == 0x000000, "Member 'WBP_ConvertItemMenuScrollListBlock_C_FocusTopContent::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_FocusTopContent, K2Node_DynamicCast_AsWBP_Pal_Convert_Item_Menu_Recipe_Slot_Button) == 0x000008, "Member 'WBP_ConvertItemMenuScrollListBlock_C_FocusTopContent::K2Node_DynamicCast_AsWBP_Pal_Convert_Item_Menu_Recipe_Slot_Button' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_FocusTopContent, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_ConvertItemMenuScrollListBlock_C_FocusTopContent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_FocusTopContent, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'WBP_ConvertItemMenuScrollListBlock_C_FocusTopContent::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_ConvertItemMenuScrollListBlock.WBP_ConvertItemMenuScrollListBlock_C.GetFocusTarget
// 0x0020 (0x0020 - 0x0000)
struct WBP_ConvertItemMenuScrollListBlock_C_GetFocusTarget final
{
public:
	class UWidget*                                Target;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PalConvertItemMenu_RecipeSlotButton_C* K2Node_DynamicCast_AsWBP_Pal_Convert_Item_Menu_Recipe_Slot_Button; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConvertItemMenuScrollListBlock_C_GetFocusTarget) == 0x000008, "Wrong alignment on WBP_ConvertItemMenuScrollListBlock_C_GetFocusTarget");
static_assert(sizeof(WBP_ConvertItemMenuScrollListBlock_C_GetFocusTarget) == 0x000020, "Wrong size on WBP_ConvertItemMenuScrollListBlock_C_GetFocusTarget");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_GetFocusTarget, Target) == 0x000000, "Member 'WBP_ConvertItemMenuScrollListBlock_C_GetFocusTarget::Target' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_GetFocusTarget, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'WBP_ConvertItemMenuScrollListBlock_C_GetFocusTarget::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_GetFocusTarget, K2Node_DynamicCast_AsWBP_Pal_Convert_Item_Menu_Recipe_Slot_Button) == 0x000010, "Member 'WBP_ConvertItemMenuScrollListBlock_C_GetFocusTarget::K2Node_DynamicCast_AsWBP_Pal_Convert_Item_Menu_Recipe_Slot_Button' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_GetFocusTarget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_ConvertItemMenuScrollListBlock_C_GetFocusTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_GetFocusTarget, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'WBP_ConvertItemMenuScrollListBlock_C_GetFocusTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_ConvertItemMenuScrollListBlock.WBP_ConvertItemMenuScrollListBlock_C.OnClicked_Internal
// 0x0008 (0x0008 - 0x0000)
struct WBP_ConvertItemMenuScrollListBlock_C_OnClicked_Internal final
{
public:
	class UWBP_PalConvertItemMenu_RecipeSlotButton_C* Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConvertItemMenuScrollListBlock_C_OnClicked_Internal) == 0x000008, "Wrong alignment on WBP_ConvertItemMenuScrollListBlock_C_OnClicked_Internal");
static_assert(sizeof(WBP_ConvertItemMenuScrollListBlock_C_OnClicked_Internal) == 0x000008, "Wrong size on WBP_ConvertItemMenuScrollListBlock_C_OnClicked_Internal");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_OnClicked_Internal, Widget) == 0x000000, "Member 'WBP_ConvertItemMenuScrollListBlock_C_OnClicked_Internal::Widget' has a wrong offset!");

// Function WBP_ConvertItemMenuScrollListBlock.WBP_ConvertItemMenuScrollListBlock_C.OnClickedAnyContent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ConvertItemMenuScrollListBlock_C_OnClickedAnyContent__DelegateSignature final
{
public:
	class UWBP_PalConvertItemMenu_RecipeSlotButton_C* Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConvertItemMenuScrollListBlock_C_OnClickedAnyContent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ConvertItemMenuScrollListBlock_C_OnClickedAnyContent__DelegateSignature");
static_assert(sizeof(WBP_ConvertItemMenuScrollListBlock_C_OnClickedAnyContent__DelegateSignature) == 0x000008, "Wrong size on WBP_ConvertItemMenuScrollListBlock_C_OnClickedAnyContent__DelegateSignature");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_OnClickedAnyContent__DelegateSignature, Widget) == 0x000000, "Member 'WBP_ConvertItemMenuScrollListBlock_C_OnClickedAnyContent__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_ConvertItemMenuScrollListBlock.WBP_ConvertItemMenuScrollListBlock_C.OnHovered_Internal
// 0x0008 (0x0008 - 0x0000)
struct WBP_ConvertItemMenuScrollListBlock_C_OnHovered_Internal final
{
public:
	class UWBP_PalConvertItemMenu_RecipeSlotButton_C* SelfWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConvertItemMenuScrollListBlock_C_OnHovered_Internal) == 0x000008, "Wrong alignment on WBP_ConvertItemMenuScrollListBlock_C_OnHovered_Internal");
static_assert(sizeof(WBP_ConvertItemMenuScrollListBlock_C_OnHovered_Internal) == 0x000008, "Wrong size on WBP_ConvertItemMenuScrollListBlock_C_OnHovered_Internal");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_OnHovered_Internal, SelfWidget) == 0x000000, "Member 'WBP_ConvertItemMenuScrollListBlock_C_OnHovered_Internal::SelfWidget' has a wrong offset!");

// Function WBP_ConvertItemMenuScrollListBlock.WBP_ConvertItemMenuScrollListBlock_C.OnHoveredAnyContent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ConvertItemMenuScrollListBlock_C_OnHoveredAnyContent__DelegateSignature final
{
public:
	class UWBP_PalConvertItemMenu_RecipeSlotButton_C* Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConvertItemMenuScrollListBlock_C_OnHoveredAnyContent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ConvertItemMenuScrollListBlock_C_OnHoveredAnyContent__DelegateSignature");
static_assert(sizeof(WBP_ConvertItemMenuScrollListBlock_C_OnHoveredAnyContent__DelegateSignature) == 0x000008, "Wrong size on WBP_ConvertItemMenuScrollListBlock_C_OnHoveredAnyContent__DelegateSignature");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_OnHoveredAnyContent__DelegateSignature, Widget) == 0x000000, "Member 'WBP_ConvertItemMenuScrollListBlock_C_OnHoveredAnyContent__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_ConvertItemMenuScrollListBlock.WBP_ConvertItemMenuScrollListBlock_C.OnUnhovered_Internal
// 0x0008 (0x0008 - 0x0000)
struct WBP_ConvertItemMenuScrollListBlock_C_OnUnhovered_Internal final
{
public:
	class UWBP_PalConvertItemMenu_RecipeSlotButton_C* SelftWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConvertItemMenuScrollListBlock_C_OnUnhovered_Internal) == 0x000008, "Wrong alignment on WBP_ConvertItemMenuScrollListBlock_C_OnUnhovered_Internal");
static_assert(sizeof(WBP_ConvertItemMenuScrollListBlock_C_OnUnhovered_Internal) == 0x000008, "Wrong size on WBP_ConvertItemMenuScrollListBlock_C_OnUnhovered_Internal");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_OnUnhovered_Internal, SelftWidget) == 0x000000, "Member 'WBP_ConvertItemMenuScrollListBlock_C_OnUnhovered_Internal::SelftWidget' has a wrong offset!");

// Function WBP_ConvertItemMenuScrollListBlock.WBP_ConvertItemMenuScrollListBlock_C.OnUnhoveredAnyContent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ConvertItemMenuScrollListBlock_C_OnUnhoveredAnyContent__DelegateSignature final
{
public:
	class UWBP_PalConvertItemMenu_RecipeSlotButton_C* Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConvertItemMenuScrollListBlock_C_OnUnhoveredAnyContent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ConvertItemMenuScrollListBlock_C_OnUnhoveredAnyContent__DelegateSignature");
static_assert(sizeof(WBP_ConvertItemMenuScrollListBlock_C_OnUnhoveredAnyContent__DelegateSignature) == 0x000008, "Wrong size on WBP_ConvertItemMenuScrollListBlock_C_OnUnhoveredAnyContent__DelegateSignature");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_OnUnhoveredAnyContent__DelegateSignature, Widget) == 0x000000, "Member 'WBP_ConvertItemMenuScrollListBlock_C_OnUnhoveredAnyContent__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_ConvertItemMenuScrollListBlock.WBP_ConvertItemMenuScrollListBlock_C.SetCategoryName
// 0x0018 (0x0018 - 0x0000)
struct WBP_ConvertItemMenuScrollListBlock_C_SetCategoryName final
{
public:
	class FText                                   CategoryNameText;                                  // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ConvertItemMenuScrollListBlock_C_SetCategoryName) == 0x000008, "Wrong alignment on WBP_ConvertItemMenuScrollListBlock_C_SetCategoryName");
static_assert(sizeof(WBP_ConvertItemMenuScrollListBlock_C_SetCategoryName) == 0x000018, "Wrong size on WBP_ConvertItemMenuScrollListBlock_C_SetCategoryName");
static_assert(offsetof(WBP_ConvertItemMenuScrollListBlock_C_SetCategoryName, CategoryNameText) == 0x000000, "Member 'WBP_ConvertItemMenuScrollListBlock_C_SetCategoryName::CategoryNameText' has a wrong offset!");

}

