#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IngameMenu_Chest_LockPass

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Pal_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_IngameMenu_Chest_LockPass.WBP_IngameMenu_Chest_LockPass_C.ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass
// 0x0180 (0x0180 - 0x0000)
struct WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AE5[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AE6[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDDispatchParameterBase*           CallFunc_GetParam_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalHUDDispatchParameter_Authentication* K2Node_DynamicCast_AsPal_HUDDispatch_Parameter_Authentication; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AE7[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalMapObjectPasswordLockModule*        CallFunc_GetPasswordLockModule_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_IngameMenu_Chest_LockNum_C*> K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_IngameMenu_Chest_LockNum_C*        CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ClickedNum;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 ClickedNum)>             K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_IngameMenu_Chest_LockNumInput_C*> K2Node_MakeArray_Array_1;                          // 0x0078(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AE8[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetInputNumberStr_ReturnValue;            // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AE9[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text;          // 0x00B8(0x0018)()
	class UWBP_IngameMenu_Chest_LockNumInput_C*   CallFunc_Array_Get_Item_1;                         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue;        // 0x00E8(0x0004)(NoDestructor)
	TDelegate<void(bool Passed)>                  K2Node_CreateDelegate_OutputDelegate_2;            // 0x00EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Passed;                         // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AEA[0x3];                                     // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_Select_Default;                             // 0x0100(0x0010)(NoDestructor)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_1;        // 0x0110(0x0018)()
	class UWidgetAnimation*                       K2Node_Select_Default_1;                           // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AEB[0x4];                                     // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_IngameMenu_Chest_LockNumInput_C*   CallFunc_Array_Get_Item_2;                         // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AEC[0x3];                                     // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AED[0x3];                                     // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_GetLocalPlayerUID_ReturnValue;            // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanTryAuthenticateByPlayer_ReturnValue;   // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AEE[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_IngameMenu_Chest_LockNumInput_C*   CallFunc_Array_Get_Item_3;                         // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass) == 0x000008, "Wrong alignment on WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass");
static_assert(sizeof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass) == 0x000180, "Wrong size on WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, EntryPoint) == 0x000000, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, Temp_bool_Variable) == 0x000004, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, Temp_int_Array_Index_Variable_2) == 0x000020, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, Temp_bool_Variable_1) == 0x000024, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, CallFunc_GetParam_ReturnValue) == 0x000028, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::CallFunc_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, K2Node_DynamicCast_AsPal_HUDDispatch_Parameter_Authentication) == 0x000030, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::K2Node_DynamicCast_AsPal_HUDDispatch_Parameter_Authentication' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, CallFunc_GetPasswordLockModule_ReturnValue) == 0x000040, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::CallFunc_GetPasswordLockModule_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, K2Node_MakeArray_Array) == 0x000048, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, CallFunc_Array_Get_Item) == 0x000058, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, K2Node_CustomEvent_ClickedNum) == 0x000064, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::K2Node_CustomEvent_ClickedNum' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, K2Node_MakeArray_Array_1) == 0x000078, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, CallFunc_Array_Length_ReturnValue_1) == 0x000088, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, CallFunc_Less_IntInt_ReturnValue) == 0x00008C, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, CallFunc_GetInputNumberStr_ReturnValue) == 0x000090, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::CallFunc_GetInputNumberStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, CallFunc_Array_Length_ReturnValue_2) == 0x0000A0, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, CallFunc_Array_Add_ReturnValue) == 0x0000A4, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000A8, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, CallFunc_PlayAnimation_ReturnValue) == 0x0000B0, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, CallFunc_GetLocalizedTextFromHandle_Text) == 0x0000B8, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::CallFunc_GetLocalizedTextFromHandle_Text' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, CallFunc_Array_Get_Item_1) == 0x0000D0, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000D8, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, CallFunc_RegisterActionBinding_ReturnValue) == 0x0000E8, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::CallFunc_RegisterActionBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000EC, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, K2Node_CustomEvent_Passed) == 0x0000FC, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::K2Node_CustomEvent_Passed' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, K2Node_Select_Default) == 0x000100, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, CallFunc_GetLocalizedTextFromHandle_Text_1) == 0x000110, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::CallFunc_GetLocalizedTextFromHandle_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, K2Node_Select_Default_1) == 0x000128, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, CallFunc_PlayAnimation_ReturnValue_1) == 0x000130, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, Temp_int_Loop_Counter_Variable_2) == 0x000138, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, CallFunc_Array_Get_Item_2) == 0x000140, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, CallFunc_Less_IntInt_ReturnValue_1) == 0x000148, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, CallFunc_Add_IntInt_ReturnValue_2) == 0x00014C, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, CallFunc_Array_Length_ReturnValue_3) == 0x000150, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, CallFunc_Less_IntInt_ReturnValue_2) == 0x000154, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, CallFunc_GetLocalPlayerUID_ReturnValue) == 0x000158, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::CallFunc_GetLocalPlayerUID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, CallFunc_CanTryAuthenticateByPlayer_ReturnValue) == 0x000168, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::CallFunc_CanTryAuthenticateByPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, CallFunc_Array_Get_Item_3) == 0x000170, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, CallFunc_Array_Length_ReturnValue_4) == 0x000178, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass, CallFunc_Less_IntInt_ReturnValue_3) == 0x00017C, "Member 'WBP_IngameMenu_Chest_LockPass_C_ExecuteUbergraph_WBP_IngameMenu_Chest_LockPass::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");

// Function WBP_IngameMenu_Chest_LockPass.WBP_IngameMenu_Chest_LockPass_C.GetInputNumberStr
// 0x0058 (0x0058 - 0x0000)
struct WBP_IngameMenu_Chest_LockPass_C_GetInputNumberStr final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 PasswordStr;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AEF[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_Chest_LockPass_C_GetInputNumberStr) == 0x000008, "Wrong alignment on WBP_IngameMenu_Chest_LockPass_C_GetInputNumberStr");
static_assert(sizeof(WBP_IngameMenu_Chest_LockPass_C_GetInputNumberStr) == 0x000058, "Wrong size on WBP_IngameMenu_Chest_LockPass_C_GetInputNumberStr");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_GetInputNumberStr, ReturnValue) == 0x000000, "Member 'WBP_IngameMenu_Chest_LockPass_C_GetInputNumberStr::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_GetInputNumberStr, PasswordStr) == 0x000010, "Member 'WBP_IngameMenu_Chest_LockPass_C_GetInputNumberStr::PasswordStr' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_GetInputNumberStr, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_IngameMenu_Chest_LockPass_C_GetInputNumberStr::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_GetInputNumberStr, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WBP_IngameMenu_Chest_LockPass_C_GetInputNumberStr::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_GetInputNumberStr, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_IngameMenu_Chest_LockPass_C_GetInputNumberStr::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_GetInputNumberStr, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'WBP_IngameMenu_Chest_LockPass_C_GetInputNumberStr::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_GetInputNumberStr, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_IngameMenu_Chest_LockPass_C_GetInputNumberStr::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_GetInputNumberStr, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'WBP_IngameMenu_Chest_LockPass_C_GetInputNumberStr::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_GetInputNumberStr, CallFunc_Conv_IntToString_ReturnValue) == 0x000038, "Member 'WBP_IngameMenu_Chest_LockPass_C_GetInputNumberStr::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_GetInputNumberStr, CallFunc_Concat_StrStr_ReturnValue) == 0x000048, "Member 'WBP_IngameMenu_Chest_LockPass_C_GetInputNumberStr::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function WBP_IngameMenu_Chest_LockPass.WBP_IngameMenu_Chest_LockPass_C.NotifyAuthenticationResult
// 0x0001 (0x0001 - 0x0000)
struct WBP_IngameMenu_Chest_LockPass_C_NotifyAuthenticationResult final
{
public:
	bool                                          Passed;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_Chest_LockPass_C_NotifyAuthenticationResult) == 0x000001, "Wrong alignment on WBP_IngameMenu_Chest_LockPass_C_NotifyAuthenticationResult");
static_assert(sizeof(WBP_IngameMenu_Chest_LockPass_C_NotifyAuthenticationResult) == 0x000001, "Wrong size on WBP_IngameMenu_Chest_LockPass_C_NotifyAuthenticationResult");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_NotifyAuthenticationResult, Passed) == 0x000000, "Member 'WBP_IngameMenu_Chest_LockPass_C_NotifyAuthenticationResult::Passed' has a wrong offset!");

// Function WBP_IngameMenu_Chest_LockPass.WBP_IngameMenu_Chest_LockPass_C.OnNumpadClicked
// 0x0004 (0x0004 - 0x0000)
struct WBP_IngameMenu_Chest_LockPass_C_OnNumpadClicked final
{
public:
	int32                                         ClickedNum;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_Chest_LockPass_C_OnNumpadClicked) == 0x000004, "Wrong alignment on WBP_IngameMenu_Chest_LockPass_C_OnNumpadClicked");
static_assert(sizeof(WBP_IngameMenu_Chest_LockPass_C_OnNumpadClicked) == 0x000004, "Wrong size on WBP_IngameMenu_Chest_LockPass_C_OnNumpadClicked");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_OnNumpadClicked, ClickedNum) == 0x000000, "Member 'WBP_IngameMenu_Chest_LockPass_C_OnNumpadClicked::ClickedNum' has a wrong offset!");

// Function WBP_IngameMenu_Chest_LockPass.WBP_IngameMenu_Chest_LockPass_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_IngameMenu_Chest_LockPass_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_Chest_LockPass_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_IngameMenu_Chest_LockPass_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_IngameMenu_Chest_LockPass_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_IngameMenu_Chest_LockPass_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_IngameMenu_Chest_LockPass_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_IngameMenu_Chest_LockPass_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

