#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IngameMenuConstruction_ItemSlot

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Pal_structs.hpp"


namespace SDK::Params
{

// Function WBP_IngameMenuConstruction_ItemSlot.WBP_IngameMenuConstruction_ItemSlot_C.PlayAnimCanNotBuild
// 0x0008 (0x0008 - 0x0000)
struct WBP_IngameMenuConstruction_ItemSlot_C_PlayAnimCanNotBuild final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenuConstruction_ItemSlot_C_PlayAnimCanNotBuild) == 0x000008, "Wrong alignment on WBP_IngameMenuConstruction_ItemSlot_C_PlayAnimCanNotBuild");
static_assert(sizeof(WBP_IngameMenuConstruction_ItemSlot_C_PlayAnimCanNotBuild) == 0x000008, "Wrong size on WBP_IngameMenuConstruction_ItemSlot_C_PlayAnimCanNotBuild");
static_assert(offsetof(WBP_IngameMenuConstruction_ItemSlot_C_PlayAnimCanNotBuild, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_IngameMenuConstruction_ItemSlot_C_PlayAnimCanNotBuild::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_IngameMenuConstruction_ItemSlot.WBP_IngameMenuConstruction_ItemSlot_C.PlayAnimToSmall
// 0x0008 (0x0008 - 0x0000)
struct WBP_IngameMenuConstruction_ItemSlot_C_PlayAnimToSmall final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenuConstruction_ItemSlot_C_PlayAnimToSmall) == 0x000008, "Wrong alignment on WBP_IngameMenuConstruction_ItemSlot_C_PlayAnimToSmall");
static_assert(sizeof(WBP_IngameMenuConstruction_ItemSlot_C_PlayAnimToSmall) == 0x000008, "Wrong size on WBP_IngameMenuConstruction_ItemSlot_C_PlayAnimToSmall");
static_assert(offsetof(WBP_IngameMenuConstruction_ItemSlot_C_PlayAnimToSmall, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_IngameMenuConstruction_ItemSlot_C_PlayAnimToSmall::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_IngameMenuConstruction_ItemSlot.WBP_IngameMenuConstruction_ItemSlot_C.SetNewIconVisibility
// 0x0005 (0x0005 - 0x0000)
struct WBP_IngameMenuConstruction_ItemSlot_C_SetNewIconVisibility final
{
public:
	bool                                          Visable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenuConstruction_ItemSlot_C_SetNewIconVisibility) == 0x000001, "Wrong alignment on WBP_IngameMenuConstruction_ItemSlot_C_SetNewIconVisibility");
static_assert(sizeof(WBP_IngameMenuConstruction_ItemSlot_C_SetNewIconVisibility) == 0x000005, "Wrong size on WBP_IngameMenuConstruction_ItemSlot_C_SetNewIconVisibility");
static_assert(offsetof(WBP_IngameMenuConstruction_ItemSlot_C_SetNewIconVisibility, Visable) == 0x000000, "Member 'WBP_IngameMenuConstruction_ItemSlot_C_SetNewIconVisibility::Visable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_ItemSlot_C_SetNewIconVisibility, Temp_bool_Variable) == 0x000001, "Member 'WBP_IngameMenuConstruction_ItemSlot_C_SetNewIconVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_ItemSlot_C_SetNewIconVisibility, Temp_byte_Variable) == 0x000002, "Member 'WBP_IngameMenuConstruction_ItemSlot_C_SetNewIconVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_ItemSlot_C_SetNewIconVisibility, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_IngameMenuConstruction_ItemSlot_C_SetNewIconVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_ItemSlot_C_SetNewIconVisibility, K2Node_Select_Default) == 0x000004, "Member 'WBP_IngameMenuConstruction_ItemSlot_C_SetNewIconVisibility::K2Node_Select_Default' has a wrong offset!");

// Function WBP_IngameMenuConstruction_ItemSlot.WBP_IngameMenuConstruction_ItemSlot_C.Setup
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_IngameMenuConstruction_ItemSlot_C_Setup final
{
public:
	struct FPalBuildObjectData                    Param_BuildObjectData;                             // 0x0000(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UPalMasterDataTableAccess_BuildObjectIconData* CallFunc_GetBuildObjectIconDataTableAccess_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_FindRow_bResult;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_592C[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPalBuildObjectIconData                CallFunc_BP_FindRow_ReturnValue;                   // 0x0090(0x0038)()
	class FText                                   CallFunc_GetMapObjectName_outName;                 // 0x00C8(0x0018)()
};
static_assert(alignof(WBP_IngameMenuConstruction_ItemSlot_C_Setup) == 0x000008, "Wrong alignment on WBP_IngameMenuConstruction_ItemSlot_C_Setup");
static_assert(sizeof(WBP_IngameMenuConstruction_ItemSlot_C_Setup) == 0x0000E0, "Wrong size on WBP_IngameMenuConstruction_ItemSlot_C_Setup");
static_assert(offsetof(WBP_IngameMenuConstruction_ItemSlot_C_Setup, Param_BuildObjectData) == 0x000000, "Member 'WBP_IngameMenuConstruction_ItemSlot_C_Setup::Param_BuildObjectData' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_ItemSlot_C_Setup, CallFunc_GetBuildObjectIconDataTableAccess_ReturnValue) == 0x000080, "Member 'WBP_IngameMenuConstruction_ItemSlot_C_Setup::CallFunc_GetBuildObjectIconDataTableAccess_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_ItemSlot_C_Setup, CallFunc_BP_FindRow_bResult) == 0x000088, "Member 'WBP_IngameMenuConstruction_ItemSlot_C_Setup::CallFunc_BP_FindRow_bResult' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_ItemSlot_C_Setup, CallFunc_BP_FindRow_ReturnValue) == 0x000090, "Member 'WBP_IngameMenuConstruction_ItemSlot_C_Setup::CallFunc_BP_FindRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_ItemSlot_C_Setup, CallFunc_GetMapObjectName_outName) == 0x0000C8, "Member 'WBP_IngameMenuConstruction_ItemSlot_C_Setup::CallFunc_GetMapObjectName_outName' has a wrong offset!");

// Function WBP_IngameMenuConstruction_ItemSlot.WBP_IngameMenuConstruction_ItemSlot_C.GetCanvasSize
// 0x0030 (0x0030 - 0x0000)
struct WBP_IngameMenuConstruction_ItemSlot_C_GetCanvasSize final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_592D[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenuConstruction_ItemSlot_C_GetCanvasSize) == 0x000008, "Wrong alignment on WBP_IngameMenuConstruction_ItemSlot_C_GetCanvasSize");
static_assert(sizeof(WBP_IngameMenuConstruction_ItemSlot_C_GetCanvasSize) == 0x000030, "Wrong size on WBP_IngameMenuConstruction_ItemSlot_C_GetCanvasSize");
static_assert(offsetof(WBP_IngameMenuConstruction_ItemSlot_C_GetCanvasSize, ReturnValue) == 0x000000, "Member 'WBP_IngameMenuConstruction_ItemSlot_C_GetCanvasSize::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_ItemSlot_C_GetCanvasSize, K2Node_DynamicCast_AsCanvas_Panel_Slot) == 0x000010, "Member 'WBP_IngameMenuConstruction_ItemSlot_C_GetCanvasSize::K2Node_DynamicCast_AsCanvas_Panel_Slot' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_ItemSlot_C_GetCanvasSize, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_IngameMenuConstruction_ItemSlot_C_GetCanvasSize::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_ItemSlot_C_GetCanvasSize, CallFunc_GetSize_ReturnValue) == 0x000020, "Member 'WBP_IngameMenuConstruction_ItemSlot_C_GetCanvasSize::CallFunc_GetSize_ReturnValue' has a wrong offset!");

}

