#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PalSkill_KeyGuide

#include "Basic.hpp"

#include "Pal_structs.hpp"


namespace SDK::Params
{

// Function WBP_PalSkill_KeyGuide.WBP_PalSkill_KeyGuide_C.ExecuteUbergraph_WBP_PalSkill_KeyGuide
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_PalSkillEntry_C*>           K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text;          // 0x0018(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D40[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EPalWazaID>                            CallFunc_GetEquipWaza_ReturnValue;                 // 0x0040(0x0010)(ReferenceParm)
	EPalWazaID                                    CallFunc_Array_Get_Item;                           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D41[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetWazaName_outName;                      // 0x0058(0x0018)()
	class UPalActiveSkill*                        CallFunc_Map_Find_Value;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D42[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0088(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D43[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalActiveSkill*                        CallFunc_Map_Find_Value_1;                         // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalPlayerInventoryType                       CallFunc_GetPrimaryInventoryType_ReturnValue;      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D44[0x5];                                     // 0x009B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue_1;                   // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPalPlayerInventoryType                       CallFunc_GetPrimaryInventoryType_ReturnValue_1;    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide) == 0x000008, "Wrong alignment on WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide");
static_assert(sizeof(WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide) == 0x0000B0, "Wrong size on WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide, EntryPoint) == 0x000000, "Member 'WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide, Temp_int_Variable) == 0x000004, "Member 'WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide, K2Node_MakeArray_Array) == 0x000008, "Member 'WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide, CallFunc_GetLocalizedTextFromHandle_Text) == 0x000018, "Member 'WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide::CallFunc_GetLocalizedTextFromHandle_Text' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide, CallFunc_GetEquipWaza_ReturnValue) == 0x000040, "Member 'WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide::CallFunc_GetEquipWaza_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide, CallFunc_Array_Get_Item) == 0x000050, "Member 'WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide, CallFunc_GetWazaName_outName) == 0x000058, "Member 'WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide::CallFunc_GetWazaName_outName' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide, CallFunc_Map_Find_Value) == 0x000070, "Member 'WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide, CallFunc_Map_Find_ReturnValue) == 0x000078, "Member 'WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide, CallFunc_GetPalmi_ReturnValue) == 0x000080, "Member 'WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide, Temp_int_Variable_1) == 0x000088, "Member 'WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide, CallFunc_Map_Find_Value_1) == 0x000090, "Member 'WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide, CallFunc_Map_Find_ReturnValue_1) == 0x000098, "Member 'WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide, CallFunc_GetPrimaryInventoryType_ReturnValue) == 0x000099, "Member 'WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide::CallFunc_GetPrimaryInventoryType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00009A, "Member 'WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide, CallFunc_GetPalmi_ReturnValue_1) == 0x0000A0, "Member 'WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide::CallFunc_GetPalmi_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide, CallFunc_GetPrimaryInventoryType_ReturnValue_1) == 0x0000A8, "Member 'WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide::CallFunc_GetPrimaryInventoryType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000A9, "Member 'WBP_PalSkill_KeyGuide_C_ExecuteUbergraph_WBP_PalSkill_KeyGuide::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function WBP_PalSkill_KeyGuide.WBP_PalSkill_KeyGuide_C.OnGetOff
// 0x0040 (0x0040 - 0x0000)
struct WBP_PalSkill_KeyGuide_C_OnGetOff final
{
public:
	class AActor*                                 RideActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D45[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPalActiveSkill*>                CallFunc_Map_Values_Values;                        // 0x0018(0x0010)(ReferenceParm)
	class UWBP_PalSkillEntry_C*                   CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPalActiveSkill*                        CallFunc_Array_Get_Item_1;                         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalSkill_KeyGuide_C_OnGetOff) == 0x000008, "Wrong alignment on WBP_PalSkill_KeyGuide_C_OnGetOff");
static_assert(sizeof(WBP_PalSkill_KeyGuide_C_OnGetOff) == 0x000040, "Wrong size on WBP_PalSkill_KeyGuide_C_OnGetOff");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnGetOff, RideActor) == 0x000000, "Member 'WBP_PalSkill_KeyGuide_C_OnGetOff::RideActor' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnGetOff, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_PalSkill_KeyGuide_C_OnGetOff::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnGetOff, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_PalSkill_KeyGuide_C_OnGetOff::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnGetOff, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_PalSkill_KeyGuide_C_OnGetOff::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnGetOff, CallFunc_Map_Values_Values) == 0x000018, "Member 'WBP_PalSkill_KeyGuide_C_OnGetOff::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnGetOff, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_PalSkill_KeyGuide_C_OnGetOff::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnGetOff, CallFunc_Array_Get_Item_1) == 0x000030, "Member 'WBP_PalSkill_KeyGuide_C_OnGetOff::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnGetOff, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_PalSkill_KeyGuide_C_OnGetOff::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnGetOff, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_PalSkill_KeyGuide_C_OnGetOff::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_PalSkill_KeyGuide.WBP_PalSkill_KeyGuide_C.OnRide
// 0x01A0 (0x01A0 - 0x0000)
struct WBP_PalSkill_KeyGuide_C_OnRide final
{
public:
	class AActor*                                 RideActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D46[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          K2Node_DynamicCast_AsPal_Character;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D47[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalShooterComponent*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPalCharacterParameterComponent*        CallFunc_GetCharacterParameterComponent_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D48[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalRideMarkerComponent*                CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D49[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalActiveSkillSlot*                    CallFunc_GetActiveSkillSlot_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4A[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, class UPalActiveSkill*>           CallFunc_GetSkillMap_ReturnValue;                  // 0x0058(0x0050)()
	TArray<EPalWazaID>                            CallFunc_GetEquipWaza_ReturnValue;                 // 0x00A8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4B[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalWazaID                                    CallFunc_Array_Get_Item;                           // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4C[0x3];                                     // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetWazaName_outName;                      // 0x00D0(0x0018)()
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4D[0x4];                                     // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPalActiveSkill*>                CallFunc_Map_Values_Values;                        // 0x00F0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4E[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalDatabaseCharacterParameter*         CallFunc_GetDatabaseCharacterParameter_ReturnValue; // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCharacterID_ReturnValue;               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPartnerSkillMsgID_OutMsgID;            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizedText_ReturnValue;             // 0x0128(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0140(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0150(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_PalSkillEntry_C*                   CallFunc_Array_Get_Item_1;                         // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PalSkillEntry_C*                   CallFunc_Array_Get_Item_2;                         // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4F[0x3];                                     // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalActiveSkill*                        CallFunc_Array_Get_Item_3;                         // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_PalSkillEntry_C*                   CallFunc_Array_Get_Item_4;                         // 0x0188(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D50[0x3];                                     // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalSkill_KeyGuide_C_OnRide) == 0x000008, "Wrong alignment on WBP_PalSkill_KeyGuide_C_OnRide");
static_assert(sizeof(WBP_PalSkill_KeyGuide_C_OnRide) == 0x0001A0, "Wrong size on WBP_PalSkill_KeyGuide_C_OnRide");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, RideActor) == 0x000000, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::RideActor' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, K2Node_DynamicCast_AsPal_Character) == 0x000010, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::K2Node_DynamicCast_AsPal_Character' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_GetCharacterParameterComponent_ReturnValue) == 0x000028, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_GetCharacterParameterComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_IsValid_ReturnValue_2) == 0x000031, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000038, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_IsValid_ReturnValue_3) == 0x000040, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_IsValid_ReturnValue_4) == 0x000041, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_GetActiveSkillSlot_ReturnValue) == 0x000048, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_GetActiveSkillSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_IsValid_ReturnValue_5) == 0x000050, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_GetSkillMap_ReturnValue) == 0x000058, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_GetSkillMap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_GetEquipWaza_ReturnValue) == 0x0000A8, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_GetEquipWaza_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, Temp_int_Loop_Counter_Variable) == 0x0000BC, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_Less_IntInt_ReturnValue) == 0x0000C0, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_Add_IntInt_ReturnValue) == 0x0000C4, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, Temp_int_Array_Index_Variable_1) == 0x0000C8, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_Array_Get_Item) == 0x0000CC, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_GetWazaName_outName) == 0x0000D0, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_GetWazaName_outName' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, Temp_int_Loop_Counter_Variable_1) == 0x0000E8, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_Map_Values_Values) == 0x0000F0, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_Add_IntInt_ReturnValue_1) == 0x000100, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_Array_Length_ReturnValue_1) == 0x000104, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_Less_IntInt_ReturnValue_1) == 0x000108, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_GetDatabaseCharacterParameter_ReturnValue) == 0x000110, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_GetDatabaseCharacterParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_GetCharacterID_ReturnValue) == 0x000118, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_GetCharacterID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_GetPartnerSkillMsgID_OutMsgID) == 0x000120, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_GetPartnerSkillMsgID_OutMsgID' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_GetLocalizedText_ReturnValue) == 0x000128, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_GetLocalizedText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, K2Node_CreateDelegate_OutputDelegate) == 0x000140, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, K2Node_CreateDelegate_OutputDelegate_1) == 0x000150, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_Array_Get_Item_1) == 0x000160, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_Array_Get_Item_2) == 0x000168, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_Array_Length_ReturnValue_2) == 0x000170, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_Array_Length_ReturnValue_3) == 0x000174, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, Temp_int_Array_Index_Variable_2) == 0x000178, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00017C, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_Array_Get_Item_3) == 0x000180, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_Array_Get_Item_4) == 0x000188, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, Temp_int_Loop_Counter_Variable_2) == 0x000190, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_Less_IntInt_ReturnValue_2) == 0x000194, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_OnRide, CallFunc_Add_IntInt_ReturnValue_2) == 0x000198, "Member 'WBP_PalSkill_KeyGuide_C_OnRide::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");

// Function WBP_PalSkill_KeyGuide.WBP_PalSkill_KeyGuide_C.Setup
// 0x0038 (0x0038 - 0x0000)
struct WBP_PalSkill_KeyGuide_C_Setup final
{
public:
	TDelegate<void(class AActor* RideActor)>      K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* RideActor)>      K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalRiderComponent*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalSkill_KeyGuide_C_Setup) == 0x000008, "Wrong alignment on WBP_PalSkill_KeyGuide_C_Setup");
static_assert(sizeof(WBP_PalSkill_KeyGuide_C_Setup) == 0x000038, "Wrong size on WBP_PalSkill_KeyGuide_C_Setup");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_Setup, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_PalSkill_KeyGuide_C_Setup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_Setup, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'WBP_PalSkill_KeyGuide_C_Setup::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PalSkill_KeyGuide_C_Setup, CallFunc_GetPalmi_ReturnValue) == 0x000020, "Member 'WBP_PalSkill_KeyGuide_C_Setup::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
