#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ConvertItemMenuScrollList

#include "Basic.hpp"

#include "Pal_structs.hpp"
#include "WBP_PalCommonScrollList_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ConvertItemMenuScrollList.WBP_ConvertItemMenuScrollList_C
// 0x00B0 (0x04F0 - 0x0440)
class UWBP_ConvertItemMenuScrollList_C final : public UWBP_PalCommonScrollList_C
{
public:
	FMulticastInlineDelegateProperty_             OnClickedContent;                                  // 0x0440(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnHoverdContent;                                   // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnUnhoveredContent;                                // 0x0460(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnFocusedContent;                                  // 0x0470(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnUnfocusedContent;                                // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMap<EPalBuildObjectTypeB, class FName>       MsgIDMap;                                          // 0x0490(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UWBP_BuildObjectScrollListBlock_C*> blocks;                                            // 0x04E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void AddRecipeSet(TArray<class FName>& RecipeIDArray, class UWBP_ConvertItemMenuScrollListBlock_C** CreatedBlock);
	void CreateBlock(TArray<class FName>& RecipeIDArray, class UWBP_ConvertItemMenuScrollListBlock_C** CreatedBlock);
	void Focus();
	void FocusWithRecipeID(class FName RecipeID);
	void GetFocusTarget(class UWidget** Target);
	void OnClickedContent__DelegateSignature(class UWBP_PalConvertItemMenu_RecipeSlotButton_C* Widget);
	void OnClickedContent_Internal(class UWBP_PalConvertItemMenu_RecipeSlotButton_C* Widget);
	void OnFocusedContent__DelegateSignature(class UWBP_PalConvertItemMenu_RecipeSlotButton_C* Widget);
	void OnFocusedContent_Internal(class UWBP_PalConvertItemMenu_RecipeSlotButton_C* Widget);
	void OnHoverdContent__DelegateSignature(class UWBP_PalConvertItemMenu_RecipeSlotButton_C* Widget);
	void OnHoveredContent_Internal(class UWBP_PalConvertItemMenu_RecipeSlotButton_C* Widget);
	void OnUnfocusedContent__DelegateSignature(class UWBP_PalConvertItemMenu_RecipeSlotButton_C* Widget);
	void OnUnfocusedContent_Internal(class UWBP_PalConvertItemMenu_RecipeSlotButton_C* Widget);
	void OnUnhoveredContent__DelegateSignature(class UWBP_PalConvertItemMenu_RecipeSlotButton_C* Widget);
	void OnUnhoveredContent_Internal(class UWBP_PalConvertItemMenu_RecipeSlotButton_C* Widget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ConvertItemMenuScrollList_C">();
	}
	static class UWBP_ConvertItemMenuScrollList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ConvertItemMenuScrollList_C>();
	}
};
static_assert(alignof(UWBP_ConvertItemMenuScrollList_C) == 0x000008, "Wrong alignment on UWBP_ConvertItemMenuScrollList_C");
static_assert(sizeof(UWBP_ConvertItemMenuScrollList_C) == 0x0004F0, "Wrong size on UWBP_ConvertItemMenuScrollList_C");
static_assert(offsetof(UWBP_ConvertItemMenuScrollList_C, OnClickedContent) == 0x000440, "Member 'UWBP_ConvertItemMenuScrollList_C::OnClickedContent' has a wrong offset!");
static_assert(offsetof(UWBP_ConvertItemMenuScrollList_C, OnHoverdContent) == 0x000450, "Member 'UWBP_ConvertItemMenuScrollList_C::OnHoverdContent' has a wrong offset!");
static_assert(offsetof(UWBP_ConvertItemMenuScrollList_C, OnUnhoveredContent) == 0x000460, "Member 'UWBP_ConvertItemMenuScrollList_C::OnUnhoveredContent' has a wrong offset!");
static_assert(offsetof(UWBP_ConvertItemMenuScrollList_C, OnFocusedContent) == 0x000470, "Member 'UWBP_ConvertItemMenuScrollList_C::OnFocusedContent' has a wrong offset!");
static_assert(offsetof(UWBP_ConvertItemMenuScrollList_C, OnUnfocusedContent) == 0x000480, "Member 'UWBP_ConvertItemMenuScrollList_C::OnUnfocusedContent' has a wrong offset!");
static_assert(offsetof(UWBP_ConvertItemMenuScrollList_C, MsgIDMap) == 0x000490, "Member 'UWBP_ConvertItemMenuScrollList_C::MsgIDMap' has a wrong offset!");
static_assert(offsetof(UWBP_ConvertItemMenuScrollList_C, blocks) == 0x0004E0, "Member 'UWBP_ConvertItemMenuScrollList_C::blocks' has a wrong offset!");

}

