#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Ingame_InteractDurability

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Pal_structs.hpp"
#include "Pal_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Ingame_InteractDurability.WBP_Ingame_InteractDurability_C
// 0x0038 (0x0440 - 0x0408)
class UWBP_Ingame_InteractDurability_C final : public UPalUIMapObjectHPWorldHUD
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0408(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anm_Color_NormalToLittle;                          // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_HP;                                    // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_HP_Current;                                   // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_HP_MAX;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          DamegeReacted;                                     // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40BF[0x3];                                     // 0x0431(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentHP;                                         // 0x0434(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalMapObjectModel*                     Model;                                             // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CollapsePanel();
	void ExecuteUbergraph_WBP_Ingame_InteractDurability(int32 EntryPoint);
	void OnSetup();
	void ShowHP(class APalMapObject* MapObject, EPalHUDDisplayType DisplayType);
	void UpdateHP(class UPalMapObjectModel* Param_Model);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Ingame_InteractDurability_C">();
	}
	static class UWBP_Ingame_InteractDurability_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Ingame_InteractDurability_C>();
	}
};
static_assert(alignof(UWBP_Ingame_InteractDurability_C) == 0x000008, "Wrong alignment on UWBP_Ingame_InteractDurability_C");
static_assert(sizeof(UWBP_Ingame_InteractDurability_C) == 0x000440, "Wrong size on UWBP_Ingame_InteractDurability_C");
static_assert(offsetof(UWBP_Ingame_InteractDurability_C, UberGraphFrame) == 0x000408, "Member 'UWBP_Ingame_InteractDurability_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Ingame_InteractDurability_C, Anm_Color_NormalToLittle) == 0x000410, "Member 'UWBP_Ingame_InteractDurability_C::Anm_Color_NormalToLittle' has a wrong offset!");
static_assert(offsetof(UWBP_Ingame_InteractDurability_C, ProgressBar_HP) == 0x000418, "Member 'UWBP_Ingame_InteractDurability_C::ProgressBar_HP' has a wrong offset!");
static_assert(offsetof(UWBP_Ingame_InteractDurability_C, Text_HP_Current) == 0x000420, "Member 'UWBP_Ingame_InteractDurability_C::Text_HP_Current' has a wrong offset!");
static_assert(offsetof(UWBP_Ingame_InteractDurability_C, Text_HP_MAX) == 0x000428, "Member 'UWBP_Ingame_InteractDurability_C::Text_HP_MAX' has a wrong offset!");
static_assert(offsetof(UWBP_Ingame_InteractDurability_C, DamegeReacted) == 0x000430, "Member 'UWBP_Ingame_InteractDurability_C::DamegeReacted' has a wrong offset!");
static_assert(offsetof(UWBP_Ingame_InteractDurability_C, CurrentHP) == 0x000434, "Member 'UWBP_Ingame_InteractDurability_C::CurrentHP' has a wrong offset!");
static_assert(offsetof(UWBP_Ingame_InteractDurability_C, Model) == 0x000438, "Member 'UWBP_Ingame_InteractDurability_C::Model' has a wrong offset!");

}

