#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IngameMenu_Chest_FilterContent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_IngameMenu_Chest_FilterContent.WBP_IngameMenu_Chest_FilterContent_C
// 0x0038 (0x02B0 - 0x0278)
class UWBP_IngameMenu_Chest_FilterContent_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_PalTextBlock_C*                     BP_PalTextBlock_C;                                 // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPalCheckBox*                           PalCheckBox_43;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalInvisibleButton_C*              WBP_PalInvisibleButton;                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnClickedCheckButton;                              // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FName                                   FilterId;                                          // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_IngameMenu_Chest_FilterContent_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WBP_IngameMenu_Chest_FilterContent(int32 EntryPoint);
	void OnChangedStateInternal(bool IsChecked);
	void OnClickedCheckButton__DelegateSignature(class FName Param_FilterId, bool bChecked);
	void OnUpdateFilterPreference(class UPalMapObjectItemContainerModule* Module);
	void RegisterEvents(class UPalUIItemChestFilterModel* Model);
	void SetupUI(class FName Param_FilterId, class FName TextId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_IngameMenu_Chest_FilterContent_C">();
	}
	static class UWBP_IngameMenu_Chest_FilterContent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_IngameMenu_Chest_FilterContent_C>();
	}
};
static_assert(alignof(UWBP_IngameMenu_Chest_FilterContent_C) == 0x000008, "Wrong alignment on UWBP_IngameMenu_Chest_FilterContent_C");
static_assert(sizeof(UWBP_IngameMenu_Chest_FilterContent_C) == 0x0002B0, "Wrong size on UWBP_IngameMenu_Chest_FilterContent_C");
static_assert(offsetof(UWBP_IngameMenu_Chest_FilterContent_C, UberGraphFrame) == 0x000278, "Member 'UWBP_IngameMenu_Chest_FilterContent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_FilterContent_C, BP_PalTextBlock_C) == 0x000280, "Member 'UWBP_IngameMenu_Chest_FilterContent_C::BP_PalTextBlock_C' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_FilterContent_C, PalCheckBox_43) == 0x000288, "Member 'UWBP_IngameMenu_Chest_FilterContent_C::PalCheckBox_43' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_FilterContent_C, WBP_PalInvisibleButton) == 0x000290, "Member 'UWBP_IngameMenu_Chest_FilterContent_C::WBP_PalInvisibleButton' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_FilterContent_C, OnClickedCheckButton) == 0x000298, "Member 'UWBP_IngameMenu_Chest_FilterContent_C::OnClickedCheckButton' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_FilterContent_C, FilterId) == 0x0002A8, "Member 'UWBP_IngameMenu_Chest_FilterContent_C::FilterId' has a wrong offset!");

}

