#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Buildup_Pal_StatusContent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Pal_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Buildup_Pal_StatusContent.WBP_Buildup_Pal_StatusContent_C
// 0x00B8 (0x0330 - 0x0278)
class UWBP_Buildup_Pal_StatusContent_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anm_RankUp;                                        // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Focus;                                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Gauge;                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconItem;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconStatus;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ItemNum;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Select;                                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StatusArrow;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_BuildupStoneNum;                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_StatusNeme;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_StatusNumAfter;                               // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_StatusNumBefore;                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalInvisibleButton_C*              WBP_PalInvisibleButton;                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_Buildup_Gauge_C*>           BuildupGauges;                                     // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	EPalCharacterStatusOperationName              Status;                                            // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Clickable;                                         // 0x0301(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DF9[0x6];                                     // 0x0302(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnClicked;                                         // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         Current_Rank;                                      // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TargetRank;                                        // 0x031C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLock;                                             // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMax;                                             // 0x0321(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DFA[0x2];                                     // 0x0322(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Icon_Index;                                        // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Item_Count;                                        // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnmEvent_RankUp();
	void BndEvt__WBP_Buildup_Pal_StatusContent_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Buildup_Pal_StatusContent_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Buildup_Pal_StatusContent_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WBP_Buildup_Pal_StatusContent(int32 EntryPoint);
	void Get_Status(EPalCharacterStatusOperationName* Param_Status);
	void GetItemAndNum(int32* ItemIndex, int32* Num);
	void OnClicked__DelegateSignature(EPalCharacterStatusOperationName Param_Status, int32 Param_TargetRank);
	void Set_Info(int32 IconIndex, int32 ItemCount, int32 CurrentRank, bool IsSufficent);
	void SetEnable(bool IsEnable);
	void Setup(EPalCharacterStatusOperationName Param_Status);
	void SwitchSelect(bool IsSelect);
	void UpdateSufficiency(bool IsSufficient);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Buildup_Pal_StatusContent_C">();
	}
	static class UWBP_Buildup_Pal_StatusContent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Buildup_Pal_StatusContent_C>();
	}
};
static_assert(alignof(UWBP_Buildup_Pal_StatusContent_C) == 0x000008, "Wrong alignment on UWBP_Buildup_Pal_StatusContent_C");
static_assert(sizeof(UWBP_Buildup_Pal_StatusContent_C) == 0x000330, "Wrong size on UWBP_Buildup_Pal_StatusContent_C");
static_assert(offsetof(UWBP_Buildup_Pal_StatusContent_C, UberGraphFrame) == 0x000278, "Member 'UWBP_Buildup_Pal_StatusContent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_StatusContent_C, Anm_RankUp) == 0x000280, "Member 'UWBP_Buildup_Pal_StatusContent_C::Anm_RankUp' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_StatusContent_C, CanvasPanel_0) == 0x000288, "Member 'UWBP_Buildup_Pal_StatusContent_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_StatusContent_C, Focus) == 0x000290, "Member 'UWBP_Buildup_Pal_StatusContent_C::Focus' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_StatusContent_C, HorizontalBox_Gauge) == 0x000298, "Member 'UWBP_Buildup_Pal_StatusContent_C::HorizontalBox_Gauge' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_StatusContent_C, IconItem) == 0x0002A0, "Member 'UWBP_Buildup_Pal_StatusContent_C::IconItem' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_StatusContent_C, IconStatus) == 0x0002A8, "Member 'UWBP_Buildup_Pal_StatusContent_C::IconStatus' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_StatusContent_C, ItemNum) == 0x0002B0, "Member 'UWBP_Buildup_Pal_StatusContent_C::ItemNum' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_StatusContent_C, Select) == 0x0002B8, "Member 'UWBP_Buildup_Pal_StatusContent_C::Select' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_StatusContent_C, StatusArrow) == 0x0002C0, "Member 'UWBP_Buildup_Pal_StatusContent_C::StatusArrow' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_StatusContent_C, Text_BuildupStoneNum) == 0x0002C8, "Member 'UWBP_Buildup_Pal_StatusContent_C::Text_BuildupStoneNum' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_StatusContent_C, Text_StatusNeme) == 0x0002D0, "Member 'UWBP_Buildup_Pal_StatusContent_C::Text_StatusNeme' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_StatusContent_C, Text_StatusNumAfter) == 0x0002D8, "Member 'UWBP_Buildup_Pal_StatusContent_C::Text_StatusNumAfter' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_StatusContent_C, Text_StatusNumBefore) == 0x0002E0, "Member 'UWBP_Buildup_Pal_StatusContent_C::Text_StatusNumBefore' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_StatusContent_C, WBP_PalInvisibleButton) == 0x0002E8, "Member 'UWBP_Buildup_Pal_StatusContent_C::WBP_PalInvisibleButton' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_StatusContent_C, BuildupGauges) == 0x0002F0, "Member 'UWBP_Buildup_Pal_StatusContent_C::BuildupGauges' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_StatusContent_C, Status) == 0x000300, "Member 'UWBP_Buildup_Pal_StatusContent_C::Status' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_StatusContent_C, Clickable) == 0x000301, "Member 'UWBP_Buildup_Pal_StatusContent_C::Clickable' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_StatusContent_C, OnClicked) == 0x000308, "Member 'UWBP_Buildup_Pal_StatusContent_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_StatusContent_C, Current_Rank) == 0x000318, "Member 'UWBP_Buildup_Pal_StatusContent_C::Current_Rank' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_StatusContent_C, TargetRank) == 0x00031C, "Member 'UWBP_Buildup_Pal_StatusContent_C::TargetRank' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_StatusContent_C, bLock) == 0x000320, "Member 'UWBP_Buildup_Pal_StatusContent_C::bLock' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_StatusContent_C, IsMax) == 0x000321, "Member 'UWBP_Buildup_Pal_StatusContent_C::IsMax' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_StatusContent_C, Icon_Index) == 0x000324, "Member 'UWBP_Buildup_Pal_StatusContent_C::Icon_Index' has a wrong offset!");
static_assert(offsetof(UWBP_Buildup_Pal_StatusContent_C, Item_Count) == 0x000328, "Member 'UWBP_Buildup_Pal_StatusContent_C::Item_Count' has a wrong offset!");

}

