#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InventoryEquipment_TrashButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_InventoryEquipment_TrashButton.WBP_InventoryEquipment_TrashButton_C.BndEvt__WBP_InventoryEquipment_TrashButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_InventoryEquipment_TrashButton_C_BndEvt__WBP_InventoryEquipment_TrashButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventoryEquipment_TrashButton_C_BndEvt__WBP_InventoryEquipment_TrashButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_InventoryEquipment_TrashButton_C_BndEvt__WBP_InventoryEquipment_TrashButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_InventoryEquipment_TrashButton_C_BndEvt__WBP_InventoryEquipment_TrashButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_InventoryEquipment_TrashButton_C_BndEvt__WBP_InventoryEquipment_TrashButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_BndEvt__WBP_InventoryEquipment_TrashButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_InventoryEquipment_TrashButton_C_BndEvt__WBP_InventoryEquipment_TrashButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_InventoryEquipment_TrashButton.WBP_InventoryEquipment_TrashButton_C.BndEvt__WBP_InventoryEquipment_TrashButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_InventoryEquipment_TrashButton_C_BndEvt__WBP_InventoryEquipment_TrashButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventoryEquipment_TrashButton_C_BndEvt__WBP_InventoryEquipment_TrashButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_InventoryEquipment_TrashButton_C_BndEvt__WBP_InventoryEquipment_TrashButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_InventoryEquipment_TrashButton_C_BndEvt__WBP_InventoryEquipment_TrashButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_InventoryEquipment_TrashButton_C_BndEvt__WBP_InventoryEquipment_TrashButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_BndEvt__WBP_InventoryEquipment_TrashButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_InventoryEquipment_TrashButton_C_BndEvt__WBP_InventoryEquipment_TrashButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_InventoryEquipment_TrashButton.WBP_InventoryEquipment_TrashButton_C.BndEvt__WBP_InventoryEquipment_TrashButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_InventoryEquipment_TrashButton_C_BndEvt__WBP_InventoryEquipment_TrashButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventoryEquipment_TrashButton_C_BndEvt__WBP_InventoryEquipment_TrashButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_InventoryEquipment_TrashButton_C_BndEvt__WBP_InventoryEquipment_TrashButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_InventoryEquipment_TrashButton_C_BndEvt__WBP_InventoryEquipment_TrashButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_InventoryEquipment_TrashButton_C_BndEvt__WBP_InventoryEquipment_TrashButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_BndEvt__WBP_InventoryEquipment_TrashButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_InventoryEquipment_TrashButton_C_BndEvt__WBP_InventoryEquipment_TrashButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_InventoryEquipment_TrashButton.WBP_InventoryEquipment_TrashButton_C.CheckDragging
// 0x0002 (0x0002 - 0x0000)
struct WBP_InventoryEquipment_TrashButton_C_CheckDragging final
{
public:
	bool                                          IsDragging;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDragDropping_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventoryEquipment_TrashButton_C_CheckDragging) == 0x000001, "Wrong alignment on WBP_InventoryEquipment_TrashButton_C_CheckDragging");
static_assert(sizeof(WBP_InventoryEquipment_TrashButton_C_CheckDragging) == 0x000002, "Wrong size on WBP_InventoryEquipment_TrashButton_C_CheckDragging");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_CheckDragging, IsDragging) == 0x000000, "Member 'WBP_InventoryEquipment_TrashButton_C_CheckDragging::IsDragging' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_CheckDragging, CallFunc_IsDragDropping_ReturnValue) == 0x000001, "Member 'WBP_InventoryEquipment_TrashButton_C_CheckDragging::CallFunc_IsDragDropping_ReturnValue' has a wrong offset!");

// Function WBP_InventoryEquipment_TrashButton.WBP_InventoryEquipment_TrashButton_C.ExecuteUbergraph_WBP_InventoryEquipment_TrashButton
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E5D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E5E[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text;          // 0x0078(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E5F[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDService*                         CallFunc_GetHUDService_ReturnValue;                // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E60[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E61[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalUILiftSlotModel*                    CallFunc_GetLiftSlotModel_ReturnValue;             // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLift_ReturnValue;                       // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E62[0x6];                                     // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDService*                         CallFunc_GetHUDService_ReturnValue_1;              // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckDragging_IsDragging;                 // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E63[0x6];                                     // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalUILiftSlotModel*                    CallFunc_GetLiftSlotModel_ReturnValue_1;           // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLift_ReturnValue_1;                     // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton) == 0x000008, "Wrong alignment on WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton");
static_assert(sizeof(WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton) == 0x0000E8, "Wrong size on WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton, EntryPoint) == 0x000000, "Member 'WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton, K2Node_Event_MyGeometry) == 0x000008, "Member 'WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton, K2Node_Event_InDeltaTime) == 0x000048, "Member 'WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton, K2Node_ComponentBoundEvent_Button_2) == 0x000050, "Member 'WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton, K2Node_ComponentBoundEvent_Button_1) == 0x000058, "Member 'WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton, K2Node_ComponentBoundEvent_Button) == 0x000060, "Member 'WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton, CallFunc_PlayAnimation_ReturnValue) == 0x000068, "Member 'WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000070, "Member 'WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton, CallFunc_GetLocalizedTextFromHandle_Text) == 0x000078, "Member 'WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton::CallFunc_GetLocalizedTextFromHandle_Text' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton, CallFunc_GetHUDService_ReturnValue) == 0x000098, "Member 'WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton::CallFunc_GetHUDService_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton, CallFunc_IsValid_ReturnValue_1) == 0x0000A0, "Member 'WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton, K2Node_CreateDelegate_OutputDelegate) == 0x0000A4, "Member 'WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton, CallFunc_GetLiftSlotModel_ReturnValue) == 0x0000B8, "Member 'WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton::CallFunc_GetLiftSlotModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton, CallFunc_IsValid_ReturnValue_2) == 0x0000C0, "Member 'WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton, CallFunc_IsLift_ReturnValue) == 0x0000C1, "Member 'WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton::CallFunc_IsLift_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton, CallFunc_GetHUDService_ReturnValue_1) == 0x0000C8, "Member 'WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton::CallFunc_GetHUDService_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton, CallFunc_CheckDragging_IsDragging) == 0x0000D0, "Member 'WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton::CallFunc_CheckDragging_IsDragging' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton, CallFunc_IsValid_ReturnValue_3) == 0x0000D1, "Member 'WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton, CallFunc_GetLiftSlotModel_ReturnValue_1) == 0x0000D8, "Member 'WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton::CallFunc_GetLiftSlotModel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton, CallFunc_IsValid_ReturnValue_4) == 0x0000E0, "Member 'WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton, CallFunc_IsLift_ReturnValue_1) == 0x0000E1, "Member 'WBP_InventoryEquipment_TrashButton_C_ExecuteUbergraph_WBP_InventoryEquipment_TrashButton::CallFunc_IsLift_ReturnValue_1' has a wrong offset!");

// Function WBP_InventoryEquipment_TrashButton.WBP_InventoryEquipment_TrashButton_C.OnDrop
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_InventoryEquipment_TrashButton_C_OnDrop final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0040(0x0098)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDragDropOperation*                     Operation;                                         // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E64[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PalItemSlotButtonBase_C*           K2Node_DynamicCast_AsWBP_Pal_Item_Slot_Button_Base; // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventoryEquipment_TrashButton_C_OnDrop) == 0x000008, "Wrong alignment on WBP_InventoryEquipment_TrashButton_C_OnDrop");
static_assert(sizeof(WBP_InventoryEquipment_TrashButton_C_OnDrop) == 0x0000F8, "Wrong size on WBP_InventoryEquipment_TrashButton_C_OnDrop");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_OnDrop, MyGeometry) == 0x000000, "Member 'WBP_InventoryEquipment_TrashButton_C_OnDrop::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_OnDrop, PointerEvent) == 0x000040, "Member 'WBP_InventoryEquipment_TrashButton_C_OnDrop::PointerEvent' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_OnDrop, Operation) == 0x0000D8, "Member 'WBP_InventoryEquipment_TrashButton_C_OnDrop::Operation' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_OnDrop, ReturnValue) == 0x0000E0, "Member 'WBP_InventoryEquipment_TrashButton_C_OnDrop::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_OnDrop, K2Node_DynamicCast_AsWBP_Pal_Item_Slot_Button_Base) == 0x0000E8, "Member 'WBP_InventoryEquipment_TrashButton_C_OnDrop::K2Node_DynamicCast_AsWBP_Pal_Item_Slot_Button_Base' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_OnDrop, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'WBP_InventoryEquipment_TrashButton_C_OnDrop::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_InventoryEquipment_TrashButton.WBP_InventoryEquipment_TrashButton_C.SetEnableButton
// 0x0010 (0x0010 - 0x0000)
struct WBP_InventoryEquipment_TrashButton_C_SetEnableButton final
{
public:
	bool                                          IsEnable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E65[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventoryEquipment_TrashButton_C_SetEnableButton) == 0x000008, "Wrong alignment on WBP_InventoryEquipment_TrashButton_C_SetEnableButton");
static_assert(sizeof(WBP_InventoryEquipment_TrashButton_C_SetEnableButton) == 0x000010, "Wrong size on WBP_InventoryEquipment_TrashButton_C_SetEnableButton");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_SetEnableButton, IsEnable) == 0x000000, "Member 'WBP_InventoryEquipment_TrashButton_C_SetEnableButton::IsEnable' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_SetEnableButton, Temp_bool_Variable) == 0x000001, "Member 'WBP_InventoryEquipment_TrashButton_C_SetEnableButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_SetEnableButton, Temp_byte_Variable) == 0x000002, "Member 'WBP_InventoryEquipment_TrashButton_C_SetEnableButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_SetEnableButton, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_InventoryEquipment_TrashButton_C_SetEnableButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_SetEnableButton, K2Node_Select_Default) == 0x000004, "Member 'WBP_InventoryEquipment_TrashButton_C_SetEnableButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_SetEnableButton, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_InventoryEquipment_TrashButton_C_SetEnableButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_InventoryEquipment_TrashButton.WBP_InventoryEquipment_TrashButton_C.Tick
// 0x0048 (0x0048 - 0x0000)
struct WBP_InventoryEquipment_TrashButton_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventoryEquipment_TrashButton_C_Tick) == 0x000008, "Wrong alignment on WBP_InventoryEquipment_TrashButton_C_Tick");
static_assert(sizeof(WBP_InventoryEquipment_TrashButton_C_Tick) == 0x000048, "Wrong size on WBP_InventoryEquipment_TrashButton_C_Tick");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_InventoryEquipment_TrashButton_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TrashButton_C_Tick, InDeltaTime) == 0x000040, "Member 'WBP_InventoryEquipment_TrashButton_C_Tick::InDeltaTime' has a wrong offset!");

}

