#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InventoryEquipment_GrowsPointButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InventoryEquipment_GrowsPointButton.WBP_InventoryEquipment_GrowsPointButton_C
// 0x0048 (0x02C0 - 0x0278)
class UWBP_InventoryEquipment_GrowsPointButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anm_Blink;                                         // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anm_EnableToDisable;                               // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anm_NormalToFocus;                                 // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Flare;                                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_214;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_Point;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalKeyGuideIcon_C*                 WBP_PalKeyGuideIcon;                               // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsEnableButton;                                    // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnmEvent_Active();
	void AnmEvent_Deactive();
	void ExecuteUbergraph_WBP_InventoryEquipment_GrowsPointButton(int32 EntryPoint);
	void Finished_A20F78AE45F2878481C71DBF29E2326A();
	void SetPoint(int32 Point);
	void SetSimulatePoint(int32 Point);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_InventoryEquipment_GrowsPointButton_C">();
	}
	static class UWBP_InventoryEquipment_GrowsPointButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InventoryEquipment_GrowsPointButton_C>();
	}
};
static_assert(alignof(UWBP_InventoryEquipment_GrowsPointButton_C) == 0x000008, "Wrong alignment on UWBP_InventoryEquipment_GrowsPointButton_C");
static_assert(sizeof(UWBP_InventoryEquipment_GrowsPointButton_C) == 0x0002C0, "Wrong size on UWBP_InventoryEquipment_GrowsPointButton_C");
static_assert(offsetof(UWBP_InventoryEquipment_GrowsPointButton_C, UberGraphFrame) == 0x000278, "Member 'UWBP_InventoryEquipment_GrowsPointButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_GrowsPointButton_C, Anm_Blink) == 0x000280, "Member 'UWBP_InventoryEquipment_GrowsPointButton_C::Anm_Blink' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_GrowsPointButton_C, Anm_EnableToDisable) == 0x000288, "Member 'UWBP_InventoryEquipment_GrowsPointButton_C::Anm_EnableToDisable' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_GrowsPointButton_C, Anm_NormalToFocus) == 0x000290, "Member 'UWBP_InventoryEquipment_GrowsPointButton_C::Anm_NormalToFocus' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_GrowsPointButton_C, Flare) == 0x000298, "Member 'UWBP_InventoryEquipment_GrowsPointButton_C::Flare' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_GrowsPointButton_C, Image_214) == 0x0002A0, "Member 'UWBP_InventoryEquipment_GrowsPointButton_C::Image_214' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_GrowsPointButton_C, Text_Point) == 0x0002A8, "Member 'UWBP_InventoryEquipment_GrowsPointButton_C::Text_Point' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_GrowsPointButton_C, WBP_PalKeyGuideIcon) == 0x0002B0, "Member 'UWBP_InventoryEquipment_GrowsPointButton_C::WBP_PalKeyGuideIcon' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEquipment_GrowsPointButton_C, IsEnableButton) == 0x0002B8, "Member 'UWBP_InventoryEquipment_GrowsPointButton_C::IsEnableButton' has a wrong offset!");

}

