#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SelectItemInventory

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Pal_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_SelectItemInventory.WBP_SelectItemInventory_C.ComplateSelect
// 0x0030 (0x0030 - 0x0000)
struct WBP_SelectItemInventory_C_ComplateSelect final
{
public:
	struct FPalItemSlotId                         SlotID;                                            // 0x0000(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectNum;                                         // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalHUDDispatchParameterBase*           CallFunc_GetParam_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalHUDDispatchParameter_SelectItemInventory* K2Node_DynamicCast_AsPal_HUDDispatch_Parameter_Select_Item_Inventory; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SelectItemInventory_C_ComplateSelect) == 0x000008, "Wrong alignment on WBP_SelectItemInventory_C_ComplateSelect");
static_assert(sizeof(WBP_SelectItemInventory_C_ComplateSelect) == 0x000030, "Wrong size on WBP_SelectItemInventory_C_ComplateSelect");
static_assert(offsetof(WBP_SelectItemInventory_C_ComplateSelect, SlotID) == 0x000000, "Member 'WBP_SelectItemInventory_C_ComplateSelect::SlotID' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_ComplateSelect, SelectNum) == 0x000014, "Member 'WBP_SelectItemInventory_C_ComplateSelect::SelectNum' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_ComplateSelect, CallFunc_GetParam_ReturnValue) == 0x000018, "Member 'WBP_SelectItemInventory_C_ComplateSelect::CallFunc_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_ComplateSelect, K2Node_DynamicCast_AsPal_HUDDispatch_Parameter_Select_Item_Inventory) == 0x000020, "Member 'WBP_SelectItemInventory_C_ComplateSelect::K2Node_DynamicCast_AsPal_HUDDispatch_Parameter_Select_Item_Inventory' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_ComplateSelect, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_SelectItemInventory_C_ComplateSelect::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_SelectItemInventory.WBP_SelectItemInventory_C.DisplaySelectNumWidget
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_SelectItemInventory_C_DisplaySelectNumWidget final
{
public:
	class UPalItemSlot*                           CallFunc_GetTargetSlot_targetSlot;                 // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStackCount_ReturnValue;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1E[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0030(0x0040)(ConstParm, IsPlainOldData, NoDestructor)
	TDelegate<void(EPalUISelectNumResult ResultType, int32 SelectedNum)> K2Node_CreateDelegate_OutputDelegate;              // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_PixelPosition;            // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_ViewportPosition;         // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalUISelectNumParameter*               CallFunc_SpawnObject_ReturnValue;                  // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_Push_ReturnValue;                         // 0x00B8(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SelectItemInventory_C_DisplaySelectNumWidget) == 0x000008, "Wrong alignment on WBP_SelectItemInventory_C_DisplaySelectNumWidget");
static_assert(sizeof(WBP_SelectItemInventory_C_DisplaySelectNumWidget) == 0x0000C8, "Wrong size on WBP_SelectItemInventory_C_DisplaySelectNumWidget");
static_assert(offsetof(WBP_SelectItemInventory_C_DisplaySelectNumWidget, CallFunc_GetTargetSlot_targetSlot) == 0x000000, "Member 'WBP_SelectItemInventory_C_DisplaySelectNumWidget::CallFunc_GetTargetSlot_targetSlot' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_DisplaySelectNumWidget, CallFunc_GetDesiredSize_ReturnValue) == 0x000008, "Member 'WBP_SelectItemInventory_C_DisplaySelectNumWidget::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_DisplaySelectNumWidget, CallFunc_GetStackCount_ReturnValue) == 0x000018, "Member 'WBP_SelectItemInventory_C_DisplaySelectNumWidget::CallFunc_GetStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_DisplaySelectNumWidget, CallFunc_Multiply_Vector2DVector2D_ReturnValue) == 0x000020, "Member 'WBP_SelectItemInventory_C_DisplaySelectNumWidget::CallFunc_Multiply_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_DisplaySelectNumWidget, CallFunc_GetCachedGeometry_ReturnValue) == 0x000030, "Member 'WBP_SelectItemInventory_C_DisplaySelectNumWidget::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_DisplaySelectNumWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000070, "Member 'WBP_SelectItemInventory_C_DisplaySelectNumWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_DisplaySelectNumWidget, CallFunc_LocalToViewport_PixelPosition) == 0x000080, "Member 'WBP_SelectItemInventory_C_DisplaySelectNumWidget::CallFunc_LocalToViewport_PixelPosition' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_DisplaySelectNumWidget, CallFunc_LocalToViewport_ViewportPosition) == 0x000090, "Member 'WBP_SelectItemInventory_C_DisplaySelectNumWidget::CallFunc_LocalToViewport_ViewportPosition' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_DisplaySelectNumWidget, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x0000A0, "Member 'WBP_SelectItemInventory_C_DisplaySelectNumWidget::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_DisplaySelectNumWidget, CallFunc_SpawnObject_ReturnValue) == 0x0000B0, "Member 'WBP_SelectItemInventory_C_DisplaySelectNumWidget::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_DisplaySelectNumWidget, CallFunc_Push_ReturnValue) == 0x0000B8, "Member 'WBP_SelectItemInventory_C_DisplaySelectNumWidget::CallFunc_Push_ReturnValue' has a wrong offset!");

// Function WBP_SelectItemInventory.WBP_SelectItemInventory_C.ExecuteUbergraph_WBP_SelectItemInventory
// 0x0050 (0x0050 - 0x0000)
struct WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_PalItemSlotButtonBase_C* ButtonBase, EPalItemSlotPressType PressType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1F[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDDispatchParameterBase*           CallFunc_GetParam_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D20[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDDispatchParameter_SelectItemInventory* K2Node_DynamicCast_AsPal_HUDDispatch_Parameter_Select_Item_Inventory; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D21[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FilteringFromInventoryType_IsEmptyDisplaySlot; // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D22[0x1];                                     // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D23[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PalInventoryModel_C*                CallFunc_SpawnObject_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory) == 0x000008, "Wrong alignment on WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory");
static_assert(sizeof(WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory) == 0x000050, "Wrong size on WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory");
static_assert(offsetof(WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory, EntryPoint) == 0x000000, "Member 'WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory, CallFunc_GetParam_ReturnValue) == 0x000018, "Member 'WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory::CallFunc_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory, K2Node_DynamicCast_AsPal_HUDDispatch_Parameter_Select_Item_Inventory) == 0x000028, "Member 'WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory::K2Node_DynamicCast_AsPal_HUDDispatch_Parameter_Select_Item_Inventory' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory, CallFunc_Array_Length_ReturnValue_1) == 0x000038, "Member 'WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00003D, "Member 'WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory, CallFunc_FilteringFromInventoryType_IsEmptyDisplaySlot) == 0x00003E, "Member 'WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory::CallFunc_FilteringFromInventoryType_IsEmptyDisplaySlot' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory, CallFunc_Array_Length_ReturnValue_2) == 0x000040, "Member 'WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000044, "Member 'WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory, CallFunc_SpawnObject_ReturnValue) == 0x000048, "Member 'WBP_SelectItemInventory_C_ExecuteUbergraph_WBP_SelectItemInventory::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function WBP_SelectItemInventory.WBP_SelectItemInventory_C.OnComplateSelectNum
// 0x0030 (0x0030 - 0x0000)
struct WBP_SelectItemInventory_C_OnComplateSelectNum final
{
public:
	EPalUISelectNumResult                         ResultType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D24[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectedNum;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D25[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalItemSlot*                           CallFunc_GetTargetSlot_targetSlot;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalItemSlotId                         CallFunc_GetSlotId_ReturnValue;                    // 0x0018(0x0014)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SelectItemInventory_C_OnComplateSelectNum) == 0x000008, "Wrong alignment on WBP_SelectItemInventory_C_OnComplateSelectNum");
static_assert(sizeof(WBP_SelectItemInventory_C_OnComplateSelectNum) == 0x000030, "Wrong size on WBP_SelectItemInventory_C_OnComplateSelectNum");
static_assert(offsetof(WBP_SelectItemInventory_C_OnComplateSelectNum, ResultType) == 0x000000, "Member 'WBP_SelectItemInventory_C_OnComplateSelectNum::ResultType' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_OnComplateSelectNum, SelectedNum) == 0x000004, "Member 'WBP_SelectItemInventory_C_OnComplateSelectNum::SelectedNum' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_OnComplateSelectNum, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000008, "Member 'WBP_SelectItemInventory_C_OnComplateSelectNum::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_OnComplateSelectNum, CallFunc_GetTargetSlot_targetSlot) == 0x000010, "Member 'WBP_SelectItemInventory_C_OnComplateSelectNum::CallFunc_GetTargetSlot_targetSlot' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_OnComplateSelectNum, CallFunc_GetSlotId_ReturnValue) == 0x000018, "Member 'WBP_SelectItemInventory_C_OnComplateSelectNum::CallFunc_GetSlotId_ReturnValue' has a wrong offset!");

// Function WBP_SelectItemInventory.WBP_SelectItemInventory_C.OnFocusedSlot
// 0x0008 (0x0008 - 0x0000)
struct WBP_SelectItemInventory_C_OnFocusedSlot final
{
public:
	class UWBP_PalItemSlotButtonBase_C*           ButtonBase;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SelectItemInventory_C_OnFocusedSlot) == 0x000008, "Wrong alignment on WBP_SelectItemInventory_C_OnFocusedSlot");
static_assert(sizeof(WBP_SelectItemInventory_C_OnFocusedSlot) == 0x000008, "Wrong size on WBP_SelectItemInventory_C_OnFocusedSlot");
static_assert(offsetof(WBP_SelectItemInventory_C_OnFocusedSlot, ButtonBase) == 0x000000, "Member 'WBP_SelectItemInventory_C_OnFocusedSlot::ButtonBase' has a wrong offset!");

// Function WBP_SelectItemInventory.WBP_SelectItemInventory_C.OnLeftClicked
// 0x0038 (0x0038 - 0x0000)
struct WBP_SelectItemInventory_C_OnLeftClicked final
{
public:
	class UWBP_PalItemSlotButtonBase_C*           ButtonBase;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPalItemSlotPressType                         PressType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D26[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalItemSlot*                           CallFunc_GetTargetSlot_targetSlot;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D27[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPalItemSlotId                         CallFunc_GetSlotId_ReturnValue;                    // 0x001C(0x0014)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SelectItemInventory_C_OnLeftClicked) == 0x000008, "Wrong alignment on WBP_SelectItemInventory_C_OnLeftClicked");
static_assert(sizeof(WBP_SelectItemInventory_C_OnLeftClicked) == 0x000038, "Wrong size on WBP_SelectItemInventory_C_OnLeftClicked");
static_assert(offsetof(WBP_SelectItemInventory_C_OnLeftClicked, ButtonBase) == 0x000000, "Member 'WBP_SelectItemInventory_C_OnLeftClicked::ButtonBase' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_OnLeftClicked, PressType) == 0x000008, "Member 'WBP_SelectItemInventory_C_OnLeftClicked::PressType' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_OnLeftClicked, CallFunc_GetTargetSlot_targetSlot) == 0x000010, "Member 'WBP_SelectItemInventory_C_OnLeftClicked::CallFunc_GetTargetSlot_targetSlot' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_OnLeftClicked, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_SelectItemInventory_C_OnLeftClicked::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_OnLeftClicked, CallFunc_GetSlotId_ReturnValue) == 0x00001C, "Member 'WBP_SelectItemInventory_C_OnLeftClicked::CallFunc_GetSlotId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_OnLeftClicked, CallFunc_IsEmpty_ReturnValue) == 0x000030, "Member 'WBP_SelectItemInventory_C_OnLeftClicked::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");

// Function WBP_SelectItemInventory.WBP_SelectItemInventory_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_SelectItemInventory_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetFocusTarget_target;                    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SelectItemInventory_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_SelectItemInventory_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_SelectItemInventory_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_SelectItemInventory_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_SelectItemInventory_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_SelectItemInventory_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SelectItemInventory_C_BP_GetDesiredFocusTarget, CallFunc_GetFocusTarget_target) == 0x000008, "Member 'WBP_SelectItemInventory_C_BP_GetDesiredFocusTarget::CallFunc_GetFocusTarget_target' has a wrong offset!");

}

