#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WorkSuitabilityPreference_CheckBox_0

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Pal_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_WorkSuitabilityPreference_CheckBox_0.WBP_WorkSuitabilityPreference_CheckBox_0_C
// 0x0050 (0x02C8 - 0x0278)
class UWBP_WorkSuitabilityPreference_CheckBox_0_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_None;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPalCheckBox*                           PalCheckBox;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalInvisibleButton_C*              WBP_PalInvisibleButton_0;                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsEnableCheckBox;                                  // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4376[0x7];                                     // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnCheckStateChanged;                               // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	EPalWorkSuitability                           BindedSuitability;                                 // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBattleSettingMode;                               // 0x02B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4377[0x6];                                     // 0x02B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnHoveredCheckBox;                                 // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_WorkSuitabilityPreference_CheckBox_0_PalCheckBox_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void BndEvt__WBP_WorkSuitabilityPreference_CheckBox_0_WBP_PalInvisibleButton_0_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_WorkSuitabilityPreference_CheckBox_0_WBP_PalInvisibleButton_0_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WBP_WorkSuitabilityPreference_CheckBox_0(int32 EntryPoint);
	void GetBindedSuitability(EPalWorkSuitability* Suitability);
	void IsBattleSettingCheckBox(bool* IsBattleSetting);
	void OnCheckStateChanged__DelegateSignature(bool IsChecked, EPalWorkSuitability Suitability);
	void OnHoveredCheckBox__DelegateSignature(class UWBP_WorkSuitabilityPreference_CheckBox_0_C* SelfWidget);
	void SetCheckedState(bool IsChecked);
	void SetEnableClick(bool IsEnable);
	void Setup(EPalWorkSuitability BindSuitability);
	void Setup_ForBattleSetting();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_WorkSuitabilityPreference_CheckBox_0_C">();
	}
	static class UWBP_WorkSuitabilityPreference_CheckBox_0_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_WorkSuitabilityPreference_CheckBox_0_C>();
	}
};
static_assert(alignof(UWBP_WorkSuitabilityPreference_CheckBox_0_C) == 0x000008, "Wrong alignment on UWBP_WorkSuitabilityPreference_CheckBox_0_C");
static_assert(sizeof(UWBP_WorkSuitabilityPreference_CheckBox_0_C) == 0x0002C8, "Wrong size on UWBP_WorkSuitabilityPreference_CheckBox_0_C");
static_assert(offsetof(UWBP_WorkSuitabilityPreference_CheckBox_0_C, UberGraphFrame) == 0x000278, "Member 'UWBP_WorkSuitabilityPreference_CheckBox_0_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_WorkSuitabilityPreference_CheckBox_0_C, Image_None) == 0x000280, "Member 'UWBP_WorkSuitabilityPreference_CheckBox_0_C::Image_None' has a wrong offset!");
static_assert(offsetof(UWBP_WorkSuitabilityPreference_CheckBox_0_C, PalCheckBox) == 0x000288, "Member 'UWBP_WorkSuitabilityPreference_CheckBox_0_C::PalCheckBox' has a wrong offset!");
static_assert(offsetof(UWBP_WorkSuitabilityPreference_CheckBox_0_C, WBP_PalInvisibleButton_0) == 0x000290, "Member 'UWBP_WorkSuitabilityPreference_CheckBox_0_C::WBP_PalInvisibleButton_0' has a wrong offset!");
static_assert(offsetof(UWBP_WorkSuitabilityPreference_CheckBox_0_C, IsEnableCheckBox) == 0x000298, "Member 'UWBP_WorkSuitabilityPreference_CheckBox_0_C::IsEnableCheckBox' has a wrong offset!");
static_assert(offsetof(UWBP_WorkSuitabilityPreference_CheckBox_0_C, OnCheckStateChanged) == 0x0002A0, "Member 'UWBP_WorkSuitabilityPreference_CheckBox_0_C::OnCheckStateChanged' has a wrong offset!");
static_assert(offsetof(UWBP_WorkSuitabilityPreference_CheckBox_0_C, BindedSuitability) == 0x0002B0, "Member 'UWBP_WorkSuitabilityPreference_CheckBox_0_C::BindedSuitability' has a wrong offset!");
static_assert(offsetof(UWBP_WorkSuitabilityPreference_CheckBox_0_C, IsBattleSettingMode) == 0x0002B1, "Member 'UWBP_WorkSuitabilityPreference_CheckBox_0_C::IsBattleSettingMode' has a wrong offset!");
static_assert(offsetof(UWBP_WorkSuitabilityPreference_CheckBox_0_C, OnHoveredCheckBox) == 0x0002B8, "Member 'UWBP_WorkSuitabilityPreference_CheckBox_0_C::OnHoveredCheckBox' has a wrong offset!");

}

