#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ConstructionListContent

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_ConstructionListContent.WBP_ConstructionListContent_C.AddWidget
// 0x0010 (0x0010 - 0x0000)
struct WBP_ConstructionListContent_C_AddWidget final
{
public:
	class UUserWidget*                            InWidgett;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWrapBoxSlot*                           CallFunc_AddChildToWrapBox_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConstructionListContent_C_AddWidget) == 0x000008, "Wrong alignment on WBP_ConstructionListContent_C_AddWidget");
static_assert(sizeof(WBP_ConstructionListContent_C_AddWidget) == 0x000010, "Wrong size on WBP_ConstructionListContent_C_AddWidget");
static_assert(offsetof(WBP_ConstructionListContent_C_AddWidget, InWidgett) == 0x000000, "Member 'WBP_ConstructionListContent_C_AddWidget::InWidgett' has a wrong offset!");
static_assert(offsetof(WBP_ConstructionListContent_C_AddWidget, CallFunc_AddChildToWrapBox_ReturnValue) == 0x000008, "Member 'WBP_ConstructionListContent_C_AddWidget::CallFunc_AddChildToWrapBox_ReturnValue' has a wrong offset!");

// Function WBP_ConstructionListContent.WBP_ConstructionListContent_C.SetCategoryName
// 0x0018 (0x0018 - 0x0000)
struct WBP_ConstructionListContent_C_SetCategoryName final
{
public:
	class FText                                   CategoryName;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ConstructionListContent_C_SetCategoryName) == 0x000008, "Wrong alignment on WBP_ConstructionListContent_C_SetCategoryName");
static_assert(sizeof(WBP_ConstructionListContent_C_SetCategoryName) == 0x000018, "Wrong size on WBP_ConstructionListContent_C_SetCategoryName");
static_assert(offsetof(WBP_ConstructionListContent_C_SetCategoryName, CategoryName) == 0x000000, "Member 'WBP_ConstructionListContent_C_SetCategoryName::CategoryName' has a wrong offset!");

}

