#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BuildProgress

#include "Basic.hpp"

#include "Pal_structs.hpp"


namespace SDK::Params
{

// Function WBP_BuildProgress.WBP_BuildProgress_C.ExecuteUbergraph_WBP_BuildProgress
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCompleted_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C5[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalWorkProgress*                       CallFunc_GetWorkProgress_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C6[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C7[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result_1; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue_1; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C8[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalWorkBase*                           K2Node_Event_targetWork;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C9[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPalIndividualCharacterSlot*>    CallFunc_GetAssignedCharacters_IndividualSlots;    // 0x0058(0x0010)(ReferenceParm)
	class UPalWorkProgress*                       K2Node_Event_Work;                                 // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRemainWorkAmount_ReturnValue;          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRemainWorkPredicateTime_ReturnValue;   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetProgressRate_ReturnValue;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47CA[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalBuildProcess*                       K2Node_Event_Process;                              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47CB[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDDispatchParameterBase*           CallFunc_GetParam_ReturnValue;                     // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalBuildProgressWorldHUDParameter*     K2Node_DynamicCast_AsPal_Build_Progress_World_HUDParameter; // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47CC[0x1];                                     // 0x00B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPalHUDDisplayType                            K2Node_CustomEvent_DisplayType;                    // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47CD[0x3];                                     // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPalHUDDisplayType DisplayType)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47CE[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Set_Work_Amount_workAmount_ImplicitCast;  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress) == 0x000008, "Wrong alignment on WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress");
static_assert(sizeof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress) == 0x0000E8, "Wrong size on WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, EntryPoint) == 0x000000, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, CallFunc_IsCompleted_ReturnValue) == 0x000004, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::CallFunc_IsCompleted_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, CallFunc_GetWorkProgress_ReturnValue) == 0x000008, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::CallFunc_GetWorkProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, Temp_bool_Has_Been_Initd_Variable) == 0x000011, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result) == 0x000018, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue) == 0x000020, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result_1) == 0x000030, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue_1) == 0x000038, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, CallFunc_IsValid_ReturnValue_2) == 0x000040, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, K2Node_Event_targetWork) == 0x000048, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::K2Node_Event_targetWork' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, CallFunc_IsValid_ReturnValue_3) == 0x000050, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, CallFunc_GetAssignedCharacters_IndividualSlots) == 0x000058, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::CallFunc_GetAssignedCharacters_IndividualSlots' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, K2Node_Event_Work) == 0x000068, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::K2Node_Event_Work' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, CallFunc_GetRemainWorkAmount_ReturnValue) == 0x000070, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::CallFunc_GetRemainWorkAmount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, CallFunc_GetRemainWorkPredicateTime_ReturnValue) == 0x000074, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::CallFunc_GetRemainWorkPredicateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, CallFunc_GetProgressRate_ReturnValue) == 0x000078, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::CallFunc_GetProgressRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, CallFunc_IsValid_ReturnValue_4) == 0x00007C, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, K2Node_Event_Process) == 0x000080, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::K2Node_Event_Process' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, Temp_bool_IsClosed_Variable) == 0x000088, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, CallFunc_GetParam_ReturnValue) == 0x000090, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::CallFunc_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, K2Node_CreateDelegate_OutputDelegate) == 0x000098, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, K2Node_DynamicCast_AsPal_Build_Progress_World_HUDParameter) == 0x0000A8, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::K2Node_DynamicCast_AsPal_Build_Progress_World_HUDParameter' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, CallFunc_IsValid_ReturnValue_5) == 0x0000B1, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, CallFunc_IsValid_ReturnValue_6) == 0x0000B2, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000B4, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, K2Node_CustomEvent_DisplayType) == 0x0000C4, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::K2Node_CustomEvent_DisplayType' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000C8, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, K2Node_SwitchEnum_CmpSuccess) == 0x0000D8, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress, CallFunc_Set_Work_Amount_workAmount_ImplicitCast) == 0x0000E0, "Member 'WBP_BuildProgress_C_ExecuteUbergraph_WBP_BuildProgress::CallFunc_Set_Work_Amount_workAmount_ImplicitCast' has a wrong offset!");

// Function WBP_BuildProgress.WBP_BuildProgress_C.OnRequestClose
// 0x0008 (0x0008 - 0x0000)
struct WBP_BuildProgress_C_OnRequestClose final
{
public:
	class UPalBuildProcess*                       Process;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuildProgress_C_OnRequestClose) == 0x000008, "Wrong alignment on WBP_BuildProgress_C_OnRequestClose");
static_assert(sizeof(WBP_BuildProgress_C_OnRequestClose) == 0x000008, "Wrong size on WBP_BuildProgress_C_OnRequestClose");
static_assert(offsetof(WBP_BuildProgress_C_OnRequestClose, Process) == 0x000000, "Member 'WBP_BuildProgress_C_OnRequestClose::Process' has a wrong offset!");

// Function WBP_BuildProgress.WBP_BuildProgress_C.OnUpdatedAssignCharacter
// 0x0008 (0x0008 - 0x0000)
struct WBP_BuildProgress_C_OnUpdatedAssignCharacter final
{
public:
	class UPalWorkBase*                           TargetWork;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuildProgress_C_OnUpdatedAssignCharacter) == 0x000008, "Wrong alignment on WBP_BuildProgress_C_OnUpdatedAssignCharacter");
static_assert(sizeof(WBP_BuildProgress_C_OnUpdatedAssignCharacter) == 0x000008, "Wrong size on WBP_BuildProgress_C_OnUpdatedAssignCharacter");
static_assert(offsetof(WBP_BuildProgress_C_OnUpdatedAssignCharacter, TargetWork) == 0x000000, "Member 'WBP_BuildProgress_C_OnUpdatedAssignCharacter::TargetWork' has a wrong offset!");

// Function WBP_BuildProgress.WBP_BuildProgress_C.SetProgress
// 0x0008 (0x0008 - 0x0000)
struct WBP_BuildProgress_C_SetProgress final
{
public:
	class UPalWorkProgress*                       Work;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuildProgress_C_SetProgress) == 0x000008, "Wrong alignment on WBP_BuildProgress_C_SetProgress");
static_assert(sizeof(WBP_BuildProgress_C_SetProgress) == 0x000008, "Wrong size on WBP_BuildProgress_C_SetProgress");
static_assert(offsetof(WBP_BuildProgress_C_SetProgress, Work) == 0x000000, "Member 'WBP_BuildProgress_C_SetProgress::Work' has a wrong offset!");

// Function WBP_BuildProgress.WBP_BuildProgress_C.ShowProgress
// 0x0001 (0x0001 - 0x0000)
struct WBP_BuildProgress_C_ShowProgress final
{
public:
	EPalHUDDisplayType                            DisplayType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BuildProgress_C_ShowProgress) == 0x000001, "Wrong alignment on WBP_BuildProgress_C_ShowProgress");
static_assert(sizeof(WBP_BuildProgress_C_ShowProgress) == 0x000001, "Wrong size on WBP_BuildProgress_C_ShowProgress");
static_assert(offsetof(WBP_BuildProgress_C_ShowProgress, DisplayType) == 0x000000, "Member 'WBP_BuildProgress_C_ShowProgress::DisplayType' has a wrong offset!");

}

