#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenu_Technology_00

#include "Basic.hpp"

#include "F_PalUITechnologyDataMapContent_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MainMenu_Technology_00.WBP_MainMenu_Technology_00_C
// 0x00C8 (0x0340 - 0x0278)
class UWBP_MainMenu_Technology_00_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_MainMenu_Technology_Point_C*       WBP_MainMenu_Technology_Point;                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MainMenu_Technology_Point_C*       WBP_MainMenu_Technology_Point_Boss;                // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalCommonScrollList_C*             WBP_PalCommonScrollList;                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<int32, struct FF_PalUITechnologyDataMapContent> TechnologyMap;                                     // 0x0298(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UWBP_MainMenu_Technology_List_C*> TechnologyListWidgetArray;                         // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	FMulticastInlineDelegateProperty_             OnClickedTchnology;                                // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnHoveredTechnology;                               // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnUnhoveredTechnology;                             // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         MaxTechnologyLevel;                                // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MinTechnologyLevel;                                // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_MainMenu_Technology_List_C*        LastHoveredListWidget;                             // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MainMenu_Technology_Content_C*     LastHoveredButtonWidget;                           // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void CreateTechnologyMap();
	class UWidget* CustomNavi_Down(EUINavigation Param_Navigation);
	class UWidget* CustomNavi_Up(EUINavigation Param_Navigation);
	void Destruct();
	void ExecuteUbergraph_WBP_MainMenu_Technology_00(int32 EntryPoint);
	void GetCustomNavigationTarget(int32 TargetListOffset, int32 NowListIndex, class UWidget** Widget);
	void GetTopFocusTarget(class UWidget** Target);
	void GetTopUnlockableFocusTarget(class UWidget** Target);
	void OnClickedAnyTechnology_Internal(class UWBP_MainMenu_Technology_Content_C* Widget);
	void OnClickedTchnology__DelegateSignature(class UWBP_MainMenu_Technology_Content_C* Widget);
	void OnHoveredAnyTechnology_Internal(class UWBP_MainMenu_Technology_Content_C* Widget, class UWBP_MainMenu_Technology_List_C* ListWidget);
	void OnHoveredTechnology__DelegateSignature(class UWBP_MainMenu_Technology_Content_C* Widget);
	void OnUnhoveredAnyTechnology_Internal(class UWBP_MainMenu_Technology_Content_C* Widget);
	void OnUnhoveredTechnology__DelegateSignature(class UWBP_MainMenu_Technology_Content_C* Widget);
	void Setup();
	void SetupTechnologyList();
	void UpdateAllTechnologyButton();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MainMenu_Technology_00_C">();
	}
	static class UWBP_MainMenu_Technology_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MainMenu_Technology_00_C>();
	}
};
static_assert(alignof(UWBP_MainMenu_Technology_00_C) == 0x000008, "Wrong alignment on UWBP_MainMenu_Technology_00_C");
static_assert(sizeof(UWBP_MainMenu_Technology_00_C) == 0x000340, "Wrong size on UWBP_MainMenu_Technology_00_C");
static_assert(offsetof(UWBP_MainMenu_Technology_00_C, UberGraphFrame) == 0x000278, "Member 'UWBP_MainMenu_Technology_00_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_00_C, WBP_MainMenu_Technology_Point) == 0x000280, "Member 'UWBP_MainMenu_Technology_00_C::WBP_MainMenu_Technology_Point' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_00_C, WBP_MainMenu_Technology_Point_Boss) == 0x000288, "Member 'UWBP_MainMenu_Technology_00_C::WBP_MainMenu_Technology_Point_Boss' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_00_C, WBP_PalCommonScrollList) == 0x000290, "Member 'UWBP_MainMenu_Technology_00_C::WBP_PalCommonScrollList' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_00_C, TechnologyMap) == 0x000298, "Member 'UWBP_MainMenu_Technology_00_C::TechnologyMap' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_00_C, TechnologyListWidgetArray) == 0x0002E8, "Member 'UWBP_MainMenu_Technology_00_C::TechnologyListWidgetArray' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_00_C, OnClickedTchnology) == 0x0002F8, "Member 'UWBP_MainMenu_Technology_00_C::OnClickedTchnology' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_00_C, OnHoveredTechnology) == 0x000308, "Member 'UWBP_MainMenu_Technology_00_C::OnHoveredTechnology' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_00_C, OnUnhoveredTechnology) == 0x000318, "Member 'UWBP_MainMenu_Technology_00_C::OnUnhoveredTechnology' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_00_C, MaxTechnologyLevel) == 0x000328, "Member 'UWBP_MainMenu_Technology_00_C::MaxTechnologyLevel' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_00_C, MinTechnologyLevel) == 0x00032C, "Member 'UWBP_MainMenu_Technology_00_C::MinTechnologyLevel' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_00_C, LastHoveredListWidget) == 0x000330, "Member 'UWBP_MainMenu_Technology_00_C::LastHoveredListWidget' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Technology_00_C, LastHoveredButtonWidget) == 0x000338, "Member 'UWBP_MainMenu_Technology_00_C::LastHoveredButtonWidget' has a wrong offset!");

}

