#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BuildProgress

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Pal_structs.hpp"
#include "Pal_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BuildProgress.WBP_BuildProgress_C
// 0x0018 (0x0428 - 0x0410)
class UWBP_BuildProgress_C final : public UPalUIBuildProgressWorldHUD
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_IngameProgress_C*                  WBP_IngameProgress;                                // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ProgressFinished;                                  // 0x0420(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ClosePanel();
	void Destruct();
	void ExecuteUbergraph_WBP_BuildProgress(int32 EntryPoint);
	void Finished_0A8F9BE3461D19DEC9F1BDA5236BDDCA();
	void Finished_C8A38F31462C1BFD0CAC6CAE7285A7E3();
	void OnRequestClose(class UPalBuildProcess* Process);
	void OnSetup();
	void OnUpdatedAssignCharacter(class UPalWorkBase* TargetWork);
	void SetProgress(class UPalWorkProgress* Work);
	void ShowProgress(EPalHUDDisplayType DisplayType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BuildProgress_C">();
	}
	static class UWBP_BuildProgress_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BuildProgress_C>();
	}
};
static_assert(alignof(UWBP_BuildProgress_C) == 0x000008, "Wrong alignment on UWBP_BuildProgress_C");
static_assert(sizeof(UWBP_BuildProgress_C) == 0x000428, "Wrong size on UWBP_BuildProgress_C");
static_assert(offsetof(UWBP_BuildProgress_C, UberGraphFrame) == 0x000410, "Member 'UWBP_BuildProgress_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_BuildProgress_C, WBP_IngameProgress) == 0x000418, "Member 'UWBP_BuildProgress_C::WBP_IngameProgress' has a wrong offset!");
static_assert(offsetof(UWBP_BuildProgress_C, ProgressFinished) == 0x000420, "Member 'UWBP_BuildProgress_C::ProgressFinished' has a wrong offset!");

}

