#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IngameMenuConstruction_info

#include "Basic.hpp"

#include "Pal_structs.hpp"


namespace SDK::Params
{

// Function WBP_IngameMenuConstruction_info.WBP_IngameMenuConstruction_info_C.Set Build Object Data
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_IngameMenuConstruction_info_C_Set_Build_Object_Data final
{
public:
	struct FPalBuildObjectData                    BuildObjectData;                                   // 0x0000(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 NewLocalVar_0;                                     // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_WorkAmountToManMonth_ReturnValue;         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_515A[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0098(0x0018)()
	class FText                                   CallFunc_GetBuildObjectDesc_outDesc;               // 0x00B0(0x0018)()
	class FText                                   CallFunc_GetMapObjectName_outName;                 // 0x00C8(0x0018)()
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenuConstruction_info_C_Set_Build_Object_Data) == 0x000008, "Wrong alignment on WBP_IngameMenuConstruction_info_C_Set_Build_Object_Data");
static_assert(sizeof(WBP_IngameMenuConstruction_info_C_Set_Build_Object_Data) == 0x0000E8, "Wrong size on WBP_IngameMenuConstruction_info_C_Set_Build_Object_Data");
static_assert(offsetof(WBP_IngameMenuConstruction_info_C_Set_Build_Object_Data, BuildObjectData) == 0x000000, "Member 'WBP_IngameMenuConstruction_info_C_Set_Build_Object_Data::BuildObjectData' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_info_C_Set_Build_Object_Data, NewLocalVar_0) == 0x000080, "Member 'WBP_IngameMenuConstruction_info_C_Set_Build_Object_Data::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_info_C_Set_Build_Object_Data, CallFunc_WorkAmountToManMonth_ReturnValue) == 0x000090, "Member 'WBP_IngameMenuConstruction_info_C_Set_Build_Object_Data::CallFunc_WorkAmountToManMonth_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_info_C_Set_Build_Object_Data, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000098, "Member 'WBP_IngameMenuConstruction_info_C_Set_Build_Object_Data::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_info_C_Set_Build_Object_Data, CallFunc_GetBuildObjectDesc_outDesc) == 0x0000B0, "Member 'WBP_IngameMenuConstruction_info_C_Set_Build_Object_Data::CallFunc_GetBuildObjectDesc_outDesc' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_info_C_Set_Build_Object_Data, CallFunc_GetMapObjectName_outName) == 0x0000C8, "Member 'WBP_IngameMenuConstruction_info_C_Set_Build_Object_Data::CallFunc_GetMapObjectName_outName' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_info_C_Set_Build_Object_Data, CallFunc_Conv_DoubleToText_Value_ImplicitCast) == 0x0000E0, "Member 'WBP_IngameMenuConstruction_info_C_Set_Build_Object_Data::CallFunc_Conv_DoubleToText_Value_ImplicitCast' has a wrong offset!");

// Function WBP_IngameMenuConstruction_info.WBP_IngameMenuConstruction_info_C.SetMaterialInfo
// 0x0020 (0x0020 - 0x0000)
struct WBP_IngameMenuConstruction_info_C_SetMaterialInfo final
{
public:
	class UWBP_IngameMenuConstruction_InfoItem_C* Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   ID;                                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NeedNum;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_515B[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Get_Useable_Material_Item_Num_Num;        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenuConstruction_info_C_SetMaterialInfo) == 0x000008, "Wrong alignment on WBP_IngameMenuConstruction_info_C_SetMaterialInfo");
static_assert(sizeof(WBP_IngameMenuConstruction_info_C_SetMaterialInfo) == 0x000020, "Wrong size on WBP_IngameMenuConstruction_info_C_SetMaterialInfo");
static_assert(offsetof(WBP_IngameMenuConstruction_info_C_SetMaterialInfo, Widget) == 0x000000, "Member 'WBP_IngameMenuConstruction_info_C_SetMaterialInfo::Widget' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_info_C_SetMaterialInfo, ID) == 0x000008, "Member 'WBP_IngameMenuConstruction_info_C_SetMaterialInfo::ID' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_info_C_SetMaterialInfo, NeedNum) == 0x000010, "Member 'WBP_IngameMenuConstruction_info_C_SetMaterialInfo::NeedNum' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_info_C_SetMaterialInfo, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'WBP_IngameMenuConstruction_info_C_SetMaterialInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_info_C_SetMaterialInfo, CallFunc_Get_Useable_Material_Item_Num_Num) == 0x000018, "Member 'WBP_IngameMenuConstruction_info_C_SetMaterialInfo::CallFunc_Get_Useable_Material_Item_Num_Num' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_info_C_SetMaterialInfo, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_IngameMenuConstruction_info_C_SetMaterialInfo::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_info_C_SetMaterialInfo, CallFunc_NotEqual_NameName_ReturnValue) == 0x00001D, "Member 'WBP_IngameMenuConstruction_info_C_SetMaterialInfo::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_info_C_SetMaterialInfo, CallFunc_BooleanAND_ReturnValue) == 0x00001E, "Member 'WBP_IngameMenuConstruction_info_C_SetMaterialInfo::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_IngameMenuConstruction_info.WBP_IngameMenuConstruction_info_C.Get Useable Material Item Num
// 0x0048 (0x0048 - 0x0000)
struct WBP_IngameMenuConstruction_info_C_Get_Useable_Material_Item_Num final
{
public:
	class FName                                   ItemId;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Num;                                               // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_515C[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
	TArray<struct FPalStaticItemIdAndNum>         CallFunc_CollectLocalPlayerControllableItemInfos_OutItemInfos; // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPalStaticItemIdAndNum                 CallFunc_Array_Get_Item;                           // 0x0034(0x000C)(NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenuConstruction_info_C_Get_Useable_Material_Item_Num) == 0x000008, "Wrong alignment on WBP_IngameMenuConstruction_info_C_Get_Useable_Material_Item_Num");
static_assert(sizeof(WBP_IngameMenuConstruction_info_C_Get_Useable_Material_Item_Num) == 0x000048, "Wrong size on WBP_IngameMenuConstruction_info_C_Get_Useable_Material_Item_Num");
static_assert(offsetof(WBP_IngameMenuConstruction_info_C_Get_Useable_Material_Item_Num, ItemId) == 0x000000, "Member 'WBP_IngameMenuConstruction_info_C_Get_Useable_Material_Item_Num::ItemId' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_info_C_Get_Useable_Material_Item_Num, Num) == 0x000008, "Member 'WBP_IngameMenuConstruction_info_C_Get_Useable_Material_Item_Num::Num' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_info_C_Get_Useable_Material_Item_Num, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_IngameMenuConstruction_info_C_Get_Useable_Material_Item_Num::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_info_C_Get_Useable_Material_Item_Num, CallFunc_CollectLocalPlayerControllableItemInfos_OutItemInfos) == 0x000020, "Member 'WBP_IngameMenuConstruction_info_C_Get_Useable_Material_Item_Num::CallFunc_CollectLocalPlayerControllableItemInfos_OutItemInfos' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_info_C_Get_Useable_Material_Item_Num, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_IngameMenuConstruction_info_C_Get_Useable_Material_Item_Num::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_info_C_Get_Useable_Material_Item_Num, CallFunc_Array_Get_Item) == 0x000034, "Member 'WBP_IngameMenuConstruction_info_C_Get_Useable_Material_Item_Num::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenuConstruction_info_C_Get_Useable_Material_Item_Num, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000040, "Member 'WBP_IngameMenuConstruction_info_C_Get_Useable_Material_Item_Num::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

}

