#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerRadialMenu

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Pal_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_PlayerRadialMenu.WBP_PlayerRadialMenu_C.BindPlayerActionMenuEvent
// 0x0050 (0x0050 - 0x0000)
struct WBP_PlayerRadialMenu_C_BindPlayerActionMenuEvent final
{
public:
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPalDamageResult& DamageResult)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalOtomoHolderComponentBase*           CallFunc_GetOtomoHolderComponent_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_OtomoPalHolderComponent_C*          K2Node_DynamicCast_AsBP_Otomo_Pal_Holder_Component; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerRadialMenu_C_BindPlayerActionMenuEvent) == 0x000008, "Wrong alignment on WBP_PlayerRadialMenu_C_BindPlayerActionMenuEvent");
static_assert(sizeof(WBP_PlayerRadialMenu_C_BindPlayerActionMenuEvent) == 0x000050, "Wrong size on WBP_PlayerRadialMenu_C_BindPlayerActionMenuEvent");
static_assert(offsetof(WBP_PlayerRadialMenu_C_BindPlayerActionMenuEvent, CallFunc_GetPalmi_ReturnValue) == 0x000000, "Member 'WBP_PlayerRadialMenu_C_BindPlayerActionMenuEvent::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_BindPlayerActionMenuEvent, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_PlayerRadialMenu_C_BindPlayerActionMenuEvent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_BindPlayerActionMenuEvent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WBP_PlayerRadialMenu_C_BindPlayerActionMenuEvent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_BindPlayerActionMenuEvent, K2Node_CreateDelegate_OutputDelegate_2) == 0x000028, "Member 'WBP_PlayerRadialMenu_C_BindPlayerActionMenuEvent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_BindPlayerActionMenuEvent, CallFunc_GetOtomoHolderComponent_ReturnValue) == 0x000038, "Member 'WBP_PlayerRadialMenu_C_BindPlayerActionMenuEvent::CallFunc_GetOtomoHolderComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_BindPlayerActionMenuEvent, K2Node_DynamicCast_AsBP_Otomo_Pal_Holder_Component) == 0x000040, "Member 'WBP_PlayerRadialMenu_C_BindPlayerActionMenuEvent::K2Node_DynamicCast_AsBP_Otomo_Pal_Holder_Component' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_BindPlayerActionMenuEvent, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_PlayerRadialMenu_C_BindPlayerActionMenuEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_PlayerRadialMenu.WBP_PlayerRadialMenu_C.Can Open Player Action Menu
// 0x0050 (0x0050 - 0x0000)
struct WBP_PlayerRadialMenu_C_Can_Open_Player_Action_Menu final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2315[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2316[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalStatusBase*                         CallFunc_GetExecutionStatus_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2317[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue_1;                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsExecuting_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2318[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerController*                   K2Node_DynamicCast_AsPal_Player_Controller;        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRiding_ReturnValue;                     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerRadialMenu_C_Can_Open_Player_Action_Menu) == 0x000008, "Wrong alignment on WBP_PlayerRadialMenu_C_Can_Open_Player_Action_Menu");
static_assert(sizeof(WBP_PlayerRadialMenu_C_Can_Open_Player_Action_Menu) == 0x000050, "Wrong size on WBP_PlayerRadialMenu_C_Can_Open_Player_Action_Menu");
static_assert(offsetof(WBP_PlayerRadialMenu_C_Can_Open_Player_Action_Menu, Result) == 0x000000, "Member 'WBP_PlayerRadialMenu_C_Can_Open_Player_Action_Menu::Result' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_Can_Open_Player_Action_Menu, CallFunc_GetPalmi_ReturnValue) == 0x000008, "Member 'WBP_PlayerRadialMenu_C_Can_Open_Player_Action_Menu::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_Can_Open_Player_Action_Menu, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_PlayerRadialMenu_C_Can_Open_Player_Action_Menu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_Can_Open_Player_Action_Menu, CallFunc_GetExecutionStatus_ReturnValue) == 0x000018, "Member 'WBP_PlayerRadialMenu_C_Can_Open_Player_Action_Menu::CallFunc_GetExecutionStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_Can_Open_Player_Action_Menu, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'WBP_PlayerRadialMenu_C_Can_Open_Player_Action_Menu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_Can_Open_Player_Action_Menu, CallFunc_GetPalmi_ReturnValue_1) == 0x000028, "Member 'WBP_PlayerRadialMenu_C_Can_Open_Player_Action_Menu::CallFunc_GetPalmi_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_Can_Open_Player_Action_Menu, CallFunc_IsValid_ReturnValue_2) == 0x000030, "Member 'WBP_PlayerRadialMenu_C_Can_Open_Player_Action_Menu::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_Can_Open_Player_Action_Menu, CallFunc_IsExecuting_ReturnValue) == 0x000031, "Member 'WBP_PlayerRadialMenu_C_Can_Open_Player_Action_Menu::CallFunc_IsExecuting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_Can_Open_Player_Action_Menu, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000038, "Member 'WBP_PlayerRadialMenu_C_Can_Open_Player_Action_Menu::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_Can_Open_Player_Action_Menu, K2Node_DynamicCast_AsPal_Player_Controller) == 0x000040, "Member 'WBP_PlayerRadialMenu_C_Can_Open_Player_Action_Menu::K2Node_DynamicCast_AsPal_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_Can_Open_Player_Action_Menu, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_PlayerRadialMenu_C_Can_Open_Player_Action_Menu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_Can_Open_Player_Action_Menu, CallFunc_IsRiding_ReturnValue) == 0x000049, "Member 'WBP_PlayerRadialMenu_C_Can_Open_Player_Action_Menu::CallFunc_IsRiding_ReturnValue' has a wrong offset!");

// Function WBP_PlayerRadialMenu.WBP_PlayerRadialMenu_C.CloseConstructionMenu
// 0x0020 (0x0020 - 0x0000)
struct WBP_PlayerRadialMenu_C_CloseConstructionMenu final
{
public:
	class UWBP_IngameMenuConstruction_Radial_C*   Menu;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         FindIndex;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2319[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDService*                         CallFunc_GetHUDService_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerRadialMenu_C_CloseConstructionMenu) == 0x000008, "Wrong alignment on WBP_PlayerRadialMenu_C_CloseConstructionMenu");
static_assert(sizeof(WBP_PlayerRadialMenu_C_CloseConstructionMenu) == 0x000020, "Wrong size on WBP_PlayerRadialMenu_C_CloseConstructionMenu");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CloseConstructionMenu, Menu) == 0x000000, "Member 'WBP_PlayerRadialMenu_C_CloseConstructionMenu::Menu' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CloseConstructionMenu, FindIndex) == 0x000008, "Member 'WBP_PlayerRadialMenu_C_CloseConstructionMenu::FindIndex' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CloseConstructionMenu, CallFunc_GetHUDService_ReturnValue) == 0x000010, "Member 'WBP_PlayerRadialMenu_C_CloseConstructionMenu::CallFunc_GetHUDService_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CloseConstructionMenu, CallFunc_RemoveChild_ReturnValue) == 0x000018, "Member 'WBP_PlayerRadialMenu_C_CloseConstructionMenu::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CloseConstructionMenu, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'WBP_PlayerRadialMenu_C_CloseConstructionMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_PlayerRadialMenu.WBP_PlayerRadialMenu_C.CloseMenu
// 0x0010 (0x0010 - 0x0000)
struct WBP_PlayerRadialMenu_C_CloseMenu final
{
public:
	class UPalHUDService*                         CallFunc_GetHUDService_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasConstructionMenu_HasMenu;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerRadialMenu_C_CloseMenu) == 0x000008, "Wrong alignment on WBP_PlayerRadialMenu_C_CloseMenu");
static_assert(sizeof(WBP_PlayerRadialMenu_C_CloseMenu) == 0x000010, "Wrong size on WBP_PlayerRadialMenu_C_CloseMenu");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CloseMenu, CallFunc_GetHUDService_ReturnValue) == 0x000000, "Member 'WBP_PlayerRadialMenu_C_CloseMenu::CallFunc_GetHUDService_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CloseMenu, CallFunc_HasConstructionMenu_HasMenu) == 0x000008, "Member 'WBP_PlayerRadialMenu_C_CloseMenu::CallFunc_HasConstructionMenu_HasMenu' has a wrong offset!");

// Function WBP_PlayerRadialMenu.WBP_PlayerRadialMenu_C.CloseSetup
// 0x0028 (0x0028 - 0x0000)
struct WBP_PlayerRadialMenu_C_CloseSetup final
{
public:
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalShooterComponent*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerController*                   K2Node_DynamicCast_AsPal_Player_Controller;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerRadialMenu_C_CloseSetup) == 0x000008, "Wrong alignment on WBP_PlayerRadialMenu_C_CloseSetup");
static_assert(sizeof(WBP_PlayerRadialMenu_C_CloseSetup) == 0x000028, "Wrong size on WBP_PlayerRadialMenu_C_CloseSetup");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CloseSetup, CallFunc_GetPalmi_ReturnValue) == 0x000000, "Member 'WBP_PlayerRadialMenu_C_CloseSetup::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CloseSetup, CallFunc_GetComponentByClass_ReturnValue) == 0x000008, "Member 'WBP_PlayerRadialMenu_C_CloseSetup::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CloseSetup, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000010, "Member 'WBP_PlayerRadialMenu_C_CloseSetup::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CloseSetup, K2Node_DynamicCast_AsPal_Player_Controller) == 0x000018, "Member 'WBP_PlayerRadialMenu_C_CloseSetup::K2Node_DynamicCast_AsPal_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CloseSetup, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_PlayerRadialMenu_C_CloseSetup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CloseSetup, K2Node_SwitchEnum_CmpSuccess) == 0x000021, "Member 'WBP_PlayerRadialMenu_C_CloseSetup::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_PlayerRadialMenu.WBP_PlayerRadialMenu_C.CreateConstructionMenu
// 0x0040 (0x0040 - 0x0000)
struct WBP_PlayerRadialMenu_C_CreateConstructionMenu final
{
public:
	class UWBP_IngameMenuConstruction_Radial_C*   CreatedWidget;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0018(0x0020)(NoDestructor)
	class UWBP_IngameMenuConstruction_Radial_C*   CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerRadialMenu_C_CreateConstructionMenu) == 0x000008, "Wrong alignment on WBP_PlayerRadialMenu_C_CreateConstructionMenu");
static_assert(sizeof(WBP_PlayerRadialMenu_C_CreateConstructionMenu) == 0x000040, "Wrong size on WBP_PlayerRadialMenu_C_CreateConstructionMenu");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateConstructionMenu, CreatedWidget) == 0x000000, "Member 'WBP_PlayerRadialMenu_C_CreateConstructionMenu::CreatedWidget' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateConstructionMenu, CallFunc_AddChildToCanvas_ReturnValue) == 0x000008, "Member 'WBP_PlayerRadialMenu_C_CreateConstructionMenu::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateConstructionMenu, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000010, "Member 'WBP_PlayerRadialMenu_C_CreateConstructionMenu::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateConstructionMenu, K2Node_MakeStruct_Anchors) == 0x000018, "Member 'WBP_PlayerRadialMenu_C_CreateConstructionMenu::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateConstructionMenu, CallFunc_Create_ReturnValue) == 0x000038, "Member 'WBP_PlayerRadialMenu_C_CreateConstructionMenu::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WBP_PlayerRadialMenu.WBP_PlayerRadialMenu_C.CreateEmoteMenu
// 0x0140 (0x0140 - 0x0000)
struct WBP_PlayerRadialMenu_C_CreateEmoteMenu final
{
public:
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text;          // 0x0000(0x0018)()
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_1;        // 0x0018(0x0018)()
	class UWBP_PlayerRadialMenu_MenuContent_C*    CallFunc_CreateInstructionsAdditionalWidget_createdWidget; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PlayerRadialMenu_MenuContent_C*    CallFunc_CreateInstructionsAdditionalWidget_createdWidget_1; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_2;        // 0x0040(0x0018)()
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_3;        // 0x0058(0x0018)()
	class UWBP_PlayerRadialMenu_MenuContent_C*    CallFunc_CreateInstructionsAdditionalWidget_createdWidget_2; // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PlayerRadialMenu_MenuContent_C*    CallFunc_CreateInstructionsAdditionalWidget_createdWidget_3; // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_4;        // 0x0080(0x0018)()
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_5;        // 0x0098(0x0018)()
	class UWBP_PlayerRadialMenu_MenuContent_C*    CallFunc_CreateInstructionsAdditionalWidget_createdWidget_4; // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PlayerRadialMenu_MenuContent_C*    CallFunc_CreateInstructionsAdditionalWidget_createdWidget_5; // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_Set_Additional_Widget_Canvas;             // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_Set_Additional_Widget_Canvas_1;           // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_Set_Additional_Widget_Canvas_2;           // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_Set_Additional_Widget_Canvas_3;           // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_Set_Additional_Widget_Canvas_4;           // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_Set_Additional_Widget_Canvas_5;           // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_6;        // 0x00F0(0x0018)()
	class UWBP_PlayerRadialMenu_MenuContent_C*    CallFunc_CreateInstructionsAdditionalWidget_createdWidget_6; // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_7;        // 0x0110(0x0018)()
	class UCanvasPanelSlot*                       CallFunc_Set_Additional_Widget_Canvas_6;           // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PlayerRadialMenu_MenuContent_C*    CallFunc_CreateInstructionsAdditionalWidget_createdWidget_7; // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_Set_Additional_Widget_Canvas_7;           // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerRadialMenu_C_CreateEmoteMenu) == 0x000008, "Wrong alignment on WBP_PlayerRadialMenu_C_CreateEmoteMenu");
static_assert(sizeof(WBP_PlayerRadialMenu_C_CreateEmoteMenu) == 0x000140, "Wrong size on WBP_PlayerRadialMenu_C_CreateEmoteMenu");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateEmoteMenu, CallFunc_GetLocalizedTextFromHandle_Text) == 0x000000, "Member 'WBP_PlayerRadialMenu_C_CreateEmoteMenu::CallFunc_GetLocalizedTextFromHandle_Text' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateEmoteMenu, CallFunc_GetLocalizedTextFromHandle_Text_1) == 0x000018, "Member 'WBP_PlayerRadialMenu_C_CreateEmoteMenu::CallFunc_GetLocalizedTextFromHandle_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateEmoteMenu, CallFunc_CreateInstructionsAdditionalWidget_createdWidget) == 0x000030, "Member 'WBP_PlayerRadialMenu_C_CreateEmoteMenu::CallFunc_CreateInstructionsAdditionalWidget_createdWidget' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateEmoteMenu, CallFunc_CreateInstructionsAdditionalWidget_createdWidget_1) == 0x000038, "Member 'WBP_PlayerRadialMenu_C_CreateEmoteMenu::CallFunc_CreateInstructionsAdditionalWidget_createdWidget_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateEmoteMenu, CallFunc_GetLocalizedTextFromHandle_Text_2) == 0x000040, "Member 'WBP_PlayerRadialMenu_C_CreateEmoteMenu::CallFunc_GetLocalizedTextFromHandle_Text_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateEmoteMenu, CallFunc_GetLocalizedTextFromHandle_Text_3) == 0x000058, "Member 'WBP_PlayerRadialMenu_C_CreateEmoteMenu::CallFunc_GetLocalizedTextFromHandle_Text_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateEmoteMenu, CallFunc_CreateInstructionsAdditionalWidget_createdWidget_2) == 0x000070, "Member 'WBP_PlayerRadialMenu_C_CreateEmoteMenu::CallFunc_CreateInstructionsAdditionalWidget_createdWidget_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateEmoteMenu, CallFunc_CreateInstructionsAdditionalWidget_createdWidget_3) == 0x000078, "Member 'WBP_PlayerRadialMenu_C_CreateEmoteMenu::CallFunc_CreateInstructionsAdditionalWidget_createdWidget_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateEmoteMenu, CallFunc_GetLocalizedTextFromHandle_Text_4) == 0x000080, "Member 'WBP_PlayerRadialMenu_C_CreateEmoteMenu::CallFunc_GetLocalizedTextFromHandle_Text_4' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateEmoteMenu, CallFunc_GetLocalizedTextFromHandle_Text_5) == 0x000098, "Member 'WBP_PlayerRadialMenu_C_CreateEmoteMenu::CallFunc_GetLocalizedTextFromHandle_Text_5' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateEmoteMenu, CallFunc_CreateInstructionsAdditionalWidget_createdWidget_4) == 0x0000B0, "Member 'WBP_PlayerRadialMenu_C_CreateEmoteMenu::CallFunc_CreateInstructionsAdditionalWidget_createdWidget_4' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateEmoteMenu, CallFunc_CreateInstructionsAdditionalWidget_createdWidget_5) == 0x0000B8, "Member 'WBP_PlayerRadialMenu_C_CreateEmoteMenu::CallFunc_CreateInstructionsAdditionalWidget_createdWidget_5' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateEmoteMenu, CallFunc_Set_Additional_Widget_Canvas) == 0x0000C0, "Member 'WBP_PlayerRadialMenu_C_CreateEmoteMenu::CallFunc_Set_Additional_Widget_Canvas' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateEmoteMenu, CallFunc_Set_Additional_Widget_Canvas_1) == 0x0000C8, "Member 'WBP_PlayerRadialMenu_C_CreateEmoteMenu::CallFunc_Set_Additional_Widget_Canvas_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateEmoteMenu, CallFunc_Set_Additional_Widget_Canvas_2) == 0x0000D0, "Member 'WBP_PlayerRadialMenu_C_CreateEmoteMenu::CallFunc_Set_Additional_Widget_Canvas_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateEmoteMenu, CallFunc_Set_Additional_Widget_Canvas_3) == 0x0000D8, "Member 'WBP_PlayerRadialMenu_C_CreateEmoteMenu::CallFunc_Set_Additional_Widget_Canvas_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateEmoteMenu, CallFunc_Set_Additional_Widget_Canvas_4) == 0x0000E0, "Member 'WBP_PlayerRadialMenu_C_CreateEmoteMenu::CallFunc_Set_Additional_Widget_Canvas_4' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateEmoteMenu, CallFunc_Set_Additional_Widget_Canvas_5) == 0x0000E8, "Member 'WBP_PlayerRadialMenu_C_CreateEmoteMenu::CallFunc_Set_Additional_Widget_Canvas_5' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateEmoteMenu, CallFunc_GetLocalizedTextFromHandle_Text_6) == 0x0000F0, "Member 'WBP_PlayerRadialMenu_C_CreateEmoteMenu::CallFunc_GetLocalizedTextFromHandle_Text_6' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateEmoteMenu, CallFunc_CreateInstructionsAdditionalWidget_createdWidget_6) == 0x000108, "Member 'WBP_PlayerRadialMenu_C_CreateEmoteMenu::CallFunc_CreateInstructionsAdditionalWidget_createdWidget_6' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateEmoteMenu, CallFunc_GetLocalizedTextFromHandle_Text_7) == 0x000110, "Member 'WBP_PlayerRadialMenu_C_CreateEmoteMenu::CallFunc_GetLocalizedTextFromHandle_Text_7' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateEmoteMenu, CallFunc_Set_Additional_Widget_Canvas_6) == 0x000128, "Member 'WBP_PlayerRadialMenu_C_CreateEmoteMenu::CallFunc_Set_Additional_Widget_Canvas_6' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateEmoteMenu, CallFunc_CreateInstructionsAdditionalWidget_createdWidget_7) == 0x000130, "Member 'WBP_PlayerRadialMenu_C_CreateEmoteMenu::CallFunc_CreateInstructionsAdditionalWidget_createdWidget_7' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateEmoteMenu, CallFunc_Set_Additional_Widget_Canvas_7) == 0x000138, "Member 'WBP_PlayerRadialMenu_C_CreateEmoteMenu::CallFunc_Set_Additional_Widget_Canvas_7' has a wrong offset!");

// Function WBP_PlayerRadialMenu.WBP_PlayerRadialMenu_C.CreateInstructionsAdditionalWidget
// 0x0030 (0x0030 - 0x0000)
struct WBP_PlayerRadialMenu_C_CreateInstructionsAdditionalWidget final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWBP_PlayerRadialMenu_MenuContent_C*    CreatedWidget;                                     // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_PlayerRadialMenu_MenuContent_C*    CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerRadialMenu_C_CreateInstructionsAdditionalWidget) == 0x000008, "Wrong alignment on WBP_PlayerRadialMenu_C_CreateInstructionsAdditionalWidget");
static_assert(sizeof(WBP_PlayerRadialMenu_C_CreateInstructionsAdditionalWidget) == 0x000030, "Wrong size on WBP_PlayerRadialMenu_C_CreateInstructionsAdditionalWidget");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateInstructionsAdditionalWidget, InText) == 0x000000, "Member 'WBP_PlayerRadialMenu_C_CreateInstructionsAdditionalWidget::InText' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateInstructionsAdditionalWidget, CreatedWidget) == 0x000018, "Member 'WBP_PlayerRadialMenu_C_CreateInstructionsAdditionalWidget::CreatedWidget' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateInstructionsAdditionalWidget, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000020, "Member 'WBP_PlayerRadialMenu_C_CreateInstructionsAdditionalWidget::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreateInstructionsAdditionalWidget, CallFunc_Create_ReturnValue) == 0x000028, "Member 'WBP_PlayerRadialMenu_C_CreateInstructionsAdditionalWidget::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WBP_PlayerRadialMenu.WBP_PlayerRadialMenu_C.CreatePlayerActionMenu
// 0x0318 (0x0318 - 0x0000)
struct WBP_PlayerRadialMenu_C_CreatePlayerActionMenu final
{
public:
	struct FDataTableRowHandle                    TmpMsgID;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, NoDestructor)
	class FString                                 OtomoNickName;                                     // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FSlateColor                            TextColor_NothingOtomo;                            // 0x0020(0x0014)(Edit, BlueprintVisible)
	uint8                                         Pad_231A[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          SpawnedOtomo;                                      // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOtomoActivated;                                  // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231B[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text;          // 0x0048(0x0018)()
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_1;        // 0x0068(0x0018)()
	class APalWeaponBase*                         CallFunc_GetHasWeapon_ReturnValue;                 // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_PlayerRadialMenu_MenuContent_C*    CallFunc_CreateInstructionsAdditionalWidget_createdWidget; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_MeatCutterKnife_C*                  K2Node_DynamicCast_AsBP_Meat_Cutter_Knife;         // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231C[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_Set_Additional_Widget_Canvas;             // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_2;        // 0x00A8(0x0018)()
	class UWBP_PlayerRadialMenu_MenuContent_C*    CallFunc_CreateInstructionsAdditionalWidget_createdWidget_1; // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_Set_Additional_Widget_Canvas_1;           // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_3;        // 0x00D0(0x0018)()
	class UWBP_PlayerRadialMenu_MenuContent_C*    CallFunc_CreateInstructionsAdditionalWidget_createdWidget_2; // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_Set_Additional_Widget_Canvas_2;           // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_4;        // 0x00F8(0x0018)()
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_5;        // 0x0110(0x0018)()
	class UWBP_PlayerRadialMenu_MenuContent_C*    CallFunc_CreateInstructionsAdditionalWidget_createdWidget_3; // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PlayerRadialMenu_MenuContent_C*    CallFunc_CreateInstructionsAdditionalWidget_createdWidget_4; // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_Set_Additional_Widget_Canvas_3;           // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0140(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0158(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01A8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01B8(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01D0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01E8(0x0050)(HasGetValueTypeHash)
	class UWBP_PlayerRadialMenu_MenuContent_C*    CallFunc_CreateInstructionsAdditionalWidget_createdWidget_5; // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0240(0x0010)(ReferenceParm)
	class UCanvasPanelSlot*                       CallFunc_Set_Additional_Widget_Canvas_4;           // 0x0250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_6;        // 0x0258(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0270(0x0018)()
	class UWBP_PlayerRadialMenu_MenuContent_C*    CallFunc_CreateInstructionsAdditionalWidget_createdWidget_6; // 0x0288(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_Set_Additional_Widget_Canvas_5;           // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_Set_Additional_Widget_Canvas_6;           // 0x0298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPalOtomoHolderComponentBase*           CallFunc_GetOtomoHolderComponent_ReturnValue;      // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231D[0x7];                                     // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_7;        // 0x02B0(0x0018)()
	class UWBP_PlayerRadialMenu_MenuContent_C*    CallFunc_CreateInstructionsAdditionalWidget_createdWidget_7; // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_TryGetSpawnedOtomo_ReturnValue;           // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231E[0x7];                                     // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalCharacterParameterComponent*        CallFunc_GetCharacterParameterComponent_ReturnValue; // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231F[0x6];                                     // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterParameter*       CallFunc_TryGetIndividualParameter_ReturnValue;    // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2320[0x7];                                     // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetNickName_outName;                      // 0x0300(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_Set_Additional_Widget_Canvas_7;           // 0x0310(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu) == 0x000008, "Wrong alignment on WBP_PlayerRadialMenu_C_CreatePlayerActionMenu");
static_assert(sizeof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu) == 0x000318, "Wrong size on WBP_PlayerRadialMenu_C_CreatePlayerActionMenu");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, TmpMsgID) == 0x000000, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::TmpMsgID' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, OtomoNickName) == 0x000010, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::OtomoNickName' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, TextColor_NothingOtomo) == 0x000020, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::TextColor_NothingOtomo' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, SpawnedOtomo) == 0x000038, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::SpawnedOtomo' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, IsOtomoActivated) == 0x000040, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::IsOtomoActivated' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_GetLocalizedTextFromHandle_Text) == 0x000048, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_GetLocalizedTextFromHandle_Text' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_GetPalmi_ReturnValue) == 0x000060, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_GetLocalizedTextFromHandle_Text_1) == 0x000068, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_GetLocalizedTextFromHandle_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_GetHasWeapon_ReturnValue) == 0x000080, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_GetHasWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_CreateInstructionsAdditionalWidget_createdWidget) == 0x000088, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_CreateInstructionsAdditionalWidget_createdWidget' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, K2Node_DynamicCast_AsBP_Meat_Cutter_Knife) == 0x000090, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::K2Node_DynamicCast_AsBP_Meat_Cutter_Knife' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_Set_Additional_Widget_Canvas) == 0x0000A0, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_Set_Additional_Widget_Canvas' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_GetLocalizedTextFromHandle_Text_2) == 0x0000A8, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_GetLocalizedTextFromHandle_Text_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_CreateInstructionsAdditionalWidget_createdWidget_1) == 0x0000C0, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_CreateInstructionsAdditionalWidget_createdWidget_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_Set_Additional_Widget_Canvas_1) == 0x0000C8, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_Set_Additional_Widget_Canvas_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_GetLocalizedTextFromHandle_Text_3) == 0x0000D0, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_GetLocalizedTextFromHandle_Text_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_CreateInstructionsAdditionalWidget_createdWidget_2) == 0x0000E8, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_CreateInstructionsAdditionalWidget_createdWidget_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_Set_Additional_Widget_Canvas_2) == 0x0000F0, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_Set_Additional_Widget_Canvas_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_GetLocalizedTextFromHandle_Text_4) == 0x0000F8, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_GetLocalizedTextFromHandle_Text_4' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_GetLocalizedTextFromHandle_Text_5) == 0x000110, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_GetLocalizedTextFromHandle_Text_5' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_CreateInstructionsAdditionalWidget_createdWidget_3) == 0x000128, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_CreateInstructionsAdditionalWidget_createdWidget_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_CreateInstructionsAdditionalWidget_createdWidget_4) == 0x000130, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_CreateInstructionsAdditionalWidget_createdWidget_4' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_Set_Additional_Widget_Canvas_3) == 0x000138, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_Set_Additional_Widget_Canvas_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_Conv_StringToText_ReturnValue) == 0x000140, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, K2Node_MakeStruct_FormatArgumentData) == 0x000158, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, K2Node_MakeArray_Array) == 0x0001A8, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0001B8, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_Format_ReturnValue) == 0x0001D0, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001E8, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_CreateInstructionsAdditionalWidget_createdWidget_5) == 0x000238, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_CreateInstructionsAdditionalWidget_createdWidget_5' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, K2Node_MakeArray_Array_1) == 0x000240, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_Set_Additional_Widget_Canvas_4) == 0x000250, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_Set_Additional_Widget_Canvas_4' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_GetLocalizedTextFromHandle_Text_6) == 0x000258, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_GetLocalizedTextFromHandle_Text_6' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_Format_ReturnValue_1) == 0x000270, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_CreateInstructionsAdditionalWidget_createdWidget_6) == 0x000288, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_CreateInstructionsAdditionalWidget_createdWidget_6' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_Set_Additional_Widget_Canvas_5) == 0x000290, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_Set_Additional_Widget_Canvas_5' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_Set_Additional_Widget_Canvas_6) == 0x000298, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_Set_Additional_Widget_Canvas_6' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_GetOtomoHolderComponent_ReturnValue) == 0x0002A0, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_GetOtomoHolderComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_IsValid_ReturnValue) == 0x0002A8, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_GetLocalizedTextFromHandle_Text_7) == 0x0002B0, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_GetLocalizedTextFromHandle_Text_7' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_CreateInstructionsAdditionalWidget_createdWidget_7) == 0x0002C8, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_CreateInstructionsAdditionalWidget_createdWidget_7' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_TryGetSpawnedOtomo_ReturnValue) == 0x0002D0, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_TryGetSpawnedOtomo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_IsValid_ReturnValue_1) == 0x0002D8, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_GetCharacterParameterComponent_ReturnValue) == 0x0002E0, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_GetCharacterParameterComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_IsValid_ReturnValue_2) == 0x0002E8, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_IsValid_ReturnValue_3) == 0x0002E9, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_TryGetIndividualParameter_ReturnValue) == 0x0002F0, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_TryGetIndividualParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_IsValid_ReturnValue_4) == 0x0002F8, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_GetNickName_outName) == 0x000300, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_GetNickName_outName' has a wrong offset!");
static_assert(offsetof(WBP_PlayerRadialMenu_C_CreatePlayerActionMenu, CallFunc_Set_Additional_Widget_Canvas_7) == 0x000310, "Member 'WBP_PlayerRadialMenu_C_CreatePlayerActionMenu::CallFunc_Set_Additional_Widget_Canvas_7' has a wrong offset!");

// Function WBP_PlayerRadialMenu.WBP_PlayerRadialMenu_C.ExecuteUbergraph_WBP_PlayerRadialMenu
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_PlayerRadialMenu_C_ExecuteUbergraph_WBP_PlayerRadialMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2321[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDService*                         CallFunc_GetHUDService_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGuid& PushedWidgetID)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2322[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalRiderComponent*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2323[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* RideActor)>      K2Node_CreateDelegate_OutputDelegate_2;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2324[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2325[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalPlayerController*                   K2Node_DynamicCast_AsPal_Player_Controller;        // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2326[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue_1;   // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2327[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalPlayerController*                   K2Node_DynamicCast_AsPal_Player_Controller_1;      // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2328[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue_2;   // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerController*                   K2Node_DynamicCast_AsPal_Player_Controller_2;      // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerRadialMenu_C_ExecuteUbergraph_WBP_PlayerRadialMenu) == 0x000008, "Wrong alignment on WBP_PlayerRadialMenu_C_ExecuteUbergraph_WBP_PlayerRadialMenu");
static_assert(sizeof(WBP_PlayerRadialMenu_C_ExecuteUbergraph_WBP_PlayerRadialMenu) == 0x0000C8, "Wrong size on WBP_PlayerRadialMenu_C_ExecuteUbergraph_WBP_PlayerRadialMenu");
static_assert(offsetof(WBP_PlayerRadialMenu_C_ExecuteUbergraph_WBP_PlayerRadialMenu, EntryPoint) == 0x000000, "Member 'WBP_PlayerRadialMenu_C_ExecuteUbergraph_WBP_PlayerRadialMenu::EntryPoint' has a wrong offset!");
