#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MapMarker_Win

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_MapMarker_Win.WBP_MapMarker_Win_C.ChangeCustomIcon__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_MapMarker_Win_C_ChangeCustomIcon__DelegateSignature final
{
public:
	class UWBP_Map_IconCustom_C*                  Icon;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapMarker_Win_C_ChangeCustomIcon__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MapMarker_Win_C_ChangeCustomIcon__DelegateSignature");
static_assert(sizeof(WBP_MapMarker_Win_C_ChangeCustomIcon__DelegateSignature) == 0x000010, "Wrong size on WBP_MapMarker_Win_C_ChangeCustomIcon__DelegateSignature");
static_assert(offsetof(WBP_MapMarker_Win_C_ChangeCustomIcon__DelegateSignature, Icon) == 0x000000, "Member 'WBP_MapMarker_Win_C_ChangeCustomIcon__DelegateSignature::Icon' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ChangeCustomIcon__DelegateSignature, Param_Index) == 0x000008, "Member 'WBP_MapMarker_Win_C_ChangeCustomIcon__DelegateSignature::Param_Index' has a wrong offset!");

// Function WBP_MapMarker_Win.WBP_MapMarker_Win_C.ChangeIconType
// 0x0004 (0x0004 - 0x0000)
struct WBP_MapMarker_Win_C_ChangeIconType final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapMarker_Win_C_ChangeIconType) == 0x000004, "Wrong alignment on WBP_MapMarker_Win_C_ChangeIconType");
static_assert(sizeof(WBP_MapMarker_Win_C_ChangeIconType) == 0x000004, "Wrong size on WBP_MapMarker_Win_C_ChangeIconType");
static_assert(offsetof(WBP_MapMarker_Win_C_ChangeIconType, Param_Index) == 0x000000, "Member 'WBP_MapMarker_Win_C_ChangeIconType::Param_Index' has a wrong offset!");

// Function WBP_MapMarker_Win.WBP_MapMarker_Win_C.ExecuteUbergraph_WBP_MapMarker_Win
// 0x0300 (0x0300 - 0x0000)
struct WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52E7[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52E8[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52E9[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable_2;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_3;                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52EA[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MapMarker_Content_C*               CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_MapMarker_Content_C*>       K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52EB[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Index)>                  K2Node_CreateDelegate_OutputDelegate_1;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52EC[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Map_IconCustom_C*                  K2Node_CustomEvent_CustomIcon;                     // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_MapMarker_Content_C*               CallFunc_Array_Get_Item_2;                         // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52ED[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MapMarker_Content_C*               CallFunc_Array_Get_Item_3;                         // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MapMarker_Content_C*               CallFunc_Array_Get_Item_4;                         // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x00C8(0x0008)(NoDestructor)
	class UWBP_MapMarker_Content_C*               CallFunc_Array_Get_Item_5;                         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MapMarker_Content_C*               CallFunc_Array_Get_Item_6;                         // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52EE[0x3];                                     // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalGameSetting*                        CallFunc_GetGameSetting_ReturnValue;               // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalLocationManager*                    CallFunc_GetLocationManager_ReturnValue;           // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLocalCustomLocationCount_ReturnValue;  // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52EF[0x4];                                     // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0108(0x0050)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52F0[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0168(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01B8(0x0010)(ReferenceParm)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01D0(0x0018)()
	class UPalGameSetting*                        CallFunc_GetGameSetting_ReturnValue_1;             // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalLocationManager*                    CallFunc_GetLocationManager_ReturnValue_1;         // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_2;            // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLocalCustomLocationCount_ReturnValue_1; // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52F1[0x4];                                     // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0208(0x0050)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_3;            // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52F2[0x7];                                     // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0268(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x02B8(0x0010)(ReferenceParm)
	class UMaterialInterface*                     K2Node_Select_Default_1;                           // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x02D0(0x0018)()
	class UPalLocationPoint*                      CallFunc_GetLocationPoint_LocationPoint;           // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalLocationPoint_Custom*               K2Node_DynamicCast_AsPal_Location_Point_Custom;    // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52F3[0x3];                                     // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIconType_ReturnValue;                  // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win) == 0x000008, "Wrong alignment on WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win");
static_assert(sizeof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win) == 0x000300, "Wrong size on WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, EntryPoint) == 0x000000, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, Temp_bool_Variable) == 0x000004, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, Temp_object_Variable) == 0x000010, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, Temp_object_Variable_1) == 0x000018, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, Temp_bool_Variable_1) == 0x000020, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, Temp_object_Variable_2) == 0x000028, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, Temp_object_Variable_3) == 0x000030, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, Temp_int_Array_Index_Variable) == 0x000038, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, Temp_int_Array_Index_Variable_1) == 0x000050, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, K2Node_CreateDelegate_OutputDelegate) == 0x000054, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, Temp_int_Loop_Counter_Variable_1) == 0x000064, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, K2Node_MakeArray_Array) == 0x000068, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, CallFunc_Add_IntInt_ReturnValue_1) == 0x00007C, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, K2Node_CreateDelegate_OutputDelegate_1) == 0x000080, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, K2Node_CustomEvent_Index) == 0x000090, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, K2Node_CustomEvent_CustomIcon) == 0x000098, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::K2Node_CustomEvent_CustomIcon' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, CallFunc_Array_Get_Item_1) == 0x0000A0, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, CallFunc_Array_Get_Item_2) == 0x0000A8, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000B0, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, CallFunc_Array_Get_Item_3) == 0x0000B8, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, CallFunc_Array_Get_Item_4) == 0x0000C0, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, K2Node_Event_InFocusEvent) == 0x0000C8, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, CallFunc_Array_Get_Item_5) == 0x0000D0, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, CallFunc_Array_Get_Item_6) == 0x0000D8, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, CallFunc_Array_Length_ReturnValue_1) == 0x0000E0, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000E4, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, CallFunc_GetGameSetting_ReturnValue) == 0x0000E8, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::CallFunc_GetGameSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, CallFunc_GetLocationManager_ReturnValue) == 0x0000F0, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::CallFunc_GetLocationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0000F8, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, CallFunc_GetLocalCustomLocationCount_ReturnValue) == 0x000100, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::CallFunc_GetLocalCustomLocationCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, K2Node_MakeStruct_FormatArgumentData) == 0x000108, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000158, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000160, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, K2Node_MakeStruct_FormatArgumentData_1) == 0x000168, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, K2Node_MakeArray_Array_1) == 0x0001B8, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, K2Node_Select_Default) == 0x0001C8, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, CallFunc_Format_ReturnValue) == 0x0001D0, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, CallFunc_GetGameSetting_ReturnValue_1) == 0x0001E8, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::CallFunc_GetGameSetting_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, CallFunc_GetLocationManager_ReturnValue_1) == 0x0001F0, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::CallFunc_GetLocationManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, CallFunc_Conv_IntToInt64_ReturnValue_2) == 0x0001F8, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::CallFunc_Conv_IntToInt64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, CallFunc_GetLocalCustomLocationCount_ReturnValue_1) == 0x000200, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::CallFunc_GetLocalCustomLocationCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, K2Node_MakeStruct_FormatArgumentData_2) == 0x000208, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, CallFunc_Conv_IntToInt64_ReturnValue_3) == 0x000258, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::CallFunc_Conv_IntToInt64_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000260, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, K2Node_MakeStruct_FormatArgumentData_3) == 0x000268, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, K2Node_MakeArray_Array_2) == 0x0002B8, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, K2Node_Select_Default_1) == 0x0002C8, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, CallFunc_Format_ReturnValue_1) == 0x0002D0, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, CallFunc_GetLocationPoint_LocationPoint) == 0x0002E8, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::CallFunc_GetLocationPoint_LocationPoint' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, K2Node_DynamicCast_AsPal_Location_Point_Custom) == 0x0002F0, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::K2Node_DynamicCast_AsPal_Location_Point_Custom' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, K2Node_DynamicCast_bSuccess) == 0x0002F8, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win, CallFunc_GetIconType_ReturnValue) == 0x0002FC, "Member 'WBP_MapMarker_Win_C_ExecuteUbergraph_WBP_MapMarker_Win::CallFunc_GetIconType_ReturnValue' has a wrong offset!");

// Function WBP_MapMarker_Win.WBP_MapMarker_Win_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_MapMarker_Win_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_MapMarker_Win_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on WBP_MapMarker_Win_C_OnRemovedFromFocusPath");
static_assert(sizeof(WBP_MapMarker_Win_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on WBP_MapMarker_Win_C_OnRemovedFromFocusPath");
static_assert(offsetof(WBP_MapMarker_Win_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_MapMarker_Win_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_MapMarker_Win.WBP_MapMarker_Win_C.RemoveCustomIcon__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MapMarker_Win_C_RemoveCustomIcon__DelegateSignature final
{
public:
	class UWBP_Map_IconCustom_C*                  Icon;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapMarker_Win_C_RemoveCustomIcon__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MapMarker_Win_C_RemoveCustomIcon__DelegateSignature");
static_assert(sizeof(WBP_MapMarker_Win_C_RemoveCustomIcon__DelegateSignature) == 0x000008, "Wrong size on WBP_MapMarker_Win_C_RemoveCustomIcon__DelegateSignature");
static_assert(offsetof(WBP_MapMarker_Win_C_RemoveCustomIcon__DelegateSignature, Icon) == 0x000000, "Member 'WBP_MapMarker_Win_C_RemoveCustomIcon__DelegateSignature::Icon' has a wrong offset!");

// Function WBP_MapMarker_Win.WBP_MapMarker_Win_C.SetEdittingIcon
// 0x0008 (0x0008 - 0x0000)
struct WBP_MapMarker_Win_C_SetEdittingIcon final
{
public:
	class UWBP_Map_IconCustom_C*                  CustomIcon;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapMarker_Win_C_SetEdittingIcon) == 0x000008, "Wrong alignment on WBP_MapMarker_Win_C_SetEdittingIcon");
static_assert(sizeof(WBP_MapMarker_Win_C_SetEdittingIcon) == 0x000008, "Wrong size on WBP_MapMarker_Win_C_SetEdittingIcon");
static_assert(offsetof(WBP_MapMarker_Win_C_SetEdittingIcon, CustomIcon) == 0x000000, "Member 'WBP_MapMarker_Win_C_SetEdittingIcon::CustomIcon' has a wrong offset!");

}

