#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MenuESC_Button

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_PalEscMenuType_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MenuESC_Button.WBP_MenuESC_Button_C
// 0x0098 (0x0310 - 0x0278)
class UWBP_MenuESC_Button_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anm_NormalToFocus;                                 // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base;                                              // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame;                                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_Main;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalInvisibleButton_C*              WBP_PalInvisibleButton;                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnClicked;                                         // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	E_PalEscMenuType                              MenuType;                                          // 0x02B8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CBB[0x7];                                     // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<E_PalEscMenuType, struct FDataTableRowHandle> TextIDMap;                                         // 0x02C0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AnmEvent_Focus();
	void AnmEvent_Normal();
	void AnmEvent_Reset();
	void BndEvt__WBP_MenuESC_Button_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_MenuESC_Button_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_MenuESC_Button_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Construct();
	void ExecuteUbergraph_WBP_MenuESC_Button(int32 EntryPoint);
	void OnClicked__DelegateSignature(E_PalEscMenuType Param_MenuType);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MenuESC_Button_C">();
	}
	static class UWBP_MenuESC_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MenuESC_Button_C>();
	}
};
static_assert(alignof(UWBP_MenuESC_Button_C) == 0x000008, "Wrong alignment on UWBP_MenuESC_Button_C");
static_assert(sizeof(UWBP_MenuESC_Button_C) == 0x000310, "Wrong size on UWBP_MenuESC_Button_C");
static_assert(offsetof(UWBP_MenuESC_Button_C, UberGraphFrame) == 0x000278, "Member 'UWBP_MenuESC_Button_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MenuESC_Button_C, Anm_NormalToFocus) == 0x000280, "Member 'UWBP_MenuESC_Button_C::Anm_NormalToFocus' has a wrong offset!");
static_assert(offsetof(UWBP_MenuESC_Button_C, Base) == 0x000288, "Member 'UWBP_MenuESC_Button_C::Base' has a wrong offset!");
static_assert(offsetof(UWBP_MenuESC_Button_C, Frame) == 0x000290, "Member 'UWBP_MenuESC_Button_C::Frame' has a wrong offset!");
static_assert(offsetof(UWBP_MenuESC_Button_C, Text_Main) == 0x000298, "Member 'UWBP_MenuESC_Button_C::Text_Main' has a wrong offset!");
static_assert(offsetof(UWBP_MenuESC_Button_C, WBP_PalInvisibleButton) == 0x0002A0, "Member 'UWBP_MenuESC_Button_C::WBP_PalInvisibleButton' has a wrong offset!");
static_assert(offsetof(UWBP_MenuESC_Button_C, OnClicked) == 0x0002A8, "Member 'UWBP_MenuESC_Button_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UWBP_MenuESC_Button_C, MenuType) == 0x0002B8, "Member 'UWBP_MenuESC_Button_C::MenuType' has a wrong offset!");
static_assert(offsetof(UWBP_MenuESC_Button_C, TextIDMap) == 0x0002C0, "Member 'UWBP_MenuESC_Button_C::TextIDMap' has a wrong offset!");

}

