#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IngameMenu_Chest_LockSettings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Pal_structs.hpp"
#include "Pal_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_IngameMenu_Chest_LockSettings.WBP_IngameMenu_Chest_LockSettings_C
// 0x0040 (0x0470 - 0x0430)
class UWBP_IngameMenu_Chest_LockSettings_C final : public UPalUserWidgetOverlayUI
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCheckBox*                              CheckBox_80;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonButton_C*                    WBP_CommonButton;                                  // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonButton_C*                    WBP_CommonButton_1;                                // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_btn_C*                        WBP_Menu_btn;                                      // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalInvisibleButton_C*              WBP_PalInvisibleButton;                            // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPalMapObjectPasswordLockModule*        PasswordLockModule;                                // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   TabActionName;                                     // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_IngameMenu_Chest_LockSettings_WBP_CommonButton_1_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();
	void BndEvt__WBP_IngameMenu_Chest_LockSettings_WBP_CommonButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void BndEvt__WBP_IngameMenu_Chest_LockSettings_WBP_Menu_btn_K2Node_ComponentBoundEvent_3_OnButtonClicked__DelegateSignature();
	void BndEvt__WBP_IngameMenu_Chest_LockSettings_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WBP_IngameMenu_Chest_LockSettings(int32 EntryPoint);
	void OnSetup();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_IngameMenu_Chest_LockSettings_C">();
	}
	static class UWBP_IngameMenu_Chest_LockSettings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_IngameMenu_Chest_LockSettings_C>();
	}
};
static_assert(alignof(UWBP_IngameMenu_Chest_LockSettings_C) == 0x000008, "Wrong alignment on UWBP_IngameMenu_Chest_LockSettings_C");
static_assert(sizeof(UWBP_IngameMenu_Chest_LockSettings_C) == 0x000470, "Wrong size on UWBP_IngameMenu_Chest_LockSettings_C");
static_assert(offsetof(UWBP_IngameMenu_Chest_LockSettings_C, UberGraphFrame) == 0x000430, "Member 'UWBP_IngameMenu_Chest_LockSettings_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_LockSettings_C, CheckBox_80) == 0x000438, "Member 'UWBP_IngameMenu_Chest_LockSettings_C::CheckBox_80' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_LockSettings_C, WBP_CommonButton) == 0x000440, "Member 'UWBP_IngameMenu_Chest_LockSettings_C::WBP_CommonButton' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_LockSettings_C, WBP_CommonButton_1) == 0x000448, "Member 'UWBP_IngameMenu_Chest_LockSettings_C::WBP_CommonButton_1' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_LockSettings_C, WBP_Menu_btn) == 0x000450, "Member 'UWBP_IngameMenu_Chest_LockSettings_C::WBP_Menu_btn' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_LockSettings_C, WBP_PalInvisibleButton) == 0x000458, "Member 'UWBP_IngameMenu_Chest_LockSettings_C::WBP_PalInvisibleButton' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_LockSettings_C, PasswordLockModule) == 0x000460, "Member 'UWBP_IngameMenu_Chest_LockSettings_C::PasswordLockModule' has a wrong offset!");
static_assert(offsetof(UWBP_IngameMenu_Chest_LockSettings_C, TabActionName) == 0x000468, "Member 'UWBP_IngameMenu_Chest_LockSettings_C::TabActionName' has a wrong offset!");

}

