#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PalConvertItemMenu_RecipeSlotButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Pal_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PalConvertItemMenu_RecipeSlotButton.WBP_PalConvertItemMenu_RecipeSlotButton_C
// 0x0110 (0x0518 - 0x0408)
class UWBP_PalConvertItemMenu_RecipeSlotButton_C final : public UPalUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0408(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anm_rarity;                                        // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anm_Select;                                        // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base;                                              // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Num;                                   // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanelRarety;                                 // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocusBase;                                         // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocusFrame;                                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Focus_Flare;                                 // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Disable;                                     // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                     Text_Num;                                          // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventoryEquipment_PalIcon_C*      WBP_InventoryEquipment_PalIcon;                    // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalInGameMenuItemIcon_C*           WBP_PalInGameMenuItemIcon;                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PalInvisibleButton_C*              WBP_PalInvisibleButton;                            // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnClickSlot;                                       // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FName                                   RecipeID;                                          // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnHoveredSlot;                                     // 0x0490(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnUnhoveredSlot;                                   // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          Selected;                                          // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_576B[0x7];                                     // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, int32>                      MatMap;                                            // 0x04B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   Product_Id;                                        // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           UpdateSufficientTimer;                             // 0x0510(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_PalConvertItemMenu_RecipeSlotButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_PalConvertItemMenu_RecipeSlotButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_PalConvertItemMenu_RecipeSlotButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Destruct();
	void ExecuteUbergraph_WBP_PalConvertItemMenu_RecipeSlotButton(int32 EntryPoint);
	void GetRecipeId(class FName* Param_RecipeID);
	void OnClickSlot__DelegateSignature(class UWBP_PalConvertItemMenu_RecipeSlotButton_C* SelfWidget);
	void OnHoveredSlot__DelegateSignature(class UWBP_PalConvertItemMenu_RecipeSlotButton_C* SelfWidget);
	void OnUnhoveredSlot__DelegateSignature(class UWBP_PalConvertItemMenu_RecipeSlotButton_C* SelfWidget);
	void SetPalGearIcon(class FName ItemId);
	void SetUnselect();
	void Setup(class FName Param_RecipeID);
	void UpdateSufficient();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PalConvertItemMenu_RecipeSlotButton_C">();
	}
	static class UWBP_PalConvertItemMenu_RecipeSlotButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PalConvertItemMenu_RecipeSlotButton_C>();
	}
};
static_assert(alignof(UWBP_PalConvertItemMenu_RecipeSlotButton_C) == 0x000008, "Wrong alignment on UWBP_PalConvertItemMenu_RecipeSlotButton_C");
static_assert(sizeof(UWBP_PalConvertItemMenu_RecipeSlotButton_C) == 0x000518, "Wrong size on UWBP_PalConvertItemMenu_RecipeSlotButton_C");
static_assert(offsetof(UWBP_PalConvertItemMenu_RecipeSlotButton_C, UberGraphFrame) == 0x000408, "Member 'UWBP_PalConvertItemMenu_RecipeSlotButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PalConvertItemMenu_RecipeSlotButton_C, Anm_rarity) == 0x000410, "Member 'UWBP_PalConvertItemMenu_RecipeSlotButton_C::Anm_rarity' has a wrong offset!");
static_assert(offsetof(UWBP_PalConvertItemMenu_RecipeSlotButton_C, Anm_Select) == 0x000418, "Member 'UWBP_PalConvertItemMenu_RecipeSlotButton_C::Anm_Select' has a wrong offset!");
static_assert(offsetof(UWBP_PalConvertItemMenu_RecipeSlotButton_C, Base) == 0x000420, "Member 'UWBP_PalConvertItemMenu_RecipeSlotButton_C::Base' has a wrong offset!");
static_assert(offsetof(UWBP_PalConvertItemMenu_RecipeSlotButton_C, CanvasPanel_Num) == 0x000428, "Member 'UWBP_PalConvertItemMenu_RecipeSlotButton_C::CanvasPanel_Num' has a wrong offset!");
static_assert(offsetof(UWBP_PalConvertItemMenu_RecipeSlotButton_C, CanvasPanelRarety) == 0x000430, "Member 'UWBP_PalConvertItemMenu_RecipeSlotButton_C::CanvasPanelRarety' has a wrong offset!");
static_assert(offsetof(UWBP_PalConvertItemMenu_RecipeSlotButton_C, FocusBase) == 0x000438, "Member 'UWBP_PalConvertItemMenu_RecipeSlotButton_C::FocusBase' has a wrong offset!");
static_assert(offsetof(UWBP_PalConvertItemMenu_RecipeSlotButton_C, FocusFrame) == 0x000440, "Member 'UWBP_PalConvertItemMenu_RecipeSlotButton_C::FocusFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PalConvertItemMenu_RecipeSlotButton_C, Frame_Focus_Flare) == 0x000448, "Member 'UWBP_PalConvertItemMenu_RecipeSlotButton_C::Frame_Focus_Flare' has a wrong offset!");
static_assert(offsetof(UWBP_PalConvertItemMenu_RecipeSlotButton_C, Image_Disable) == 0x000450, "Member 'UWBP_PalConvertItemMenu_RecipeSlotButton_C::Image_Disable' has a wrong offset!");
static_assert(offsetof(UWBP_PalConvertItemMenu_RecipeSlotButton_C, Text_Num) == 0x000458, "Member 'UWBP_PalConvertItemMenu_RecipeSlotButton_C::Text_Num' has a wrong offset!");
static_assert(offsetof(UWBP_PalConvertItemMenu_RecipeSlotButton_C, WBP_InventoryEquipment_PalIcon) == 0x000460, "Member 'UWBP_PalConvertItemMenu_RecipeSlotButton_C::WBP_InventoryEquipment_PalIcon' has a wrong offset!");
static_assert(offsetof(UWBP_PalConvertItemMenu_RecipeSlotButton_C, WBP_PalInGameMenuItemIcon) == 0x000468, "Member 'UWBP_PalConvertItemMenu_RecipeSlotButton_C::WBP_PalInGameMenuItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_PalConvertItemMenu_RecipeSlotButton_C, WBP_PalInvisibleButton) == 0x000470, "Member 'UWBP_PalConvertItemMenu_RecipeSlotButton_C::WBP_PalInvisibleButton' has a wrong offset!");
static_assert(offsetof(UWBP_PalConvertItemMenu_RecipeSlotButton_C, OnClickSlot) == 0x000478, "Member 'UWBP_PalConvertItemMenu_RecipeSlotButton_C::OnClickSlot' has a wrong offset!");
static_assert(offsetof(UWBP_PalConvertItemMenu_RecipeSlotButton_C, RecipeID) == 0x000488, "Member 'UWBP_PalConvertItemMenu_RecipeSlotButton_C::RecipeID' has a wrong offset!");
static_assert(offsetof(UWBP_PalConvertItemMenu_RecipeSlotButton_C, OnHoveredSlot) == 0x000490, "Member 'UWBP_PalConvertItemMenu_RecipeSlotButton_C::OnHoveredSlot' has a wrong offset!");
static_assert(offsetof(UWBP_PalConvertItemMenu_RecipeSlotButton_C, OnUnhoveredSlot) == 0x0004A0, "Member 'UWBP_PalConvertItemMenu_RecipeSlotButton_C::OnUnhoveredSlot' has a wrong offset!");
static_assert(offsetof(UWBP_PalConvertItemMenu_RecipeSlotButton_C, Selected) == 0x0004B0, "Member 'UWBP_PalConvertItemMenu_RecipeSlotButton_C::Selected' has a wrong offset!");
static_assert(offsetof(UWBP_PalConvertItemMenu_RecipeSlotButton_C, MatMap) == 0x0004B8, "Member 'UWBP_PalConvertItemMenu_RecipeSlotButton_C::MatMap' has a wrong offset!");
static_assert(offsetof(UWBP_PalConvertItemMenu_RecipeSlotButton_C, Product_Id) == 0x000508, "Member 'UWBP_PalConvertItemMenu_RecipeSlotButton_C::Product_Id' has a wrong offset!");
static_assert(offsetof(UWBP_PalConvertItemMenu_RecipeSlotButton_C, UpdateSufficientTimer) == 0x000510, "Member 'UWBP_PalConvertItemMenu_RecipeSlotButton_C::UpdateSufficientTimer' has a wrong offset!");

}

