#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InventoryEquipment_TabList

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_InventoryEquipment_TabList.WBP_InventoryEquipment_TabList_C.BndEvt__WBP_InventoryEquipment_TabList_WBP_InventoryEquipment_InventoryTabButton_Essential_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_InventoryEquipment_TabList_C_BndEvt__WBP_InventoryEquipment_TabList_WBP_InventoryEquipment_InventoryTabButton_Essential_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature final
{
public:
	class UWBP_InventoryEquipment_InventoryTabButton_C* Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventoryEquipment_TabList_C_BndEvt__WBP_InventoryEquipment_TabList_WBP_InventoryEquipment_InventoryTabButton_Essential_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_InventoryEquipment_TabList_C_BndEvt__WBP_InventoryEquipment_TabList_WBP_InventoryEquipment_InventoryTabButton_Essential_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_InventoryEquipment_TabList_C_BndEvt__WBP_InventoryEquipment_TabList_WBP_InventoryEquipment_InventoryTabButton_Essential_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_InventoryEquipment_TabList_C_BndEvt__WBP_InventoryEquipment_TabList_WBP_InventoryEquipment_InventoryTabButton_Essential_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_InventoryEquipment_TabList_C_BndEvt__WBP_InventoryEquipment_TabList_WBP_InventoryEquipment_InventoryTabButton_Essential_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_InventoryEquipment_TabList_C_BndEvt__WBP_InventoryEquipment_TabList_WBP_InventoryEquipment_InventoryTabButton_Essential_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_InventoryEquipment_TabList.WBP_InventoryEquipment_TabList_C.BndEvt__WBP_InventoryEquipment_TabList_WBP_InventoryEquipment_InventoryTabButton_Inventory_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_InventoryEquipment_TabList_C_BndEvt__WBP_InventoryEquipment_TabList_WBP_InventoryEquipment_InventoryTabButton_Inventory_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature final
{
public:
	class UWBP_InventoryEquipment_InventoryTabButton_C* Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventoryEquipment_TabList_C_BndEvt__WBP_InventoryEquipment_TabList_WBP_InventoryEquipment_InventoryTabButton_Inventory_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_InventoryEquipment_TabList_C_BndEvt__WBP_InventoryEquipment_TabList_WBP_InventoryEquipment_InventoryTabButton_Inventory_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_InventoryEquipment_TabList_C_BndEvt__WBP_InventoryEquipment_TabList_WBP_InventoryEquipment_InventoryTabButton_Inventory_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_InventoryEquipment_TabList_C_BndEvt__WBP_InventoryEquipment_TabList_WBP_InventoryEquipment_InventoryTabButton_Inventory_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_InventoryEquipment_TabList_C_BndEvt__WBP_InventoryEquipment_TabList_WBP_InventoryEquipment_InventoryTabButton_Inventory_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_InventoryEquipment_TabList_C_BndEvt__WBP_InventoryEquipment_TabList_WBP_InventoryEquipment_InventoryTabButton_Inventory_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_InventoryEquipment_TabList.WBP_InventoryEquipment_TabList_C.BndEvt__WBP_InventoryEquipment_TabList_WBP_PalInvisibleButton_Sort_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_InventoryEquipment_TabList_C_BndEvt__WBP_InventoryEquipment_TabList_WBP_PalInvisibleButton_Sort_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventoryEquipment_TabList_C_BndEvt__WBP_InventoryEquipment_TabList_WBP_PalInvisibleButton_Sort_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_InventoryEquipment_TabList_C_BndEvt__WBP_InventoryEquipment_TabList_WBP_PalInvisibleButton_Sort_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_InventoryEquipment_TabList_C_BndEvt__WBP_InventoryEquipment_TabList_WBP_PalInvisibleButton_Sort_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_InventoryEquipment_TabList_C_BndEvt__WBP_InventoryEquipment_TabList_WBP_PalInvisibleButton_Sort_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_InventoryEquipment_TabList_C_BndEvt__WBP_InventoryEquipment_TabList_WBP_PalInvisibleButton_Sort_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_InventoryEquipment_TabList_C_BndEvt__WBP_InventoryEquipment_TabList_WBP_PalInvisibleButton_Sort_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_InventoryEquipment_TabList.WBP_InventoryEquipment_TabList_C.ExecuteUbergraph_WBP_InventoryEquipment_TabList
// 0x0050 (0x0050 - 0x0000)
struct WBP_InventoryEquipment_TabList_C_ExecuteUbergraph_WBP_InventoryEquipment_TabList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 OldIndex, int32 NewIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 OldIndex, int32 NewIndex)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 OldIndex, int32 NewIndex, class UWidget* FocusTargetWidget)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5919[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventoryEquipment_InventoryTabButton_C* K2Node_ComponentBoundEvent_Button_1;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventoryEquipment_InventoryTabButton_C* K2Node_ComponentBoundEvent_Button;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventoryEquipment_TabList_C_ExecuteUbergraph_WBP_InventoryEquipment_TabList) == 0x000008, "Wrong alignment on WBP_InventoryEquipment_TabList_C_ExecuteUbergraph_WBP_InventoryEquipment_TabList");
static_assert(sizeof(WBP_InventoryEquipment_TabList_C_ExecuteUbergraph_WBP_InventoryEquipment_TabList) == 0x000050, "Wrong size on WBP_InventoryEquipment_TabList_C_ExecuteUbergraph_WBP_InventoryEquipment_TabList");
static_assert(offsetof(WBP_InventoryEquipment_TabList_C_ExecuteUbergraph_WBP_InventoryEquipment_TabList, EntryPoint) == 0x000000, "Member 'WBP_InventoryEquipment_TabList_C_ExecuteUbergraph_WBP_InventoryEquipment_TabList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TabList_C_ExecuteUbergraph_WBP_InventoryEquipment_TabList, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_InventoryEquipment_TabList_C_ExecuteUbergraph_WBP_InventoryEquipment_TabList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TabList_C_ExecuteUbergraph_WBP_InventoryEquipment_TabList, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_InventoryEquipment_TabList_C_ExecuteUbergraph_WBP_InventoryEquipment_TabList::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TabList_C_ExecuteUbergraph_WBP_InventoryEquipment_TabList, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'WBP_InventoryEquipment_TabList_C_ExecuteUbergraph_WBP_InventoryEquipment_TabList::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TabList_C_ExecuteUbergraph_WBP_InventoryEquipment_TabList, K2Node_ComponentBoundEvent_Button_2) == 0x000038, "Member 'WBP_InventoryEquipment_TabList_C_ExecuteUbergraph_WBP_InventoryEquipment_TabList::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TabList_C_ExecuteUbergraph_WBP_InventoryEquipment_TabList, K2Node_ComponentBoundEvent_Button_1) == 0x000040, "Member 'WBP_InventoryEquipment_TabList_C_ExecuteUbergraph_WBP_InventoryEquipment_TabList::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TabList_C_ExecuteUbergraph_WBP_InventoryEquipment_TabList, K2Node_ComponentBoundEvent_Button) == 0x000048, "Member 'WBP_InventoryEquipment_TabList_C_ExecuteUbergraph_WBP_InventoryEquipment_TabList::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function WBP_InventoryEquipment_TabList.WBP_InventoryEquipment_TabList_C.OnChangedIndex_Binded
// 0x0040 (0x0040 - 0x0000)
struct WBP_InventoryEquipment_TabList_C_OnChangedIndex_Binded final
{
public:
	int32                                         OldIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewIndex;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                FocusTargetWidget;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventoryEquipment_InventoryTabButton_C* K2Node_DynamicCast_AsWBP_Inventory_Equipment_Inventory_Tab_Button; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_591A[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventoryEquipment_InventoryTabButton_C* K2Node_DynamicCast_AsWBP_Inventory_Equipment_Inventory_Tab_Button_1; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventoryEquipment_TabList_C_OnChangedIndex_Binded) == 0x000008, "Wrong alignment on WBP_InventoryEquipment_TabList_C_OnChangedIndex_Binded");
static_assert(sizeof(WBP_InventoryEquipment_TabList_C_OnChangedIndex_Binded) == 0x000040, "Wrong size on WBP_InventoryEquipment_TabList_C_OnChangedIndex_Binded");
static_assert(offsetof(WBP_InventoryEquipment_TabList_C_OnChangedIndex_Binded, OldIndex) == 0x000000, "Member 'WBP_InventoryEquipment_TabList_C_OnChangedIndex_Binded::OldIndex' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TabList_C_OnChangedIndex_Binded, NewIndex) == 0x000004, "Member 'WBP_InventoryEquipment_TabList_C_OnChangedIndex_Binded::NewIndex' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TabList_C_OnChangedIndex_Binded, FocusTargetWidget) == 0x000008, "Member 'WBP_InventoryEquipment_TabList_C_OnChangedIndex_Binded::FocusTargetWidget' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TabList_C_OnChangedIndex_Binded, CallFunc_GetChildAt_ReturnValue) == 0x000010, "Member 'WBP_InventoryEquipment_TabList_C_OnChangedIndex_Binded::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TabList_C_OnChangedIndex_Binded, K2Node_DynamicCast_AsWBP_Inventory_Equipment_Inventory_Tab_Button) == 0x000018, "Member 'WBP_InventoryEquipment_TabList_C_OnChangedIndex_Binded::K2Node_DynamicCast_AsWBP_Inventory_Equipment_Inventory_Tab_Button' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TabList_C_OnChangedIndex_Binded, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_InventoryEquipment_TabList_C_OnChangedIndex_Binded::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TabList_C_OnChangedIndex_Binded, CallFunc_GetChildAt_ReturnValue_1) == 0x000028, "Member 'WBP_InventoryEquipment_TabList_C_OnChangedIndex_Binded::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TabList_C_OnChangedIndex_Binded, K2Node_DynamicCast_AsWBP_Inventory_Equipment_Inventory_Tab_Button_1) == 0x000030, "Member 'WBP_InventoryEquipment_TabList_C_OnChangedIndex_Binded::K2Node_DynamicCast_AsWBP_Inventory_Equipment_Inventory_Tab_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TabList_C_OnChangedIndex_Binded, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'WBP_InventoryEquipment_TabList_C_OnChangedIndex_Binded::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function WBP_InventoryEquipment_TabList.WBP_InventoryEquipment_TabList_C.OnNext_Binded
// 0x0008 (0x0008 - 0x0000)
struct WBP_InventoryEquipment_TabList_C_OnNext_Binded final
{
public:
	int32                                         OldIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewIndex;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventoryEquipment_TabList_C_OnNext_Binded) == 0x000004, "Wrong alignment on WBP_InventoryEquipment_TabList_C_OnNext_Binded");
static_assert(sizeof(WBP_InventoryEquipment_TabList_C_OnNext_Binded) == 0x000008, "Wrong size on WBP_InventoryEquipment_TabList_C_OnNext_Binded");
static_assert(offsetof(WBP_InventoryEquipment_TabList_C_OnNext_Binded, OldIndex) == 0x000000, "Member 'WBP_InventoryEquipment_TabList_C_OnNext_Binded::OldIndex' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TabList_C_OnNext_Binded, NewIndex) == 0x000004, "Member 'WBP_InventoryEquipment_TabList_C_OnNext_Binded::NewIndex' has a wrong offset!");

// Function WBP_InventoryEquipment_TabList.WBP_InventoryEquipment_TabList_C.OnPrev_Binded
// 0x0008 (0x0008 - 0x0000)
struct WBP_InventoryEquipment_TabList_C_OnPrev_Binded final
{
public:
	int32                                         OldIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewIndex;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventoryEquipment_TabList_C_OnPrev_Binded) == 0x000004, "Wrong alignment on WBP_InventoryEquipment_TabList_C_OnPrev_Binded");
static_assert(sizeof(WBP_InventoryEquipment_TabList_C_OnPrev_Binded) == 0x000008, "Wrong size on WBP_InventoryEquipment_TabList_C_OnPrev_Binded");
static_assert(offsetof(WBP_InventoryEquipment_TabList_C_OnPrev_Binded, OldIndex) == 0x000000, "Member 'WBP_InventoryEquipment_TabList_C_OnPrev_Binded::OldIndex' has a wrong offset!");
static_assert(offsetof(WBP_InventoryEquipment_TabList_C_OnPrev_Binded, NewIndex) == 0x000004, "Member 'WBP_InventoryEquipment_TabList_C_OnPrev_Binded::NewIndex' has a wrong offset!");

// Function WBP_InventoryEquipment_TabList.WBP_InventoryEquipment_TabList_C.RegisterPanelWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_InventoryEquipment_TabList_C_RegisterPanelWidget final
{
public:
	class UPanelWidget*                           PanelWidget;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventoryEquipment_TabList_C_RegisterPanelWidget) == 0x000008, "Wrong alignment on WBP_InventoryEquipment_TabList_C_RegisterPanelWidget");
static_assert(sizeof(WBP_InventoryEquipment_TabList_C_RegisterPanelWidget) == 0x000008, "Wrong size on WBP_InventoryEquipment_TabList_C_RegisterPanelWidget");
static_assert(offsetof(WBP_InventoryEquipment_TabList_C_RegisterPanelWidget, PanelWidget) == 0x000000, "Member 'WBP_InventoryEquipment_TabList_C_RegisterPanelWidget::PanelWidget' has a wrong offset!");

}

